{
  "name": "Pramod Varshney",
  "affiliation": "Distinguished Professor of EECS, Syracuse University",
  "interests": [
    "Signal processing and communications"
  ],
  "citedby": 43099,
  "h_index": 92,
  "i10_index": 472,
  "top_primary_author_publications": [
    {
      "title": "Distributed detection and data fusion",
      "year": 2012,
      "abstract": "This book provides an introductory treatment of the fundamentals of decision-making in a distributed framework. Classical detection theory assumes that complete observations are available at a central processor for decision-making. More recently, many applications have been identified in which observations are processed in a distributed manner and decisions are made at the distributed processors, or processed data (compressed observations) are conveyed to a fusion center that makes the global decision. Conventional detection theory has been extended so that it can deal with such distributed detection problems. A unified treatment of recent advances in this new branch of statistical decision theory is presented. Distributed detection under different formulations and for a variety of detection network topologies is discussed. This material is not available in any other book and has appeared relatively recently in technical journals. The level of presentation is such that the hook can be used as a graduate-level textbook. Numerous examples are presented throughout the book. It is assumed that the reader has been exposed to detection theory. The book will also serve as a useful reference for practicing engineers and researchers. I have actively pursued research on distributed detection and data fusion over the last decade, which ultimately interested me in writing this book. Many individuals have played a key role in the completion of this book.",
      "venue": "",
      "citations": 2458,
      "authors": [
        "Pramod K Varshney"
      ],
      "url": ""
    },
    {
      "title": "Distributed detection with multiple sensors Part I. Fundamentals",
      "year": 1997,
      "abstract": "In this paper basic results on distributed detection are reviewed. In particular we consider the parallel and the serial architectures in some detail and discuss the decision rules obtained from their optimization based an the Neyman-Pearson (NP) criterion and the Bayes formulation. For conditionally independent sensor observations, the optimality of the likelihood ratio test (LRT) at the sensors is established. General comments on several important issues are made including the computational complexity of obtaining the optimal solutions the design of detection networks with more general topologies, and applications to different areas.",
      "venue": "Proceedings of the IEEE",
      "citations": 1409,
      "authors": [
        "Ramanarayanan Viswanathan",
        "Pramod K Varshney"
      ],
      "url": ""
    },
    {
      "title": "Data aggregation techniques in sensor networks: A survey",
      "year": 2006,
      "abstract": "Wireless sensor networks consist of sensor nodes with sensing and communication capabilities. We focus on data aggregation problems in energy constrained sensor networks. The main goal of data aggregation algorithms is to gather and aggregate data in an energy efficient manner so that network lifetime is enhanced. In this paper, we present a survey of data aggregation algorithms in wireless sensor networks. We compare and contrast different algorithms on the basis of performance measures such as lifetime, latency and data accuracy. We conclude with possible future research directions.",
      "venue": "",
      "citations": 1245,
      "authors": [
        "Ramesh Rajagopalan",
        "Pramod K Varshney"
      ],
      "url": ""
    },
    {
      "title": "QoS support in wireless sensor networks: a survey.",
      "year": 2004,
      "abstract": "In this paper, we assess the state of the art of Quality of Services (QoS) support in wireless sensor networks (WSNs). Unlike traditional end-to-end multimedia applications, many non-end-to-end mission-critical applications envisioned for WSNs have brought forward new QoS requirements on the network. Further, unique characteristics of WSNs, such as extremely resource-constrained sensors, large-scale random deployment, and novel data-centric communication protocols, pose unprecedented challenges in the area of QoS support in WSNs. Thus, we first review the techniques for QoS support in traditional networks, analyze new QoS requirements in WSNs from a wide variety of applications classified by data delivery models, and propose some non-end-to-end collective QoS parameters. Next, the challenges of QoS support in this new paradigm are presented. Finally, we comment on current research efforts and identify many exciting open issues in order to stimulate more research interest in this largely unexplored area.",
      "venue": "International conference on wireless networks",
      "citations": 877,
      "authors": [
        "Dazhi Chen",
        "Pramod K Varshney"
      ],
      "url": ""
    },
    {
      "title": "Optimal data fusion in multiple sensor detection systems",
      "year": 1986,
      "abstract": "There is an increasing interest in employing multiple sensors for surveillance and communications. Some of the motivating factors are reliability, survivability, increase in the number of targets under consideration, and increase in required coverage. Tenney and Sandell have recently treated the Bayesian detection problem with distributed sensors. They did not consider the design of data fusion algorithms. We present an optimum data fusion structure given the detectors. Individual decisions are weighted according to the reliability of the detector and then a threshold comparison is performed to obtain the global decision.",
      "venue": "IEEE Transactions on Aerospace and Electronic Systems",
      "citations": 844,
      "authors": [
        "Z Chair",
        "PK Varshney"
      ],
      "url": ""
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "A pairwise key predistribution scheme for wireless sensor networks",
      "year": 2005,
      "abstract": "To achieve security in wireless sensor networks, it is important to be able to encrypt and authenticate messages sent between sensor nodes. Before doing so, keys for performing encryption and authentication must be agreed upon by the communicating parties. Due to resource constraints, however, achieving key agreement in wireless sensor networks is nontrivial. Many key agreement schemes used in general networks, such as Diffie-Hellman and other public-key based schemes, are not suitable for wireless sensor networks due to the limited computational abilities of the sensor nodes. Predistribution of secret keys for all pairs of nodes is not viable due to the large amount of memory this requires when the network size is large.In this paper, we provide a framework in which to study the security of key predistribution schemes, propose a new key predistribution scheme which substantially improves the resilience of …",
      "venue": "ACM Transactions on Information and System Security (TISSEC)",
      "citations": 2514,
      "authors": [
        "Wenliang Du",
        "Jing Deng",
        "Yunghsiang S Han",
        "Pramod K Varshney",
        "Jonathan Katz",
        "Aram Khalili"
      ],
      "url": ""
    },
    {
      "title": "A key management scheme for wireless sensor networks using deployment knowledge",
      "year": 2004,
      "abstract": "To achieve security in wireless sensor networks, it is important to he able to encrypt messages sent among sensor nodes. Keys for encryption purposes must he agreed upon by communicating nodes. Due to resource constraints, achieving such key agreement in wireless sensor networks is nontrivial. Many key agreement schemes used in general networks, such as Diffie-Hellman and public-key based schemes, are not suitable for wireless sensor networks. Pre-distribution of secret keys for all pairs of nodes is not viable due to the large amount of memory used when the network size is large. Recently, a random key pre-distribution scheme and its improvements have been proposed. A common assumption made by these random key pre-distribution schemes is that no deployment knowledge is available. Noticing that in many practical scenarios, certain deployment knowledge may be available a priori, we propose …",
      "venue": "IEEE INFOCOM 2004",
      "citations": 1418,
      "authors": [
        "Wenliang Du",
        "Jing Deng",
        "Yunghsiang S Han",
        "Shigang Chen",
        "Pramod K Varshney"
      ],
      "url": ""
    },
    {
      "title": "An acknowledgment-based approach for the detection of routing misbehavior in MANETs",
      "year": 2007,
      "abstract": "We study routing misbehavior in MANETs (mobile ad hoc networks) in this paper. In general, routing protocols for MANETs are designed based on the assumption that all participating nodes are fully cooperative. However, due to the open structure and scarcely available battery-based energy, node misbehaviors may exist. One such routing misbehavior is that some selfish nodes will participate in the route discovery and maintenance processes but refuse to forward data packets. In this paper, we propose the 2ACK scheme that serves as an add-on technique for routing schemes to detect routing misbehavior and to mitigate their adverse effect. The main idea of the 2ACK scheme is to send two-hop acknowledgment packets in the opposite direction of the routing path. In order to reduce additional routing overhead, only a fraction of the received data packets are acknowledged in the 2ACK scheme. Analytical and …",
      "venue": "IEEE transactions on mobile computing",
      "citations": 812,
      "authors": [
        "Kejun Liu",
        "Jing Deng",
        "Pramod K Varshney",
        "Kashyap Balakrishnan"
      ],
      "url": ""
    }
  ]
}