{
  "name": "Charles T. Driscoll",
  "affiliation": "Professor of Civil and Environmental Engineering, Syracuse University",
  "interests": [
    "environmental engineering",
    "environmental science",
    "biogeochemistry",
    "air pollution effects",
    "human disturbance of ecosystems"
  ],
  "citedby": 56785,
  "h_index": 119,
  "i10_index": 513,
  "top_primary_author_publications": [
    {
      "title": "Mercury as a global pollutant: sources, pathways, and effects",
      "year": 2013,
      "abstract": "Mercury (Hg) is a global pollutant that affects human and ecosystem health. We synthesize understanding of sources, atmosphere-land-ocean Hg dynamics and health effects, and consider the implications of Hg-control policies. Primary anthropogenic Hg emissions greatly exceed natural geogenic sources, resulting in increases in Hg reservoirs and subsequent secondary Hg emissions that facilitate its global distribution. The ultimate fate of emitted Hg is primarily recalcitrant soil pools and deep ocean waters and sediments. Transfers of Hg emissions to largely unavailable reservoirs occur over the time scale of centuries, and are primarily mediated through atmospheric exchanges of wet/dry deposition and evasion from vegetation, soil organic matter and ocean surfaces. A key link between inorganic Hg inputs and exposure of humans and wildlife is the net production of methylmercury, which occurs mainly in …",
      "venue": "Environmental science & technology",
      "citations": 2466,
      "authors": [
        "Charles T Driscoll",
        "Robert P Mason",
        "Hing Man Chan",
        "Daniel J Jacob",
        "Nicola Pirrone"
      ],
      "url": ""
    },
    {
      "title": "Long-term effects of acid rain: response and recovery of a forest ecosystem",
      "year": 1996,
      "abstract": "Long-term data from the Hubbard Brook Experimental Forest, New Hampshire, suggest that although changes in stream pH have been relatively small, large quantities of calcium and magnesium have been lost from the soil complex and exported by drainage water because of inputs of acid rain and declines in atmospheric deposition of base cations. As a result, the recovery of soil and streamwater chemistry in response to any decreases in acid deposition will be delayed significantly.",
      "venue": "Science",
      "citations": 1478,
      "authors": [
        "Gene E Likens",
        "Charles T Driscoll",
        "Donald C Buso"
      ],
      "url": ""
    },
    {
      "title": "Acidic Deposition in the Northeastern United States: Sources and Inputs, Ecosystem Effects, and Management Strategies: The effects of acidic deposition in the northeastern United States include the acidification of soil and water, which stresses terrestrial and aquatic biota",
      "year": 2001,
      "abstract": "Acidic deposition was first identified by R. A. Smith in England in the 19th century (Smith 1872). Acidic deposition emerged as an ecological issue in the late 1960s and early 1970s with reports of acidic precipitation and surface water acidification both within Sweden and around Scandinavia (Oden 1968). The first report of acidic precipitation in North America was made at the Hubbard Brook Experimental Forest (HBEF) in the remote White Mountains of New Hampshire, based on collections begun in the early 1960s (Likens et al. 1972). Controls on SO2 emissions in the United States were first implemented after passage of the 1970 amendments to the Clean Air Act (CAAA). In 1990, Congress passed Title IV of the Acid Deposition Control Program of the CAAA to further decrease emissions of SO2 and to initiate controls on NOx from electric utilities, which contribute to acidic deposition. The Acid Deposition Control …",
      "venue": "BioScience",
      "citations": 1388,
      "authors": [
        "Charles T Driscoll",
        "Gregory B Lawrence",
        "Arthur J Bulger",
        "Thomas J Butler",
        "Christopher S Cronan",
        "Christopher Eagar",
        "Kathleen F Lambert",
        "Gene E Likens",
        "John L Stoddard",
        "Kathleen C Weathers"
      ],
      "url": ""
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "Regional trends in aquatic recovery from acidification in North America and Europe",
      "year": 1999,
      "abstract": "Rates of acidic deposition from the atmosphere (‘acid rain’) have decreased throughout the 1980s and 1990s across large portions of North America and Europe,. Many recent studies have attributed observed reversals in surface-water acidification at national and regional scales to the declining deposition. To test whether emissions regulations have led to widespread recovery in surface-water chemistry, we analysed regional trends between 1980 and 1995 in indicators of acidification (sulphate, nitrate and base-cation concentrations, and measured (Gran) alkalinity) for 205 lakes and streams in eight regions of North America and Europe. Dramatic differences in trend direction and strength for the two decades are apparent. In concordance with general temporal trends in acidic deposition, lake and stream sulphate concentrations decreased in all regions with the exception of Great Britain; all but one of these …",
      "venue": "Nature",
      "citations": 1047,
      "authors": [
        "John L Stoddard",
        "DS Jeffries",
        "Al Lükewille",
        "TA Clair",
        "PJ Dillon",
        "CT Driscoll",
        "M Forsius",
        "M Johannessen",
        "JS Kahl",
        "JH Kellogg",
        "A Kemp",
        "J Mannio",
        "DT Monteith",
        "Peter S Murdoch",
        "S Patrick",
        "A Rebsdorf",
        "BL Skjelkvåle",
        "MP Stainton",
        "T Traaen",
        "H Van Dam",
        "KE Webster",
        "J Wieting",
        "A Wilander"
      ],
      "url": ""
    },
    {
      "title": "Acidification and alkalinization of soils",
      "year": 1983,
      "abstract": "Acidification or alkalinization of soils occurs through H+ transfer processes involving vegetation, soil solution and soil minerals. A permanent change in the acid neutralizing capacity of the inorganic soil fraction (ANC(s)),i.e. soil acidification (ΔANC<0) or soil alkalinization (ΔANC>0), results from an irreversible H+ flux. This irreversible H+ flux can be caused either by direct proton addition or depletion, by different mobility of components of the ANC(s) or by a permanent change in redox conditions. The contributions of (a) acidic atmospheric deposition, (b) nitrogen transformations, (c) deprotonation of CO2 and of organic acids and protonation of their conjugate bases, (d) assimilation of cations and anions by the vegetation, (e) weathering or reverse weathering of minerals and (f) stream output to changes in the ANC(s) are illustrated by means of H+ budgets for actual soils and watersheds.",
      "venue": "Plant and soil",
      "citations": 915,
      "authors": [
        "Nico Van Breemen",
        "J Mulder",
        "CT Driscoll"
      ],
      "url": ""
    },
    {
      "title": "Who needs environmental monitoring?",
      "year": 2007,
      "abstract": "Environmental monitoring is often criticized as being unscientific, too expensive, and wasteful. While some monitoring studies do suffer from these problems, there are also many highly successful long‐term monitoring programs that have provided important scientific advances and crucial information for environmental policy. Here, we discuss the characteristics of effective monitoring programs, and contend that monitoring should be considered a fundamental component of environmental science and policy. We urge scientists who develop monitoring programs to plan in advance to ensure high data quality, accessibility, and cost‐effectiveness, and we urge government agencies and other funding institutions to make greater commitments to increasing the amount and long‐term stability of funding for environmental monitoring programs.",
      "venue": "",
      "citations": 691,
      "authors": [
        "Gary M Lovett",
        "Douglas A Burns",
        "Charles T Driscoll",
        "Jennifer C Jenkins",
        "Myron J Mitchell",
        "Lindsey Rustad",
        "James B Shanley",
        "Gene E Likens",
        "Richard Haeuber"
      ],
      "url": ""
    }
  ]
}