{
  "name": "Elizabeth Carter",
  "affiliation": "Syracuse University",
  "interests": [
    "hydroclimatology",
    "hydrology",
    "remote sensing",
    "disaster mitigation and response"
  ],
  "citedby": 283,
  "h_index": 7,
  "i10_index": 7,
  "top_primary_author_publications": [
    {
      "title": "Separating heat stress from moisture stress: analyzing yield response to high temperature in irrigated maize",
      "year": 2016,
      "abstract": "Several recent studies have indicated that high air temperatures are limiting maize (Zea mays L.) yields in the US Corn Belt and project significant yield losses with expected increases in growing season temperatures. Further work has suggested that high air temperatures are indicative of high evaporative demand, and that decreases in maize yields which correlate to high temperatures and vapor pressure deficits (VPD) likely reflect underlying soil moisture limitations. It remains unclear whether direct high temperature impacts on yields, independent of moisture stress, can be observed under current temperature regimes. Given that projected high temperature and moisture may not co-vary the same way as they have historically, quantitative analyzes of direct temperature impacts are critical for accurate yield projections and targeted mitigation strategies under shifting temperature regimes. To evaluate yield …",
      "venue": "Environmental Research Letters",
      "citations": 104,
      "authors": [
        "Elizabeth K Carter",
        "Jeff Melkonian",
        "Susan J Riha",
        "Stephen B Shaw"
      ],
      "url": ""
    },
    {
      "title": "Mapping floods from remote sensing data and quantifying the effects of surface obstruction by clouds and vegetation",
      "year": 2023,
      "abstract": "Floods are one of the most devastating natural calamities affecting millions of people and causing damage all around the globe. Flood models and remote sensing imagery are often used to predict and understand flooding. An increasing number of earth observation satellites are producing data at a rate that far outpaces our ability to manually extract meaningful information from it, motivating a surge in research on automatic feature detection in satellite imagery using machine learning and deep learning algorithms to automate flood mapping so that information from large streams of data can be extracted in near-real time and used for disaster response at landscape scale. The development of such an algorithm is predicated on exposure to training datasets that are representative of the full range of diversity in the spatial and spectral signature of surface water as it is sampled by space-based instruments. To address …",
      "venue": "Remote Sensing of Environment",
      "citations": 49,
      "authors": [
        "Apoorva Shastry",
        "Elizabeth Carter",
        "Brian Coltin",
        "Rachel Sleeter",
        "Scott McMichael",
        "Jack Eggleston"
      ],
      "url": ""
    },
    {
      "title": "Rainfed maize yield response to management and climate covariability at large spatial scales",
      "year": 2018,
      "abstract": "Statistical analyses of yield and climate data across large spatial scales are an important method for exploring crop sensitivity to a variable and changing climate. However, a variety of issues complicate the interpretation of climate impacts on yield, including spatial and temporal collinearity among climate variables and between climate and management variables, as well as complex responses of yield to interactions among climate variables across different growth development phases. All of these issues, if unaccounted for, can compromise yield projections under climate change. In this study, we present a series of nested models to analyze rainfed maize (Zea mays L.) yield response to climate (temperature, precipitation, solar radiation) at specific growth-development phases and under different crop management practices. The models, fit using elastic net regression to address collinearity, indicate that spatial …",
      "venue": "Agricultural and Forest Meteorology",
      "citations": 35,
      "authors": [
        "Elizabeth K Carter",
        "Jeff Melkonian",
        "Scott Steinschneider",
        "Susan J Riha"
      ],
      "url": ""
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "Potential predictability of regional precipitation and discharge extremes using synoptic-scale climate information via machine learning: An evaluation for the eastern continental United States",
      "year": 2019,
      "abstract": "Current generation general circulation models (GCMs) simulate synoptic-scale climate state variables such as geopotential heights, specific humidity, and integrated vapor transport (IVT) more reliably than mesoscale precipitation. Statistical downscaling methods that condition precipitation on GCM-based, synoptic-scale climate features have shown promise in the reproduction of local precipitation. However, current approaches to climate-state-informed downscaling impose some limitations on the skill of precipitation reproduction, including hard clustering of climate modes into a discrete set of states, utilization of numerical clustering methodologies poorly suited to nonnormal data, and a tendency to focus on relationships to a limited set of large-scale climate modes. This study presents a methodology based on emerging machine learning techniques to develop global approximators of regional precipitation and …",
      "venue": "Journal of Hydrometeorology",
      "citations": 22,
      "authors": [
        "James Knighton",
        "Geoff Pleiss",
        "Elizabeth Carter",
        "Steven Lyon",
        "M Todd Walter",
        "Scott Steinschneider"
      ],
      "url": ""
    },
    {
      "title": "Predicting greenhouse gas benefits of improved nitrogen management in North American maize",
      "year": 2020,
      "abstract": "Farmers, food supply companies, and policymakers need practical yet scientifically robust methods to quantify how improved nitrogen (N) fertilizer management can reduce nitrous oxide (N2O) emissions. To meet this need, we developed an empirical model based on published field data for predicting N2O emission from rainfed maize (Zea mays L.) fields managed with inorganic N fertilizer in the United States and Canada. Nitrous oxide emissions ranged widely on an area basis (0.03–32.9 kg N ha−1 yr−1) and a yield‐scaled basis (0.006–4.8 kg N Mg−1 grain yr−1). We evaluated multiple modeling approaches and variables using three metrics of model fit (Akaike information criteria corrected for small sample sizes [AICc], RMSE, and R2). Our model explains 32.8% of the total observed variation and 50% of observed site‐level variation. Soil clay content was very important for predicting N2O emission and …",
      "venue": "",
      "citations": 5,
      "authors": [
        "Christina Tonitto",
        "Peter B Woodbury",
        "Elizabeth Carter"
      ],
      "url": ""
    },
    {
      "title": "California Margin temperatures modulate extreme summer precipitation in the desert Southwest",
      "year": 2023,
      "abstract": "In August 2022, Death Valley, the driest place in North America, experienced record flooding from summertime rainfall associated with the North American monsoon (NAM). Given the socioeconomic cost of these type of events, there is a dire need to understand their drivers and future statistics. Existing theory predicts that increases in the intensity of precipitation is a robust response to anthropogenic warming. Paleoclimatic evidence suggests that northeast Pacific (NEP) sea surface temperature (SST) variability could further intensify summertime NAM rainfall over the desert southwest. Drawing on this paleoclimatic evidence, we use historical observations and reanalyzes to test the hypothesis that warm SSTs on the southern California margin are linked to more frequent extreme precipitation events in the NAM domain. We find that summers with above-average coastal SSTs are more favorable to moist convection in …",
      "venue": "Environmental Research Letters",
      "citations": 2,
      "authors": [
        "Tripti Bhattacharya",
        "Ran Feng",
        "Chris Maupin",
        "Sloan Coats",
        "Peter Brennan",
        "Elizabeth Carter"
      ],
      "url": ""
    }
  ],
  "source": "scholar"
}