{
  "name": "Farzana Rahman",
  "affiliation": "Syracuse University",
  "interests": [
    "Mobile Healthcare",
    "CS Education",
    "Broadening Participation in CS",
    "IoT based Healthcare"
  ],
  "citedby": 1121,
  "h_index": 15,
  "i10_index": 31,
  "top_primary_author_publications": [
    {
      "title": "A privacy preserving framework for RFID based healthcare systems",
      "year": 2017,
      "abstract": "RFID (Radio Frequency IDentification) is anticipated to be a core technology that will be used in many practical applications of our life in near future. It has received considerable attention within the healthcare for almost a decade now. The technology’s promise to efficiently track hospital supplies, medical equipment, medications and patients is an attractive proposition to the healthcare industry. However, the prospect of wide spread use of RFID tags in the healthcare area has also triggered discussions regarding privacy, particularly because RFID data in transit may easily be intercepted and can be send to track its user (owner). In a nutshell, this technology has not really seen its true potential in healthcare industry since privacy concerns raised by the tag bearers are not properly addressed by existing identification techniques. There are two major types of privacy preservation techniques that are required in an …",
      "venue": "Future generation computer systems",
      "citations": 115,
      "authors": [
        "Farzana Rahman",
        "Md Zakirul Alam Bhuiyan",
        "Sheikh Iqbal Ahamed"
      ],
      "url": ""
    },
    {
      "title": "Enhancing privacy and security of RFID system with serverless authentication and search protocols in pervasive environments",
      "year": 2010,
      "abstract": "One of the recent realms that gathered attention of researchers is the security issues of Radio Frequency Identification (RFID) systems that have tradeoff between controlled costs and improved efficiency. Evolvement and benefits of RFID technology signifies that it can be low-cost, efficient and secured solution to many pervasive applications. But RFID technology will not intermingle into human lives until prevailing and flexible privacy mechanisms are conceived. However, ensuring strong privacy has been an enormous challenge due to extremely inadequate computational storage of typical RFID tags. So in order to relieve tags from responsibility, privacy protection and security assurance was guaranteed by central server. In this paper, we suggest serverless, forward secure and untraceable authentication protocol for RFID tags. This authentication protocol safeguards both tag and reader against almost all …",
      "venue": "Wireless personal communications",
      "citations": 76,
      "authors": [
        "Md Endadul Hoque",
        "Farzana Rahman",
        "Sheikh I Ahamed",
        "Jong Hyuk Park"
      ],
      "url": ""
    },
    {
      "title": "ERAP: ECC based RFID authentication protocol",
      "year": 2008,
      "abstract": "RFID tags are a new generation of small devices used for identification in many applications today. RFID authentication plays an important role in applications where security and privacy is a major concern. As an example, RFID has gained appreciation as an emerging technology to thwart counterfeiting problems. Public key cryptography (PKC) provides an impeccable solution to the counterfeiting problem. One recent family of public key cryptosystem is elliptic curve cryptography (ECC) which is a better choice than RSA cryptographic system because of its shorter key length. In this paper, we propose a secure, mutual offline authentication protocol which is based on ECC. Finally, we present security analysis of our proposed authentication protocol.",
      "venue": "2008 12th IEEE International Workshop on Future Trends of Distributed Computing Systems",
      "citations": 69,
      "authors": [
        "Sheikh Iqbal Ahamed",
        "Farzana Rahman",
        "Endadul Hoque"
      ],
      "url": ""
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "Handbook of Energy-Aware and Green Computing, Volume 1",
      "year": 2012,
      "abstract": "Implementing energy-efficient CPUs and peripherals as well as reducing resource consumption have become emerging trends in computing. A landmark for researchers in computer science and engineering, this handbook is one of the first to present a comprehensive account of recent research in energy-aware and green computing. The book incorporates fundamental knowledge from all related areas, including circuit and component design, software, operating systems, networking, mobile computing, and data centers. It also discusses up-to-date research on many aspects of power-aware computing at the component, software, and system levels.",
      "venue": "",
      "citations": 108,
      "authors": [
        "Ishfaq Ahmad",
        "Sanjay Ranka"
      ],
      "url": ""
    },
    {
      "title": "Design, analysis, and deployment of omnipresent formal trust model (FTM) with trust bootstrapping for pervasive environments",
      "year": 2010,
      "abstract": "The rapid decrease in the size of mobile devices, coupled with an increase in capability, has enabled a swift proliferation of small and very capable devices into our daily lives. With such a prevalence of pervasive computing, the interaction among portable devices needs to be continuous and invisible to device users. As these devices become better connected, collaboration among them will play a vital role in sharing resources in an ad-hoc manner. The sharing of resources works as a facilitator for pervasive devices. However, this ad hoc interaction among devices provides the potential for security breaches. Trust can fight against such security violations by restricting malicious nodes from participating in interactions. Therefore, we need a unified trust relationship model between entities, which captures both the needs of the traditional computing world and the world of pervasive computing where the continuum of …",
      "venue": "Journal of Systems and Software",
      "citations": 64,
      "authors": [
        "Sheikh I Ahamed",
        "Munirul M Haque",
        "Md Endadul Hoque",
        "Farzana Rahman",
        "Nilothpal Talukder"
      ],
      "url": ""
    },
    {
      "title": "Cloud-based low-cost energy monitoring system through internet of things",
      "year": 2019,
      "abstract": "With the ever-increasing capacity of the Internet and demand for human lives, Internet of Things (IoT) applications is increasing like never before, primarily to facilitate smart homes and smart cities. However, consumers have become increasingly cognizant of the negative effects of energy consumption as well as the importance of footprint reduction. Despite the increased interest in energy reduction and consumption, the average consumer still feels intimidated and unsure of how to start. In this paper, we propose an energy monitoring system (Watts On) to be used per room within a house that is efficient, intuitive, and economic (cost effective). The significant contribution of this paper is the design and development details of WattsOn prototype application. WattsOn is a low-cost IoT and cloud-based system that allows end-users to monitor, store and display energy usage data in an intuitive graphical user interface. As …",
      "venue": "2019 IEEE International Conference on Pervasive Computing and Communications Workshops (PerCom Workshops)",
      "citations": 15,
      "authors": [
        "Claire Fulk",
        "Grant Hobar",
        "Kevin Olsen",
        "Samy El-Tawab",
        "Farzana Rahman",
        "Puya Ghazizadeh"
      ],
      "url": ""
    }
  ],
  "source": "scholar"
}