{
  "name": "Fernando Zigunov",
  "affiliation": "Assistant Professor, Syracuse University",
  "interests": [
    "piv",
    "flow visualization and tomography",
    "machine learning flow control",
    "psp",
    "supersonic noise control",
    "experimental fluid dynamics",
    "machine learning in fluids",
    "aerodynamics"
  ],
  "citedby": 265,
  "h_index": 11,
  "i10_index": 13,
  "top_primary_author_publications": [
    {
      "title": "Reynolds number and slant angle effects on the flow over a slanted cylinder afterbody",
      "year": 2020,
      "abstract": "The cylinder with a slanted base is a simplified, canonical bluff body geometry that shares similarities to aircraft fuselages, which are known to produce a strong vortex pair due to their upswept afterbody. This work will examine in detail the surface flow and near-field characteristics of the flow over the slanted cylinder for slant angles of , where the formation of either a separated wake flow state or a vortex-dominated flow state is dependent upon initial conditions, i.e. the presence of overshoot of the free-stream velocity during wind tunnel start-up.",
      "venue": "Journal of Fluid Mechanics",
      "citations": 43,
      "authors": [
        "Fernando Zigunov",
        "Prabu Sellappan",
        "Farrukh Alvi"
      ],
      "url": ""
    },
    {
      "title": "A bluff body flow control experiment with distributed actuation and genetic algorithm-based optimization",
      "year": 2022,
      "abstract": "In this study, a novel technique to experimentally determine the most effective actuator locations in an active flow control (AFC) context is implemented and its efficacy demonstrated through detailed measurements of flow response to control. The platform developed provides an engineering solution to the problem of actuator placement with commonly available components, by using an optimizing algorithm to explore the parameter space with a wind tunnel in the loop. The optimizing algorithm, specifically a genetic algorithm, sequentially activates the microactuators in different patterns and evaluates a cost function related to each pattern through measurements in the flow field, which enables the exploration of thousands of actuator patterns, thereby rapidly converging to viable configurations. The platform is tested in a canonical bluff body flow, the cylinder with a slanted afterbody at a slant angle of , which is …",
      "venue": "Experiments in Fluids",
      "citations": 19,
      "authors": [
        "Fernando Zigunov",
        "Prabu Sellappan",
        "Farrukh Alvi"
      ],
      "url": ""
    },
    {
      "title": "Time-resolved particle image velocimetry and pressure sensitive paint measurements of afterbody flow dynamics",
      "year": 2022,
      "abstract": "In this study, the dynamical behavior of the vortex pair produced in the wake of a cylinder with a slanted afterbody, relevant to cargo aircraft applications, is examined experimentally through time-resolved particle image velocimetry (TR-PIV) and fast-response pressure sensitive paint (PSP). The vortex wandering phenomenon, characterstic of this wake, is measured with state of the art, time-resolved diagnostics at Reynolds numbers ranging from  to  and a slant angle of . Spectral proper orthogonal decomposition reveals a consistent and narrow normalized frequency band () with significant energetic peaks in both surface pressure and near-field vortex velocity fields across all Reynolds numbers examined. Pressure sensitive paint measurements at free stream velocities ranging from 15 m/s () to 75 m/s () reveal a strong unsteady signature of the flow …",
      "venue": "Physical Review Fluids",
      "citations": 16,
      "authors": [
        "Fernando Zigunov",
        "Prabu Sellappan",
        "Farrukh Alvi",
        "Yuta Ozawa",
        "Yuji Saito",
        "Taku Nonomura",
        "Keisuke Asai"
      ],
      "url": ""
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "Surface properties of double-fin generated shock-wave/boundary-layer interactions",
      "year": 2023,
      "abstract": "Shock-Wave/Boundary-Layer Interaction (SBLI) is ubiquitous in high-speed air vehicles. SBLI surface flowfield properties of crossing shocks induced by symmetric Double-Fins (DFs) at fin angles of 8° and 10° at Mach 2 are experimentally investigated; a 10° Single-Fin (SF) is also explored as a comparison. Surface visualization is used to capture distinct flowfield structures such as separation and upstream influence. Steady and unsteady Pressure-Sensitive Paints (PSPs) are used to obtain global surface pressure fields. Characteristics of DF-SBLI surface topology are discussed by comparing the corresponding SF-SBLI. The effect of fin angle on DF-SBLI is characterized, and unsteady dynamics of the pressure field are examined. Spectral Proper Orthogonal Decomposition (SPOD) is performed on unsteady PSP, and traveling surface pressure waves and their frequency-dependent behavior are discussed …",
      "venue": "AIAA Journal",
      "citations": 16,
      "authors": [
        "Serdar Seçkin",
        "Lee J Mears",
        "MyungJun Song",
        "Farrukh S Alvi",
        "Fernando Zigunov"
      ],
      "url": ""
    },
    {
      "title": "Slanted cylinder afterbody aerodynamics measured by 0.3-m magnetic suspension and balance system with six-degrees-of-freedom control",
      "year": 2022,
      "abstract": "In this study, a cylinder with a slanted afterbody was magnetically levitated without support structures by means of a magnetic suspension and balance system (MSBS) with six-degrees-of-freedom (6-DOF) control. The levitation stability during the 6-DOF levitation was first confirmed and accurate to less than 8.9 m and 18.6 mdeg at 15 m/s freestream. The results show that the model can be rigidly levitated with the 6-DOF control. Then, aerodynamic force on the levitated model was measured and its wake was visualized. Hystereses in aerodynamics and wake structure were observed around the critical Reynolds number between  and .",
      "venue": "Experiments in Fluids",
      "citations": 10,
      "authors": [
        "Kodai Tashiro",
        "Sho Yokota",
        "Fernando Zigunov",
        "Yuta Ozawa",
        "Keisuke Asai",
        "Taku Nonomura"
      ],
      "url": ""
    },
    {
      "title": "Three-dimensional flow characterization of double-fin SBLI",
      "year": 2023,
      "abstract": "View Video Presentation: https://doi.org/10.2514/6.2023-3575.vidShock-Wave/Boundary-Layer Interaction (SBLI) is inevitable on supersonic and hypersonic air vehicles leading to undesired internal and external aerodynamic challenges such as flow separation, unsteady pressure loading, vibration, and unstart. In the present study, fully volumetric (3-dimensions, 3-components) mean flowfield of a symmetric Double-Fin (DF) SBLI with 10-degree fin angles at Mach 2 is revealed. Scanning Stereoscopic Particle Image Velocimetry (S-SPIV) technique is implemented to acquire snapshots of the instantaneous velocity field perpendicular to the incoming freestream. In the mean time, a traverse mechanism rigidly holds the laser, cameras, and optical elements together, and continuously scans along the streamwise direction. The scanning region covers the entire volume between the fins, and the acquired snapshots are …",
      "venue": "",
      "citations": 6,
      "authors": [
        "Serdar Seckin",
        "MyungJun Song",
        "Fernando Zigunov",
        "Farrukh S Alvi"
      ],
      "url": ""
    }
  ],
  "source": "scholar"
}