{
  "name": "Ian Shapiro",
  "affiliation": "",
  "interests": [],
  "citedby": 16,
  "h_index": 1,
  "i10_index": 0,
  "top_primary_author_publications": [
    {
      "title": "La justice démocratique : deux dimensions",
      "year": 2004,
      "abstract": null,
      "venue": "",
      "citations": 1,
      "authors": [
        "Ian Shapiro"
      ],
      "url": "https://www.semanticscholar.org/paper/94c9feb096938385f9154f9e7467e621f2feef4d"
    },
    {
      "title": "La justice démocratique : deux dimensions (suite et fin)",
      "year": 2004,
      "abstract": "Dans cet article, Ian Shapiro esquisse une theorie de la justice dont le fondement est democratique. A partir du constat que la justice et la democratie s’orientent parfois dans des directions contraires, il montre pourquoi et comment elles peuvent, et doivent, se renforcer mutuellement. Dans la premiere partie, publiee dans le precedent numero, il defend l’ideal d’une justice democratique comme bien subordonne, destine a informer les termes des interactions humaines sans en determiner le cours. Il fait l’hypothese qu’il est necessaire de structurer les dimensions de la vie sociale relatives au pouvoir de maniere a maximiser la participation au processus de prise de decisions tout en minimisant les hierarchies qui n’ont pas de caractere de necessite. Dans la seconde partie, il explore les tensions internes a une justice democratique ainsi concue et les implications de cette derniere pour le role de l’Etat.",
      "venue": "",
      "citations": 0,
      "authors": [
        "Ian Shapiro"
      ],
      "url": "https://www.semanticscholar.org/paper/309e28b4996fc0305f8f6f93c7855d5be9a21144"
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "Choix rationnels et politique : pourquoi en savons-nous toujours aussi peu?",
      "year": 1995,
      "abstract": "Choix rationnels et politique. Pourquoi en savons-nous toujours aussi peu? Donald P. Green, Ian Shapiro. ; Cette critique de la contribution de la theorie des choix rationnels a la science politique, fondee sur une etude empirique, entend montrer que, a ce jour, les partisans de la methodologie des choix rationnels ont peu apporte a notre connaissance de la vie politique. L'echec de ces theories est du a un syndrome de deficiences methodologiques recurrentes qui decoulent du souci manifeste par les theoriciens de cette ecole de developper une theorie universelle de la vie politique. Des exemples tires de travaux sur le vote, l'action collective, la concurrence electorale et les legislatures publies par des theoriciens de l'ecole des choix rationnels illustrent ces deficiences et des reponses sont presentees aux arguments de ces theoriciens.",
      "venue": "Revue française de science politique",
      "citations": 15,
      "authors": [
        "Donald P. Green",
        "Ian Shapiro"
      ],
      "url": "https://www.semanticscholar.org/paper/8169f1e16ce2b6f20851d06725f6c7b7d4026c8d"
    },
    {
      "title": "Système de chauffage des locaux et de calorifères à eau chaude chauffé par gaz muni d'enveloppe du liquide intégré",
      "year": 1988,
      "abstract": null,
      "venue": "",
      "citations": 0,
      "authors": [
        "C. D. Ripka",
        "Jay L. Boot",
        "Ian Shapiro"
      ],
      "url": "https://www.semanticscholar.org/paper/4bfaede68041e75d2bfb1df695e1c023063bbded"
    }
  ],
  "source": "semanticscholar"
}