{
  "name": "James (Jay) Henderson",
  "affiliation": "Professor, Biomedical & Chemical Eng., Syracuse University/Director, BioInspired Institute",
  "interests": [
    "Smart Materials",
    "Mechanobiology",
    "and Tissue Engineering"
  ],
  "citedby": 2229,
  "h_index": 26,
  "i10_index": 34,
  "top_primary_author_publications": [
    {
      "title": "Mechanical induction in limb morphogenesis: the role of growth-generated strains and pressures",
      "year": 2002,
      "abstract": "Morphogenesis is regulated by intrinsic factors within cells and by inductive signals transmitted through direct contact, diffusible molecules, and gap junctions. In addition, connected tissues growing at different rates necessarily generate complicated distributions of physical deformations (strains) and pressures. In this Perspective we present the hypothesis that growth-generated strains and pressures in developing tissues regulate morphogenesis throughout development. We propose that these local mechanical cues influence morphogenesis by: (1) modulating growth rates; (2) modulating tissue differentiation; (3) influencing the direction of growth; and (4) deforming tissues. It is in this context that we review concepts and experiments of cell signaling and gene expression in various mechanical environments. Tissue and organ culture experiments are interpreted in light of the developmental events associated with …",
      "venue": "",
      "citations": 197,
      "authors": [
        "JH Henderson",
        "Dennis R Carter"
      ],
      "url": ""
    },
    {
      "title": "Shape memory poly (ε-caprolactone)-co-poly (ethylene glycol) foams with body temperature triggering and two-way actuation",
      "year": 2013,
      "abstract": "We describe the fabrication of porous foams with shape memory triggering at body temperature. Employing a modified porogen-leaching technique, functionalized poly(ε-caprolactone) (PCL) and poly(ethylene glycol) (PEG) macromers are crosslinked via thiol–ene chemistry to generate highly porous foam scaffolds with shape memory capacity. The temperature at which shape change of these scaffolds occurs under hydrated conditions can be tuned both through control of the chemical composition and through deformation temperature during mechanical programming of the scaffolds. Uniquely, the foams exhibit reversible actuation in compression, which has not previously been demonstrated for foams. Our results indicate that PCL–PEG shape memory foams have potential as programmable scaffolds for tissue engineering, regenerative medicine, and the study of cell mechanobiology.",
      "venue": "Journal of Materials Chemistry B",
      "citations": 92,
      "authors": [
        "Richard M Baker",
        "James H Henderson",
        "Patrick T Mather"
      ],
      "url": ""
    },
    {
      "title": "Sutural bone deposition rate and strain magnitude during cranial development",
      "year": 2004,
      "abstract": "It is widely believed that rapid growth of the human brain generates tensile strain in cranial sutures, and that this strain influences the rate of bone deposition at the sutural margins during development. We developed general theoretical techniques for estimating sutural bone deposition rate and strain magnitude during mammalian cranial development. A geometry-based analysis was developed to estimate sutural bone deposition rate. A quasi-static stress analysis was developed to estimate sutural strain magnitude. We applied these techniques to the special case of normal cranial development in humans. The results of the bone deposition rate analysis indicate that average human sutural bone deposition rate is on the order of 100 μm/day at 1 month of age and decreases in an approximately exponential fashion during the first 4 years of life. The results of the strain analysis indicate that sutural strain magnitude is …",
      "venue": "Bone",
      "citations": 86,
      "authors": [
        "James H Henderson",
        "Michael T Longaker",
        "Dennis R Carter"
      ],
      "url": ""
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "Dynamic cell behavior on shape memory polymer substrates",
      "year": 2011,
      "abstract": "Cell culture substrates of defined topography have emerged as powerful tools with which to investigate cell mechanobiology, but current technologies only allow passive control of substrate properties. Here we present a thermo-responsive cell culture system that uses shape memory polymer (SMP) substrates that are programmed to change surface topography during cell culture. Our hypothesis was that a shape-memory-activated change in substrate topography could be used to control cell behavior. To test this hypothesis, we embossed an initially flat SMP substrate to produce a temporary topography of parallel micron-scale grooves. After plating cells on the substrate, we triggered shape memory activation using a change in temperature tailored to be compatible with mammalian cell culture, thereby causing topographic transformation back to the original flat surface. We found that the programmed erasure of …",
      "venue": "Biomaterials",
      "citations": 246,
      "authors": [
        "Kevin A Davis",
        "Kelly A Burke",
        "Patrick T Mather",
        "James H Henderson"
      ],
      "url": ""
    },
    {
      "title": "Shape-memory-actuated change in scaffold fiber alignment directs stem cell morphology",
      "year": 2013,
      "abstract": "Tissue engineering scaffolds have traditionally been static physical structures poorly suited to mimicking the complex dynamic behavior of in vivo microenvironments. Here we present a thermoresponsive scaffold that can be programmed to change macroscopic shape and microscopic architecture during cell culture. The scaffold, which was prepared by electrospinning a shape memory polymer (SMP), was used to test the hypothesis that a shape-memory-actuated change in scaffold fiber alignment could be used to control the behavior of attached and viable cells. To test this hypothesis, we stretched an SMP scaffold of randomly oriented fibers and fixed the scaffold in a temporary but stable elongated shape in which fibers were aligned by the strain. Following seeding and culture of human adipose-derived stem cells on the strain-aligned scaffold, the scaffold was triggered to transition back to its initial shape and …",
      "venue": "Acta biomaterialia",
      "citations": 179,
      "authors": [
        "Ling-Fang Tseng",
        "Patrick T Mather",
        "James H Henderson"
      ],
      "url": ""
    },
    {
      "title": "Self-deploying shape memory polymer scaffolds for grafting and stabilizing complex bone defects: A mouse femoral segmental defect study",
      "year": 2016,
      "abstract": "Treatment of complex bone defects places a significant burden on the US health care system. Current strategies for treatment include grafting and stabilization using internal metal plates/screws, intramedullary rods, or external fixators. Here, we introduce the use of shape memory polymer (SMP) materials for grafting and adjunct stabilization of segmental defects. Self-deploying SMP grafts and SMP sleeves capable of expanding and contracting, respectively, under intraoperative conditions were developed and evaluated in a mouse segmental defect model in vivo. Integration between grafts/sleeves and native bone was assessed using x-ray radiography, microcomputed tomography, and torsional mechanical testing. We found that SMP grafts were able to integrate with the native bone after 12 weeks, maintain defect stability, and provide torsional mechanical properties comparable to an allograft alone treatment …",
      "venue": "Biomaterials",
      "citations": 123,
      "authors": [
        "Richard M Baker",
        "Ling-Fang Tseng",
        "Maria T Iannolo",
        "Megan E Oest",
        "James H Henderson"
      ],
      "url": ""
    }
  ],
  "source": "scholar"
}