{
  "name": "Jennifer Lynne Fazio",
  "affiliation": "",
  "interests": [],
  "citedby": 0,
  "h_index": 0,
  "i10_index": 0,
  "top_primary_author_publications": [
    {
      "title": "American Sidewinder - Dropouts in a Polarizing Society Ride the Rails, Skirt the Rim of Neoliberal Urban Peripheries",
      "year": 2013,
      "abstract": "Author(s): Fazio, Jennifer Lynne | Advisor(s): Hurst, John | Abstract: Education, Social a Cultural Studies The following work provides a look into what may prove the most pressing social crisis of our time, the American dropout crisis central to the production/reproduction the \"at risk\" youth crisis, though captures the fallout of a deeper complex social risk. The argument is made that the dropout crisis nears the social epicenter of a deeper process of rapidly social polarization into two Americas, separate, radically unequal, and increasingly distant from the other. As a social process, the dropout flow perpetuates the social reproduction of America's growing undercaste, those who exist at a level beneath and in conjunction with its underclass. As disposable people, these subsistants are increasingly available for intensifying forms of exploitation. The argument is made that, unlike the experience of low-income disadvantaged youth during the second half of the twentieth century, in the latest advanced stages of hyper-neoliberalism, social exclusion/push-out is experienced uniformly across all domains of societal operation (e.g., political, social, juridical, educational, cultural, and economic). As such `risk', whether focused on the individual or society risk, takes on new meaning and exists in epic proportions, while the individual is forced to navigate often sidewinding institutional and spatial margins for which they are unprepared and given little warning, while often seeking 'EVA' (the equivalent of Engagement, Voice, and Agency). Central to the proposed theoretical framework of America's `new risk' is the role of mobility and societal pipelines, channels, and flows. Where `pipelines' is an old concept heard from concerned parents condemning a failed educational system casting their children in the direction of \"prison pipelines,\" the concept is widened providing insight into the relation between youths' fate and these urban channels, negative or positive, upward or downward moving. These channels create the pulse of a city, decisive as to the strength of social mobility. Alternatively, they are instrumental in the social reproduction of subpopulations (i.e., undercaste) embodying any combination of the following: uneducated, untrained, unexposed, unorganized, powerless and/or \"dis'd\" (i.e., myriad forms of disengagement including politically disenfranchised). The ethnography of youth risk against the press of supra-institutional flows is an ethnography of place, but it is also an ethnography of social mobility channels. These channels were once instrumental in facilitating upward social mobility within the `communal ghetto'. Conversely, these pipelines currently perpetuate the greatest wealth/power polarization in the country's history with its rising levels of poverty, deep poverty, and social exclusion splitting the urban social terrain. It is increasingly common that the minority dropout concludes with a life of such extreme social exclusion and poverty. At the same time, assumptions of colorblind multicultural tolerance effectively hide the challenges of today's socially disadvantaged, particularly minority youth, 16-24 years of age.",
      "venue": "",
      "citations": 0,
      "authors": [
        "Jennifer Lynne Fazio"
      ],
      "url": "https://www.semanticscholar.org/paper/603566fa99f9d0300cbe44e5ab41e343cfd4cd9c"
    }
  ],
  "top_secondary_author_publications": []
}