{
  "name": "Jesse Q. Bond",
  "affiliation": "Professor of Biomedical and Chemical Engineering, Syracuse University",
  "interests": [
    "Catalysis",
    "Reaction Engineering",
    "Biomass Processing",
    "Alternative Fuels"
  ],
  "citedby": 6988,
  "h_index": 23,
  "i10_index": 35,
  "top_primary_author_publications": [
    {
      "title": "Catalytic conversion of biomass to biofuels",
      "year": 2010,
      "abstract": "Biomass has received considerable attention as a sustainable feedstock that can replace diminishing fossil fuels for the production of energy, especially for the transportation sector. The overall strategy in the production of hydrocarbon fuels from biomass is (i) to reduce the substantial oxygen content of the parent feedstock to improve energy density and (ii) to create C–C bonds between biomass-derived intermediates to increase the molecular weight of the final hydrocarbon product. We begin this review with a brief overview of first-generation biofuels, specifically bioethanol and biodiesel. We consider the implications of utilizing starchy and triglyceride feedstocks from traditional food crops, and we provide an overview of second-generation technologies to process the major constituents of more abundant lignocellulosic biomass, such as thermochemical routes (gasification, pyrolysis, liquefaction) which directly …",
      "venue": "",
      "citations": 2836,
      "authors": [
        "David Martin Alonso",
        "Jesse Q Bond",
        "James A Dumesic"
      ],
      "url": ""
    },
    {
      "title": "Integrated catalytic conversion of γ-valerolactone to liquid alkenes for transportation fuels",
      "year": 2010,
      "abstract": "Efficient synthesis of renewable fuels remains a challenging and important line of research. We report a strategy by which aqueous solutions of γ-valerolactone (GVL), produced from biomass-derived carbohydrates, can be converted to liquid alkenes in the molecular weight range appropriate for transportation fuels by an integrated catalytic system that does not require an external source of hydrogen. The GVL feed undergoes decarboxylation at elevated pressures (e.g., 36 bar) over a silica/alumina catalyst to produce a gas stream composed of equimolar amounts of butene and carbon dioxide. This stream is fed directly to an oligomerization reactor containing an acid catalyst (e.g., H ZSM-5, Amberlyst-70), which couples butene monomers to form condensable alkenes with molecular weights that can be targeted for gasoline and/or jet fuel applications. The effluent gaseous stream of CO2 at elevated pressure can …",
      "venue": "Science",
      "citations": 1263,
      "authors": [
        "Jesse Q Bond",
        "David Martin Alonso",
        "Dong Wang",
        "Ryan M West",
        "James A Dumesic"
      ],
      "url": ""
    },
    {
      "title": "Production of renewable jet fuel range alkanes and commodity chemicals from integrated catalytic processing of biomass",
      "year": 2014,
      "abstract": "This article presents results from experimental studies and techno-economic analysis of a catalytic process for the conversion of whole biomass into drop-in aviation fuels with maximal carbon yields. The combined research areas highlighted include biomass pretreatment, carbohydrate hydrolysis and dehydration, and catalytic upgrading of platform chemicals. The technology centers on first producing furfural and levulinic acid from five- and six-carbon sugars present in hardwoods and subsequently upgrading these two platforms into a mixture of branched, linear, and cyclic alkanes of molecular weight ranges appropriate for use in the aviation sector. Maximum selectivities observed in laboratory studies suggest that, with efficient interstage separations and product recovery, hemicellulose sugars can be incorporated into aviation fuels at roughly 80% carbon yield, while carbon yields to aviation fuels from cellulose …",
      "venue": "Energy & Environmental Science",
      "citations": 444,
      "authors": [
        "Jesse Q Bond",
        "Aniruddha A Upadhye",
        "Hakan Olcay",
        "Geoffrey A Tompsett",
        "Jungho Jae",
        "Rong Xing",
        "David Martin Alonso",
        "Dong Wang",
        "Taiying Zhang",
        "Rajeev Kumar",
        "Andrew Foster",
        "S Murat Sen",
        "Christos T Maravelias",
        "Robert Malina",
        "Steven RH Barrett",
        "Raul Lobo",
        "Charles E Wyman",
        "James A Dumesic",
        "George W Huber"
      ],
      "url": ""
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "Analysis of kinetics and reaction pathways in the aqueous-phase hydrogenation of levulinic acid to form γ-valerolactone over Ru/C",
      "year": 2014,
      "abstract": "Reaction pathways and kinetics governing the Ru-catalyzed hydrogenation of levulinic acid (LA) in the aqueous phase to form γ-valerolactone (GVL) were considered in a packed bed reactor. GVL can be produced by two distinct hydrogenation pathways; however, over Ru/C at temperatures below 423 K, it forms exclusively via intramolecular esterification of 4-hydroxypentanoic acid (HPA). Over Ru/C, reasonable hydrogenation rates of LA to HPA were observed at near-ambient temperatures (e.g., 0.08 s–1 at 323 K), but GVL selectivities are poor (<5%) under these conditions. Apparent barriers for LA hydrogenation and HPA esterification are 48 and 70 kJ mol–1, respectively, and GVL selectivity improves at higher temperatures alongside increasing mass transfer limitations in 45–90 μm catalyst particles. Reactivity and selectivity trends in LA hydrogenation below 343 K are well-described by an empirical kinetic …",
      "venue": "ACS catalysis",
      "citations": 340,
      "authors": [
        "Omar Ali Abdelrahman",
        "Andreas Heyden",
        "Jesse Q Bond"
      ],
      "url": ""
    },
    {
      "title": "Reactive extraction of levulinate esters and conversion to γ-valerolactone for production of liquid fuels",
      "year": 2011,
      "abstract": "Reactive extraction of cellulose-derived levulinic and formic acids with butene is utilized to obtain levulinate and formate esters, thereby allowing for recovery and recycle of H 2 SO 4. The esters are converted over a dual-catalyst-bed system to GVL and 2-butanol, followed by production of butene to be recycled for reactive extraction and to be converted to liquid fuels by oligomerization.",
      "venue": "ChemSusChem",
      "citations": 208,
      "authors": [
        "Elif I Gürbüz",
        "David Martin Alonso",
        "Jesse Q Bond",
        "James A Dumesic"
      ],
      "url": ""
    },
    {
      "title": "Production of biofuels from cellulose and corn stover using alkylphenol solvents",
      "year": 2011,
      "abstract": "Alkylphenol solvents allow a more effective production of biofuels from corn stover by enabling selective extraction and hydrogenation of levulinic acid to γ-valerolactone, and by increasing the final concentration of GVL through successive extraction/hydrogenation steps. The versatility of alkylphenol solvents may lead to their use in other biomass conversion processes utilizing mineral acids for biomass deconstruction.",
      "venue": "ChemSusChem",
      "citations": 174,
      "authors": [
        "David Martin Alonso",
        "Stephanie G Wettstein",
        "Jesse Q Bond",
        "Thatcher W Root",
        "James A Dumesic"
      ],
      "url": ""
    }
  ]
}