{
  "name": "Jialiu Zeng",
  "affiliation": "Assistant Professor, Department of Biomedical and Chemical Engineering, Syracuse University",
  "interests": [
    "Neurodegeneration",
    "Lysosomes",
    "Autophagy",
    "Metabolic Disorders",
    "Nanomedicine"
  ],
  "citedby": 14675,
  "h_index": 18,
  "i10_index": 21,
  "top_primary_author_publications": [
    {
      "title": "Modulating lysosomal pH: a molecular and nanoscale materials design perspective",
      "year": 2020,
      "abstract": "Lysosomes, membrane-bound organelles, play important roles in cellular processes including endocytosis, phagocytosis, and autophagy. Lysosomes maintain cellular homeostasis by generating a highly acidic environment of pH 4.5–5.0 and by housing hydrolytic enzymes that degrade engulfed biomolecules. Impairment of lysosomal function, especially in its acidification, is a driving force in the pathogenesis of diseases including neurodegeneration, cancer, metabolic disorders, and infectious diseases. Therefore, lysosomal pH is an attractive and targetable site for therapeutic intervention. Currently, there is a dearth of strategies or materials available to specifically modulate lysosomal acidification. This review focuses on the key aspects of how lysosomal pH is implicated in various diseases and discusses design strategies and molecular or nanoscale agents for lysosomal pH modulation, with the ultimate goal of …",
      "venue": "",
      "citations": 58,
      "authors": [
        "Jialiu Zeng",
        "Orian S Shirihai",
        "Mark W Grinstaff"
      ],
      "url": ""
    },
    {
      "title": "Biodegradable PLGA nanoparticles restore lysosomal acidity and protect neural PC-12 cells against mitochondrial toxicity",
      "year": 2019,
      "abstract": "Exposure of mitochondrial parkinsonian neurotoxin 1-methyl-4-phenylpyridinium ion (MPP+) to PC-12 cells results in significant cell death, decreases lysosomal acidity, and inhibits autophagic flux. Biodegradable poly(lactic-co-glycolic acid) (PLGA) nanoparticles (NPs) of ≈100 nm diameter localize to the lysosome, degrade, and subsequently release their acidic components to acidify the local lysosomal environment. The performance of PLGA NPs with different lysosomal pH modulating capabilities is investigated in PC-12 cells under MPP+ induced mitochondrial toxicity. PLGA NPs perform in a compositional dependent manner, where NPs with a higher glycolic acid to lactic acid ratio content degrade faster and yield greater degrees of lysosomal pH modulation as well as autophagic flux modulation in PC-12 cells under MPP+ insult. These results show that slight compositional changes of the polymeric NP give …",
      "venue": "Industrial & engineering chemistry research",
      "citations": 46,
      "authors": [
        "Jialiu Zeng",
        "Andrew Martin",
        "Xue Han",
        "Orian S Shirihai",
        "Mark W Grinstaff"
      ],
      "url": ""
    },
    {
      "title": "Defective lysosomal acidification: a new prognostic marker and therapeutic target for neurodegenerative diseases",
      "year": 2023,
      "abstract": "Lysosomal acidification dysfunction has been implicated as a key driving factor in the pathogenesis of neurodegenerative diseases, including Alzheimer’s disease and Parkinson’s disease. Multiple genetic factors have been linked to lysosomal de-acidification through impairing the vacuolar-type ATPase and ion channels on the organelle membrane. Similar lysosomal abnormalities are also present in sporadic forms of neurodegeneration, although the underlying pathogenic mechanisms are unclear and remain to be investigated. Importantly, recent studies have revealed early occurrence of lysosomal acidification impairment before the onset of neurodegeneration and late-stage pathology. However, there is a lack of methods for organelle pH monitoring in vivo and a dearth of lysosome-acidifying therapeutic agents. Here, we summarize and present evidence for the notion of defective lysosomal acidification as an …",
      "venue": "",
      "citations": 43,
      "authors": [
        "Chih Hung Lo",
        "Jialiu Zeng"
      ],
      "url": ""
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "Guidelines for the use and interpretation of assays for monitoring autophagy (4th edition)1",
      "year": 2021,
      "abstract": "In 2008, we published the first set of guidelines for standardizing research in autophagy. Since then, this topic has received increasing attention, and many scientists have entered the field. Our knowledge base and relevant new technologies have also been expanding. Thus, it is important to formulate on a regular basis updated guidelines for monitoring autophagy in different organisms. Despite numerous reviews, there continues to be confusion regarding acceptable methods to evaluate autophagy, especially in multicellular eukaryotes. Here, we present a set of guidelines for investigators to select and interpret methods to examine autophagy and related processes, and for reviewers to provide realistic and reasonable critiques of reports that are focused on these processes. These guidelines are not meant to be a dogmatic set of rules, because the appropriateness of any assay largely depends on the question …",
      "venue": "autophagy",
      "citations": 13820,
      "authors": [
        "Daniel J Klionsky",
        "Amal Kamal Abdel-Aziz",
        "Sara Abdelfatah",
        "Mahmoud Abdellatif",
        "Asghar Abdoli",
        "Steffen Abel",
        "Hagai Abeliovich",
        "Marie H Abildgaard",
        "Yakubu Princely Abudu",
        "Abraham Acevedo-Arozena",
        "Iannis E Adamopoulos",
        "Khosrow Adeli",
        "Timon E Adolph",
        "Annagrazia Adornetto",
        "Elma Aflaki",
        "Galila Agam",
        "Anupam Agarwal",
        "Bharat B Aggarwal",
        "Maria Agnello",
        "Patrizia Agostinis",
        "Javed N Agrewala",
        "Alexander Agrotis",
        "Patricia V Aguilar",
        "S Tariq Ahmad",
        "Zubair M Ahmed",
        "Ulises Ahumada-Castro",
        "Sonja Aits",
        "Shu Aizawa",
        "Yunus Akkoc",
        "Tonia Akoumianaki",
        "Hafize Aysin Akpinar",
        "Ahmed M Al-Abd",
        "Lina Al-Akra",
        "Abeer Al-Gharaibeh",
        "Moulay A Alaoui-Jamali",
        "Simon Alberti",
        "Elísabet Alcocer-Gómez",
        "Cristiano Alessandri",
        "Muhammad Ali",
        "M Abdul Alim Al-Bari",
        "Saeb Aliwaini",
        "Javad Alizadeh",
        "Eugènia Almacellas",
        "Alexandru Almasan",
        "Alicia Alonso",
        "Guillermo D Alonso",
        "Nihal Altan-Bonnet",
        "Dario C Altieri",
        "Élida MC Álvarez",
        "Sara Alves",
        "Cristine Alves da Costa",
        "Mazen M Alzaharna",
        "Marialaura Amadio",
        "Consuelo Amantini",
        "Cristina Amaral",
        "Susanna Ambrosio",
        "Amal O Amer",
        "Veena Ammanathan",
        "Zhenyi An",
        "Stig U Andersen",
        "Shaida A Andrabi",
        "Magaiver Andrade-Silva",
        "Allen M Andres",
        "Sabrina Angelini",
        "David Ann",
        "Uche C Anozie",
        "Mohammad Y Ansari",
        "Pedro Antas",
        "Adam Antebi",
        "Zuriñe Antón",
        "Tahira Anwar",
        "Lionel Apetoh",
        "Nadezda Apostolova",
        "Toshiyuki Araki",
        "Yasuhiro Araki",
        "Kohei Arasaki",
        "Wagner L Araújo",
        "Jun Araya",
        "Catherine Arden",
        "Maria-Angeles Arévalo",
        "Sandro Arguelles",
        "Esperanza Arias",
        "Jyothi Arikkath",
        "Hirokazu Arimoto",
        "Aileen R Ariosa",
        "Darius Armstrong-James",
        "Laetitia Arnauné-Pelloquin",
        "Angeles Aroca",
        "Daniela S Arroyo",
        "Ivica Arsov",
        "Rubén Artero",
        "Dalia Maria Lucia Asaro",
        "Michael Aschner",
        "Milad Ashrafizadeh",
        "Osnat Ashur-Fabian",
        "Atanas G Atanasov",
        "Alicia K Au",
        "Patrick Auberger",
        "Holger W Auner",
        "Laure Aurelian",
        "Riccardo Autelli",
        "Laura Avagliano",
        "Yenniffer Ávalos",
        "Sanja Aveic",
        "Célia Alexandra Aveleira",
        "Tamar Avin-Wittenberg",
        "Yucel Aydin",
        "Scott Ayton",
        "Srinivas Ayyadevara",
        "Maria Azzopardi",
        "Misuzu Baba",
        "Jonathan M Backer",
        "Steven K Backues",
        "Dong-Hun Bae",
        "Ok-Nam Bae",
        "Soo Han Bae",
        "Eric H Baehrecke",
        "Ahruem Baek",
        "Seung-Hoon Baek",
        "Sung Hee Baek",
        "Giacinto Bagetta",
        "Agnieszka Bagniewska-Zadworna",
        "Hua Bai",
        "Jie Bai",
        "Xiyuan Bai",
        "Yidong Bai",
        "Nandadulal Bairagi",
        "Shounak Baksi",
        "Teresa Balbi",
        "Cosima T Baldari",
        "Walter Balduini",
        "Andrea Ballabio",
        "Maria Ballester",
        "Salma Balazadeh",
        "Rena Balzan",
        "Rina Bandopadhyay",
        "Sreeparna Banerjee",
        "Sulagna Banerjee",
        "Ágnes Bánréti",
        "Yan Bao",
        "Mauricio S Baptista",
        "Alessandra Baracca",
        "Cristiana Barbati",
        "Ariadna Bargiela",
        "Daniela Barilà",
        "Peter G Barlow",
        "Sami J Barmada",
        "Esther Barreiro",
        "George E Barreto",
        "Jiri Bartek"
      ],
      "url": ""
    },
    {
      "title": "IRGM1 links mitochondrial quality control to autoimmunity",
      "year": 2021,
      "abstract": "Mitochondrial abnormalities have been noted in lupus, but the causes and consequences remain obscure. Autophagy-related genes ATG5, ATG7 and IRGM have been previously implicated in autoimmune disease. We reasoned that failure to clear defective mitochondria via mitophagy might be a foundational driver in autoimmunity by licensing mitochondrial DNA–dependent induction of type I interferon. Here, we show that mice lacking the GTPase IRGM1 (IRGM homolog) exhibited a type I interferonopathy with autoimmune features. Irgm1 deletion impaired the execution of mitophagy with cell-specific consequences. In fibroblasts, mitochondrial DNA soiling of the cytosol induced cyclic GMP-AMP synthase (cGAS)–stimulator of interferon genes (STING)-dependent type I interferon, whereas in macrophages, lysosomal Toll-like receptor 7 was activated. In vivo, Irgm1–/– tissues exhibited mosaic dependency upon …",
      "venue": "Nature immunology",
      "citations": 92,
      "authors": [
        "Prashant Rai",
        "Kyathanahalli S Janardhan",
        "Julie Meacham",
        "Jennifer H Madenspacher",
        "Wan-Chi Lin",
        "Peer WF Karmaus",
        "Jennifer Martinez",
        "Quan-Zhen Li",
        "Mei Yan",
        "Jialiu Zeng",
        "Mark W Grinstaff",
        "Orian S Shirihai",
        "Gregory A Taylor",
        "Michael B Fessler"
      ],
      "url": ""
    },
    {
      "title": "Lysosome acidification by photoactivated nanoparticles restores autophagy under lipotoxicity",
      "year": 2016,
      "abstract": "In pancreatic β-cells, liver hepatocytes, and cardiomyocytes, chronic exposure to high levels of fatty acids (lipotoxicity) inhibits autophagic flux and concomitantly decreases lysosomal acidity. Whether impaired lysosomal acidification is causally inhibiting autophagic flux and cellular functions could not, up to the present, be determined because of the lack of an approach to modify lysosomal acidity. To address this question, lysosome-localizing nanoparticles are described that, upon UV photoactivation, enable controlled acidification of impaired lysosomes. The photoactivatable, acidifying nanoparticles (paNPs) demonstrate lysosomal uptake in INS1 and mouse β-cells. Photoactivation of paNPs in fatty acid–treated INS1 cells enhances lysosomal acidity and function while decreasing p62 and LC3-II levels, indicating rescue of autophagic flux upon acute lysosomal acidification. Furthermore, paNPs improve glucose …",
      "venue": "Journal of Cell Biology",
      "citations": 85,
      "authors": [
        "Kyle M Trudeau",
        "Aaron H Colby",
        "Jialiu Zeng",
        "Guy Las",
        "Jiazuo H Feng",
        "Mark W Grinstaff",
        "Orian S Shirihai"
      ],
      "url": ""
    }
  ]
}