{
  "name": "Jianshun \"Jensen\" Zhang",
  "affiliation": "Professor of Mechanical and Aerospace Engineering, Syracuse University",
  "interests": [
    "combined heat, air, moisture and pollutant simulations (champs)",
    "multi-disciplinary and multi-scale building systems design and optimization",
    "building energy efficiency",
    "intelligent buildings",
    "effects of indoor environmental quality on occupant exposure, productivity, and creativity",
    "built environmental systems measurements, modeling, and controls",
    "building physics",
    "indoor environmental quality",
    "hygrothermal performance of building materials and enclosure systems",
    "heat and mass transfer",
    "material emissions, air purification, ventilation, and indoor air quality",
    "building energy and environmental systems"
  ],
  "citedby": 4569,
  "h_index": 36,
  "i10_index": 76,
  "top_primary_author_publications": [
    {
      "title": "Can commonly-used fan-driven air cleaning technologies improve indoor air quality? A literature review",
      "year": 2011,
      "abstract": "Air cleaning techniques have been applied worldwide with the goal of improving indoor air quality. The effectiveness of applying these techniques varies widely, and pollutant removal efficiency is usually determined in controlled laboratory environments which may not be realized in practice. Some air cleaners are largely ineffective, and some produce harmful by-products. To summarize what is known regarding the effectiveness of fan-driven air cleaning technologies, a state-of-the-art review of the scientific literature was undertaken by a multidisciplinary panel of experts from Europe, North America, and Asia with expertise in air cleaning, aerosol science, medicine, chemistry and ventilation. The effects on health were not examined. Over 26,000 articles were identified in major literature databases; 400 were selected as being relevant based on their titles and abstracts by the first two authors, who further reduced the …",
      "venue": "",
      "citations": 414,
      "authors": [
        "Yinping Zhang",
        "Jinhan Mo",
        "Yuguo Li",
        "Jan Sundell",
        "Pawel Wargocki",
        "Jensen Zhang",
        "John C Little",
        "Richard Corsi",
        "Qihong Deng",
        "Michael HK Leung",
        "Lei Fang",
        "Wenhao Chen",
        "Jinguang Li",
        "Yuexia Sun"
      ],
      "url": ""
    },
    {
      "title": "Performance of air cleaners for removing multiple volatile organic compounds in indoor air",
      "year": 2005,
      "abstract": "Fifteen air cleaners, representing different technologies and types of devices, were tested with a mixture of 16 representative VOCs (17 VOCs in tests for products associated with ozone generation) in a full-scale stainless steel chamber by using a “pull-down” test method. Their initial performance was evaluated in terms of single-pass efficiency (η) and the clean air delivery rate (CADR). Technologies evaluated include sorption filtration, ultraviolet-photocatalytic oxidation (UV-PCO), ozone oxidation, air ionization (plasma decomposition), and botanical air cleaning. Based on test results, the relative effectiveness of the available technologies tested and the effect of product configuration and VOC properties on the VOC removal efficiencies are analyzed. The implication of test results on the development of a standard test method for performance evaluation of gas-phase air cleaners is also discussed briefly in this paper.",
      "venue": "ASHRAE transactions",
      "citations": 226,
      "authors": [
        "Wenhao Chen",
        "Jianshun S Zhang",
        "Zhibin Zhang"
      ],
      "url": ""
    },
    {
      "title": "Characterization and performance evaluation of a full-scale activated carbon-based dynamic botanical air filtration system for improving indoor air quality",
      "year": 2011,
      "abstract": "A dynamic botanical air filtration system (DBAF) was developed for evaluating the short and long-term performance of botanical air cleaning technology under realistic indoor conditions. It was a fan-assisted with controlled airflow, activated-carbon/hydroculture based potted plant unit. The DBAF was first tested using a full-scale stainless chamber to evaluate its short-term performance. It was then integrated in the HVAC system of a new office space (96.8 m2) to study the effects of moisture content in the root bed on the removal efficiency, and the long-term performance. The results indicated that 5% outdoor air plus botanical filtration lead to the similar indoor formaldehyde/toluene concentration level as 25% outdoor air without filtration, which means that the filtration system was equivalent to 20% outdoor air (476 m3/h). The DBAF was effective for removing both formaldehyde and toluene under 5–32% volumetric …",
      "venue": "Building and Environment",
      "citations": 156,
      "authors": [
        "Zhiqiang Wang",
        "Jensen S Zhang"
      ],
      "url": ""
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "A review of the performance of different ventilation and airflow distribution systems in buildings",
      "year": 2014,
      "abstract": "The objective of this article is to review the scientific literature on airflow distribution systems and ventilation effectiveness to identify and assess the most suitable room air distribution methods for various spaces. In this study, different ventilation systems are classified according to specific requirements and assessment procedures. This study shows that eight ventilation methods have been employed in the built environment for different purposes and tasks. The investigation shows that numerous studies have been carried out on ventilation effectiveness but few studies have been done regarding other aspects of air distribution. Amongst existing types of ventilation systems, the performance of each ventilation methods varies from one case to another due to different usages of the ventilation system in a room and the different assessment indices used. This review shows that the assessment of ventilation effectiveness or …",
      "venue": "",
      "citations": 560,
      "authors": [
        "Guangyu Cao",
        "Hazim Awbi",
        "Runming Yao",
        "Yunqing Fan",
        "Kai Sirén",
        "Risto Kosonen",
        "Jianshun Jensen Zhang"
      ],
      "url": ""
    },
    {
      "title": "A systematic approach to estimating the effectiveness of multi-scale IAQ strategies for reducing the risk of airborne infection of SARS-CoV-2",
      "year": 2021,
      "abstract": "The unprecedented coronavirus disease 2019 (COVID-19) pandemic caused by the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) has made more than 125 million people infected and more than 2.7 million people dead globally. Airborne transmission has been recognized as one of the major transmission routes for SARS-CoV-2. This paper presents a systematic approach for evaluating the effectiveness of multi-scale IAQ control strategies in mitigating the infection risk in different scenarios. The IAQ control strategies across multiple scales from a whole building to rooms, and to cubical and personal microenvironments and breathing zone, are introduced, including elevated outdoor airflow rates, high-efficiency filters, advanced air distribution strategies, standalone air cleaning technologies, personal ventilation and face masks. The effectiveness of these strategies for reducing the risk of COVID-19 …",
      "venue": "Building and environment",
      "citations": 124,
      "authors": [
        "Jialei Shen",
        "Meng Kong",
        "Bing Dong",
        "Michael J Birnkrant",
        "Jianshun Zhang"
      ],
      "url": ""
    },
    {
      "title": "Experimental and numerical study on phase change material floor in solar water heating system with a new design",
      "year": 2014,
      "abstract": "Application of phase change material (PCM) floor in a solar water heating system can greatly enhance the floor’s energy storage capacity, and thus space for water tank is saved and heat loss at night is effectively avoided. This study put forward a new PCM floor including capillary plaits and macro-packaged PCM layer, and investigated the heat storage and releasing process with experimental and simulation method. Accelerated thermal cycle was used to test the characteristic of PCM, and a mathematical model was established for heat transfer analysis. Thermal characteristic of the PCM floor was tested under stable operation condition. The result reveals the new PCM floor is able to release 37677.6 kJ heat for 16 h in the pump-off period in a room of 11.02 m2 and that account for 47.7% of energy supplied by solar water. The comparison between PCM room and ordinary room shows latent heat storage by capric …",
      "venue": "Solar Energy",
      "citations": 121,
      "authors": [
        "Kailiang Huang",
        "Guohui Feng",
        "Jianshun Zhang"
      ],
      "url": ""
    }
  ],
  "source": "scholar"
}