{
  "name": "John T. Trimmer",
  "affiliation": "Syracuse University",
  "interests": [
    "Sanitation and Resource Recovery",
    "Water and Sanitation in Developing Contexts",
    "Sustainable Design"
  ],
  "citedby": 709,
  "h_index": 15,
  "i10_index": 19,
  "top_primary_author_publications": [
    {
      "title": "Recirculation of human-derived nutrients from cities to agriculture across six continents",
      "year": 2018,
      "abstract": "Recovering human-derived nutrients can advance circular economies by linking increasingly urban global populations with local cropland, offsetting unsustainable fertilizer use and improving access in low-income countries. For 56 of the world’s largest cities, we analyse co-location of urban nutrients with surrounding agricultural needs (that is, the degree to which recoverable nutrients spatially align with crop demands), defining paths forward to close urban nutrient cycles. Estimated nutrient transport distances, which may constrain what recovery strategies are locally feasible, span two orders of magnitude and are often shorter among European, African and Asian cities due to high local cropland density. We further examine how growing nutrient-intensive crops and recovering highly concentrated nutrient products could impact distance and energy requirements. Broadly, locations with high cropland density …",
      "venue": "Nature sustainability",
      "citations": 136,
      "authors": [
        "John T Trimmer",
        "Jeremy S Guest"
      ],
      "url": ""
    },
    {
      "title": "Amplifying progress toward multiple development goals through resource recovery from sanitation",
      "year": 2017,
      "abstract": "The United Nations’ Sustainable Development Goals (SDGs) recognize that current sanitation gaps must be closed to better serve those without access to safely managed systems (Target 6.2: universal sanitation coverage) and those connected to sewers without wastewater treatment (Target 6.3: halving the proportion of untreated wastewater). Beyond mitigating environmental and health concerns, implementing resource recovery sanitation systems could simultaneously improve the availability of agricultural nutrients (SDG 2) and household energy (SDG 7). This study estimates the potential for global, regional, and country-level resource recovery to impact nutrient and household electricity use through 2030. We distinguish impacts from newly installed sanitation systems (to achieve universal coverage), newly treated wastewater systems (to halve the proportion of untreated wastewater), and existing system …",
      "venue": "Environmental science & technology",
      "citations": 97,
      "authors": [
        "John T Trimmer",
        "Roland D Cusick",
        "Jeremy S Guest"
      ],
      "url": ""
    },
    {
      "title": "Resource recovery from sanitation to enhance ecosystem services",
      "year": 2019,
      "abstract": "Sanitation is often viewed as an unmentionable social obligation. Efficiently delivering this public good may involve use of ecosystem services, such as pollutant assimilation in wetlands, yet sanitation need not only consume: recovered resources (nutrients, organic matter and water) may enhance multiple ecosystem services, thereby expanding the value of sanitation. However, potential linkages between sanitation and ecosystem services have received limited attention. Bridging these fields will reveal opportunities to support sustainability goals, particularly in settings with extensive ecological assets but limited economic means. Here we develop a conceptual framework defining pathways through which recoverable resources can enhance ecosystem services and shed light on the viability of exploring synergistic interactions between engineered and natural systems. We find underexplored potential, particularly …",
      "venue": "",
      "citations": 65,
      "authors": [
        "John T Trimmer",
        "Daniel C Miller",
        "Jeremy S Guest"
      ],
      "url": ""
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "Child soil ingestion in rural Ghana–frequency, caregiver perceptions, relationship with household floor material and associations with child diarrhoea",
      "year": 2018,
      "abstract": "The objectives of this work were to evaluate (i) the prevalence and frequency of caregiver‐reported soil ingestion by children, (ii) whether household flooring material in the bedroom (earth vs. concrete) affected caregiver‐reported soil ingestion, (iii) whether caregiver‐reported soil ingestion was associated with caregiver‐reported diarrhoea and (iv) caregivers’ perceptions of their children ingesting soil.We conducted 309 household surveys in northern Ghana, including 529 children under five (249 children aged 6–36 months), and measured faecal contamination in soil from 31 households.Among all children, 15% were reported to have directly ingested soil in the past week, including 28% of children aged 6–36 months. Among children reported to have ingested soil, the median frequency was 14 times in the past week, and the median amount of soil ingested each time was half a …",
      "venue": "Tropical Medicine & International Health",
      "citations": 44,
      "authors": [
        "Valerie Bauza",
        "Diana M Byrne",
        "John T Trimmer",
        "Amanda Lardizabal",
        "Philip Atiim",
        "Mawuli AK Asigbee",
        "Jeremy S Guest"
      ],
      "url": ""
    },
    {
      "title": "Growth of an indigenous algal consortium on anaerobically digested municipal sludge centrate: photobioreactor performance and modeling",
      "year": 2015,
      "abstract": "Centrate from dewatering anaerobically digested municipal sludge is a particular concern in wastewater treatment, as it contains high ammonia concentrations and is often recycled to the head of the plant, reducing efficiency. Algae have the potential to remove ammonia from this wastewater, while producing biomass that can be used as an energy feedstock. In this research, an indigenous algal consortium was cultivated on municipal sludge centrate in a semi-continuous photobioreactor under natural light conditions. The goals of this research were to (1) enrich an algal consortium capable of growth on sludge centrate; (2) determine the main species of the consortium;(3) measure biomass, lipid production, and nutrient removal rates; and (4) develop a simple model to describe the system. The results suggested that Chlorella sp. was the dominant species (95 %) in the consortium. Mean biomass …",
      "venue": "BioEnergy Research",
      "citations": 37,
      "authors": [
        "Trina Halfhide",
        "Omatoyo K Dalrymple",
        "Ann C Wilkie",
        "John Trimmer",
        "Benjamin Gillie",
        "Innocent Udom",
        "Qiong Zhang",
        "Sarina J Ergas"
      ],
      "url": ""
    },
    {
      "title": "Resource recovery from water: principles and application",
      "year": 2022,
      "abstract": "Exercise 1.1. A wastewater treatment plant services a community of 50,000 people residing in a catchment of 30 km². Assume that 90% of the inhabitants is connected to the combined sewer network and that 10% of the people are living too remotely to be connected to the centralized sewer network and have household based septic tanks. In order to improve the sustainability of urban wastewater management of the community, resource recovery of nitrogen (in the form of ammonium) has been raised as a potential priority by the city council. In this context, recent developments aimed to recover nitrogen from urine (urine has a high N content, see table 1.1) have gained special interest in recent years. Let us assume that indeed ammonium recovery from urine at a household level can be achieved, and based on this assumption, calculate the following: a. Calculate the amount of nitrogen that can be recovered on a …",
      "venue": "",
      "citations": 25,
      "authors": [
        "Ilje Pikaar",
        "Jeremy Guest",
        "Ramon Ganigué",
        "Paul Jensen",
        "Korneel Rabaey",
        "Thomas Seviour",
        "John Trimmer",
        "Olaf van der Kolk",
        "Céline Vaneeckhaute",
        "Willy Verstraete"
      ],
      "url": ""
    }
  ],
  "source": "scholar"
}