{
  "name": "Karen Martinez Soto",
  "affiliation": "Assistant Teaching Professor, Syracuse University",
  "interests": [
    "conceptual understanding",
    "classroom assessment",
    "curriculum development"
  ],
  "citedby": 23,
  "h_index": 3,
  "i10_index": 1,
  "top_primary_author_publications": [
    {
      "title": "Propelling Education: Introducing and Examining the “English-to-Engineering” Multi-Year Undergraduate Research Program",
      "year": 2024,
      "abstract": "A student-led, industry-affiliated, extracurricular undergraduate program has been developed at Virginia Tech which is entering its third year. The program was developed with an umbrella theme of sustainability in aerospace propulsion under which the original students “auditioning” for the program proposed a range of research topics. The original program structure was focused on addressing some shortfalls observed both by academia and industry relative to traditional undergraduate engineering education over many years. Broadly speaking, these issues can be separated into topics related to encouraging earlier exposure to open ended problems and the ability to practice a wide range of teaming exercises earlier in the student’s career, both of which are of high value to industry. Discussion around these challenges has been ongoing, but often curriculum constraints have made incremental solutions hard …",
      "venue": "Turbo Expo: Power for Land, Sea, and Air",
      "citations": 0,
      "authors": [
        "Karen Martinez Soto",
        "Charles Haldeman",
        "Samuel Teolis",
        "David Gray",
        "Todd Lowe"
      ],
      "url": ""
    },
    {
      "title": "Assessment of Static Stability Through Concept Mapping",
      "year": 2024,
      "abstract": "Despite existing literature showing the benefits of teaching practices focused on conceptual understanding in engineering classrooms, the aerospace engineering space has been slow to adapt to these teaching practices. The purpose of this case study is to explore and analyze junior-year aerospace engineering students’ conceptual understanding of Static Stability and Control. Moreover, this research aims to identify elements of a Flight Mechanics course and how those elements can affect students’ conceptual understanding. Participants were 24 junior engineering students enrolled in the Air Vehicle Dynamics course. To measure conceptual understanding, participants were tasked with creating a concept map that described the topic of Static Stability and Control. Using cluster analysis, these concept maps were categorized into common mental models. Following Vosniadou’s Framework Theory, three levels of …",
      "venue": "2024 ASEE Annual Conference & Exposition",
      "citations": 0,
      "authors": [
        "Karen Dinora Martinez Soto"
      ],
      "url": ""
    },
    {
      "title": "A Case Study on Atmospheric Flight Mechanics Conceptual Understanding",
      "year": 2024,
      "abstract": "Atmospheric Flight Mechanics (AFM) is one of the cornerstones of aeronautical engineering and includes subjects like aerodynamic prediction, stability and control, dynamics, and vehicle design. These topics are critical to the success of aircraft development, so AFM is considered one of the most important foundational knowledge areas for aerospace engineering. Unfortunately, students graduating from aerospace engineering programs are often underprepared to perform in AFM jobs. This ongoing research focuses on developing a blueprint for assessing conceptual understanding of AFM concepts. Since existing literature suggests that novices and experts organize knowledge differently, comparing students' and experts' mental models can shine a light on the alternative conceptions that students retain post-instruction. As such, framing the study around synthetic mental models can be advantageous. To explore these mental models, three types of data have been collected and analyzed. Document analysis was done on course documents to identify what concept relationships were being presented to the students. Class observations were conducted to analyze how concepts are introduced to students and what relationships are highlighted by the instructor. Finally, a concept mapping activity was facilitated to study the mental models that the students built after instruction. The results show a lack of synthetization between the knowledge introduced in the classroom and students' prior knowledge which translated into student mental models that do not meet some of the expectations of the course. Moreover, this study highlights the importance of …",
      "venue": "",
      "citations": 0,
      "authors": [
        "Karen Dinora Martinez Soto"
      ],
      "url": ""
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "Cultural dimensions in academic disciplines, a comparison between Ecuador and the United States of America",
      "year": 2021,
      "abstract": "Broadening participation in engineering has been part of the engineering education research agenda for years. We argue that if we can understand the traits of the different dimensions of culture in engineering, we can identify potential solutions to broaden participation. In this study, we are comparing how engineering students from Ecuador and the United States characterize their culture orientation based on Hofstedes cultural dimensions theory. Data were collected with engineering students at major polytechnic universities in Ecuador and the United States. The survey was translated into Spanish for the Ecuadorian data and was reviewed by several native Spanish speakers. Results provide preliminary information on how students perceive aspects of culture like uncertainty avoidance, individualism, power distance, and masculinity. We discuss the relationship of these constructs with aspects of the engineering program. Implications for research and practice are provided.",
      "venue": "2021 ASEE Virtual Annual Conference Content Access",
      "citations": 16,
      "authors": [
        "Homero Murzi",
        "Bianey Cristina Ruiz Ulloa",
        "Francisco Gamboa",
        "Johnny C Woods",
        "MiguelAndres Guerra",
        "Karen Dinora Martinez Soto",
        "Reema Helen Azar"
      ],
      "url": ""
    },
    {
      "title": "WIP: Developing an arts-informed approach to understand students’ perceptions of engineering",
      "year": 2022,
      "abstract": "This work in progress paper describes preliminary results of a methodology used at three different universities to explore students’ perceptions of engineering through drawings. One of the primary objectives of introductory and foundational engineering courses is to help students develop a sense of identity and belonging within the field of engineering, and understand basic engineering knowledge and skills. Hence, it is crucial to understand students’ preconceptions of the engineering discipline when they start their academic program. However, many students entering the program have narrow preconceptions or limited knowledge about the field. One challenge instructors face is how to facilitate students’ thinking about their own perceptions of engineering in a meaningful way. A typical activity to help the students understand their perceptions of the engineering discipline is to ask them, \"What is engineering?\" …",
      "venue": "2022 IEEE Frontiers in Education Conference (FIE)",
      "citations": 4,
      "authors": [
        "Homero Murzi",
        "Diana Franco Duran",
        "Jason Forsyth",
        "Karen Martinez Soto",
        "Matthew James",
        "Lisa Schibelius"
      ],
      "url": ""
    },
    {
      "title": "Measuring the Impact of a Study Abroad Program on Engineering Students’ Global Perspective",
      "year": 2021,
      "abstract": "STUDENT Paper Keywords: Study Abroad, Global Perspective, Undergraduate Engineering As we move towards the new industrial revolution, the engineering workforce is becoming more global, diverse, and complex. With the increasing demand of engineers that have global competencies, students more than ever, are required to be creative and critical thinkers when solving complex problems. To prepare engineering students for successfully transitioning to the globally connected workforce, engineering educators need to explore different ways to help develop students’ understanding of global perspectives. One of the tools to develop these skills is through study abroad programs which are designed to help undergraduate students achieve learning outcomes pertinent to global engineering. This study describes students' global learning gains in one study-abroad program with the goal of increasing students’ understanding of the global perspective. Data were collected using the Global Perspectives Inventory (GPI) survey to measure global perspective of students participating in the program. GPI was collected across three different points: At the beginning of the semester when students take a global engineering practice class, at the end of the semester when the class finishes, and after the international travel.",
      "venue": "2021 ASEE Virtual Annual Conference Content Access",
      "citations": 3,
      "authors": [
        "Tahsin Mahmud Chowdhury",
        "Homero Murzi",
        "Karen Dinora Martinez Soto",
        "Andrea Schuman"
      ],
      "url": ""
    }
  ]
}