{
  "name": "K. Bradford",
  "affiliation": "",
  "interests": [],
  "citedby": 109,
  "h_index": 4,
  "i10_index": 0,
  "top_primary_author_publications": [
    {
      "title": "Adenosine Deaminase (ADA)-Deficient Severe Combined Immune Deficiency (SCID): Molecular Pathogenesis and Clinical Manifestations",
      "year": 2017,
      "abstract": null,
      "venue": "Journal of Clinical Immunology",
      "citations": 79,
      "authors": [
        "K. Bradford",
        "F. A. Moretti",
        "D. A. Carbonaro-Sarracino",
        "H. Gaspar",
        "D. Kohn"
      ],
      "url": "https://www.semanticscholar.org/paper/077606c01e9e9d4760dd777cae2bfa87d13ba6de"
    },
    {
      "title": "Primary Renal Ewing Sarcoma in Children and Young Adults",
      "year": 2020,
      "abstract": "Supplemental Digital Content is available in the text. The Ewing sarcoma family of tumors (ESFT) are high-grade small round blue cell malignancies traditionally presenting in children and adolescents. The most common site of primary disease is bone, though extraskeletal primary sites are well-recognized. We present 6 cases of primary ESFT of the kidney and 1 case of the adrenal gland. Patients were 11 to 18 years of age at diagnosis. Metastases at diagnosis were present in most cases (n=6). All patients underwent surgery, and most received radiation (n=5). Five patients relapsed after initial remission. Comprehensive review of the primary renal ESFT literature was used to analyze various factors, including age, sex, disease metrics, metastases at diagnoses, and overall survival in a total of 362 cases. Notably, while the general ESFT population has reported rates of metastasis at diagnosis of 20% to 25%, this rate in the renal ESFT population was 53% with a rate of 59% in adolescent and young-adult patients (11 to 24 y). Nodal disease at diagnosis was present in 24% of renal ESFT cases compared with 3.2% in patients with primary skeletal ESFT. While this malignant process may share histologic and molecular features with its bone and soft tissue counterparts, primary renal ESFT presentations seem to be more aggressive and have worse outcomes.",
      "venue": "Journal of pediatric hematology/oncology",
      "citations": 9,
      "authors": [
        "K. Bradford",
        "Alexander Nobori",
        "Brittany L. Johnson",
        "Wendy A Allen-Rhoades",
        "B. Naik-Mathuria",
        "E. Panosyan",
        "Moran Gotesman",
        "Joseph L. Lasky",
        "Jerry Cheng",
        "Alan Ikeda",
        "J. Goldstein",
        "Arun S. Singh",
        "N. Federman"
      ],
      "url": "https://www.semanticscholar.org/paper/4cea03e700e261822647598d23b2354b2b52a353"
    },
    {
      "title": "AT1R Activating Autoantibodies in Hematopoietic Stem Cell Transplantation.",
      "year": 2020,
      "abstract": null,
      "venue": "Biology of Blood and Marrow Transplantation",
      "citations": 5,
      "authors": [
        "K. Bradford",
        "Meghan H Pearl",
        "D. Kohn",
        "P. Weng",
        "O. Yadin",
        "LaVette Bowles",
        "Satiro N De Oliveira",
        "T. Moore"
      ],
      "url": "https://www.semanticscholar.org/paper/7e98eedba6382c763de7619d78d9f4c96e369bf7"
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "First Report of Non-Genotoxic Conditioning with JSP191 (anti-CD117) and Hematopoietic Stem Cell Transplantation in a Newly Diagnosed Patient with Severe Combined Immune Deficiency",
      "year": 2020,
      "abstract": "Successful hematopoietic stem cell transplantation (HSCT) requires vacating recipient hematopoietic stem cell (HSC) niches in the bone marrow to permit donor HSC engraftment that can provide life-long hematopoietic and immune function. Currently, HSCT in SCID relies on DNA damaging chemotherapy to eliminate recipient HSC and achieve niche clearance. We have pursued a non-toxic approach to target and deplete HSC using a humanized monoclonal antibody, JSP191, that binds human CD117 (c-Kit). We previously showed the safety and successful HSC engraftment in a Phase 1 trial of the first 6 patients with severe combined immunodeficiency (SCID), who underwent a second transplant because of HSC engraftment failure and poor immunity after their first transplantation. In these re-transplant patients even a low level of stringently measured myeloid chimerism resulted in significant and sustained generation of naive T cells and clinical improvement. Based on these results, the study of JSP191 (NCT#02963064)has opened a cohort of newly diagnosed infants with SCID. Here we report data from the first patient in this cohort, a SCIDX1 patient who received a primary HSCT with haploidentical CD34+ cells after conditioning with JSP 191. The patient had a c.270-15A>G variant in the IL2RG gene, which is predicted to cause a null phenotype. Besides a T- B+ NK- phenotype typical of SCIDX1 including dysfunctional B cells, the patient had anemia and intermittent neutropenia and thrombocytopenia. Despite evidence of maternal T cell engraftment, the patient had no clinical graft-versus-host disease (GVHD). The patient was initially enrolled in a trial of lentiviral gene therapy, but harvested bone marrow cells died in vitro during transduction and culture. The patient also mobilized poorly with G-CSF/Plerixafor. Further investigation revealed heterozygosity for loss-of-function mutations in two genes involved in DNA repair, BRCA1 and RAD51; Diepoxybutane (DEB) breakage study showed greater than normal pathologic chromosomal breaks, but less than that seen in Fanconi anemia. Because of concern for possible hypersensitivity to alkylating agent-based conditioning, the patient was referred for transplant with JSP191 conditioning. The patient received a CD34+ peripheral blood HSCT from his father after conditioning with 0.3 mg/kg of JSP 191 antibody intravenously over an hour on Day -8 and rATG (Thymoglobulin) on Day -5, -4, -3 and -2 (3.5 mg/kg total) to prevent rejection by the maternal T cells. The cryopreserved donor CD34+ cells were administered after sufficient clearance of the JSP191 serum level. The antibody infusion was well tolerated without toxicity, and the post-transplant course was uneventful without acute toxicities or GVHD. As a surrogate marker for HSC engraftment, CD15+ myeloid cells from peripheral blood were stringently sorted by flow cytometry and donor levels were quantified by short-tandem repeat (STR) analysis. Progressive levels of myeloid engraftment were observed beginning at Week 4. The level of donor chimerism at 12 weeks was 8% in the sorted CD15+ blood cells, and a marrow aspirate showed 25% donor CD34+ cells. By 3 months pre-existing abnormal CD19-CD20+ host B lymphocytes were significantly reduced, and CD19+ donor-derived B lymphocytes were emerging. At 2 months, CD4+ recent thymic emigrant and naïve T lymphocytes were observed, and by 3 months, overall T and NK lymphocyte numbers were 390/uL and 117/uL, respectively. Normal blastogenic responses to the T cell mitogen PHA were observed at 3 months. These first-in-class results provide proof of concept of the safety and efficacy of the use of JSP191 antibody to clear host marrow niche space to enable sufficient donor HSC engraftment and immune reconstitution as primary therapy of SCID. Non-genotoxic conditioning with JSP191 may replace conventional conditioning for newly diagnosed infants with SCID, thereby avoiding toxicities of chemotherapy.\n \n \n Kohn: Allogene Therapeutics: Consultancy, Membership on an entity's Board of Directors or advisory committees; Orchard Therapeutics: Consultancy, Patents & Royalties, Research Funding. De Oliveira:Orchard Therapeutics: Research Funding; bluebird bio, Inc.: Research Funding. Czechowicz:Rocket Pharmaceuticals, Inc.: Research Funding. Brown:Merck: Membership on an entity's Board of Directors or advisory committees; Ansun: Membership on an entity's Board of Directors or advisory committees; Cidara: Membership on an entity's Board of Directors or advisory committees; Allogene: Membership on an entity's Board of Directors or advisory committees; Cellerant Therapeutics: Membership on an entity's Board of Directors or advisory committees. Shizuru:Jasper Therapeutics, Inc: Current equity holder in private company, Membership on an entity's Board of Directors or advisory committees.\n",
      "venue": "",
      "citations": 7,
      "authors": [
        "R. Agarwal",
        "K. Weinberg",
        "Hye-Sook Kwon",
        "Ann Le",
        "J. Long-Boyle",
        "D. Kohn",
        "K. Bradford",
        "S. Oliveira",
        "A. Bertaina",
        "A. Czechowicz",
        "M. Porteus",
        "D. Shyr",
        "K. Weinacht",
        "Ami J. Shah",
        "M. Mavers",
        "Elisa Merkel",
        "J. Brown",
        "C. Dvorak",
        "R. Parkman",
        "M. Roncarolo",
        "J. Shizuru"
      ],
      "url": "https://www.semanticscholar.org/paper/45ce032988310f2bb8dfc7ef0489278435758a2b"
    },
    {
      "title": "Burkitt-like lymphoma in a pediatric patient with familial adenomatous polyposis.",
      "year": 2019,
      "abstract": null,
      "venue": "Cancer Genetics",
      "citations": 3,
      "authors": [
        "Katie M. Strobel",
        "Jacquelyn N. Crane",
        "K. Bradford",
        "Yalda B. Naeini",
        "W. May",
        "Vivian Y. Chang"
      ],
      "url": "https://www.semanticscholar.org/paper/e44651c4cc0284ccdd1a2529df253b94315d01cc"
    },
    {
      "title": "Chemotherapy Can Synergize With Adoptive Immunotherapy to Inhibit Medulloblastoma Growth",
      "year": 2022,
      "abstract": "Background/Aim: In the age of ever-increasing developments in targeted cancer treatments, new immune-based approaches for brain tumor therapy represent an attractive avenue. Despite encouraging pre-clinical data, results in patients have been sub-optimal, likely due to tumor-induced immune suppression and intrinsic resistance to immune attack. Chemotherapy and biologic agents may be able to disrupt these mechanisms and restore tumor sensitivity to immune attack. In this study, we explore whether a combination of gemcitabine and rapamycin can sensitize medulloblastoma cells to immunotherapy in vitro and in vivo. Materials and Methods: With the commercial medulloblastoma cell line, Daoy, we explored the concentrations of combinations of Gemcitabine with rapamycin needed to induce cytotoxicity. Next, we used flow cytometry to assess the cytotoxicity of chemotherapy-treated Daoy cells with the addition of anti-tumor T-cells, generated from naive T-cells stimulated in the presence of Daoy lysate-pulsed dendritic cells. Then, we examined the efficacy of chemotherapy alone versus chemotherapy plus immunotherapy in tumor growth inhibition of subcutaneous medulloblastoma xenografts. Results: Rapamycin alone at <1,000 nM had moderate activity against Daoy cells in vitro and IC50 was >1,000 nM. Gemcitabine had a 3-day IC50 alone of 10 nM but in combination with 100 nM rapamycin, it decreased to 1 nM, suggesting increased cytotoxicity with combined therapy. Stimulated T-cells mediated in-vitro cytotoxicity, although background cytotoxicity of unstimulated “naïve” T-cells was also significant. Finally, established subcutaneous Daoy cell xenografts in SCID mice were treated with chemotherapy alone or chemotherapy plus adoptive immunotherapy (stimulated and non-stimulated). Gemcitabine and rapamycin alone significantly slowed tumor growth, but the addition of immunotherapy further augmented inhibition. Conclusion: Combining immunotherapy and chemo-biologic therapy inhibit medulloblastoma cell and xenograft growth, and may offer an effective treatment for patients with medulloblastoma.",
      "venue": "Anticancer Research",
      "citations": 2,
      "authors": [
        "Joseph L. Lasky",
        "K. Bradford",
        "Yuntao Wang",
        "Y. Pak",
        "E. Panosyan"
      ],
      "url": "https://www.semanticscholar.org/paper/04a7f383b7e27875bfdc7c2d422118764d8081d8"
    }
  ]
}