{
  "name": "M. Cenk Gursoy",
  "affiliation": "Electrical Engineering and Computer Science, Syracuse University",
  "interests": [
    "wireless communications",
    "machine learning",
    "information theory",
    "signal processing",
    "wireless networks"
  ],
  "citedby": 6271,
  "h_index": 39,
  "i10_index": 137,
  "top_primary_author_publications": [
    {
      "title": "A deep reinforcement learning-based framework for content caching",
      "year": 2018,
      "abstract": "Content caching at the edge nodes is a promising technique to reduce the data traffic in next-generation wireless networks. Inspired by the success of Deep Reinforcement Learning (DRL) in solving complicated control problems, this work presents a DRL-based framework with Wolpertinger architecture for content caching at the base station. The proposed framework is aimed at maximizing the long-term cache hit rate, and it requires no knowledge of the content popularity distribution. To evaluate the proposed framework, we compare the performance with other caching algorithms, including Least Recently Used (LRU), Least Frequently Used (LFU), and First-In First-Out (FIFO) caching strategies. Meanwhile, since the Wolpertinger architecture can effectively limit the action space size, we also compare the performance with Deep Q-Network to identify the impact of dropping a portion of the actions. Our results show …",
      "venue": "2018 52nd Annual Conference on Information Sciences and Systems (CISS)",
      "citations": 250,
      "authors": [
        "Chen Zhong",
        "M Cenk Gursoy",
        "Senem Velipasalar"
      ],
      "url": ""
    },
    {
      "title": "Deep reinforcement learning-based edge caching in wireless networks",
      "year": 2020,
      "abstract": "With the purpose to offload data traffic in wireless networks, content caching techniques have recently been studied intensively. Using these techniques and caching a portion of the popular files at the local content servers, the users can be served with less delay. Most of the content replacement policies are based on the content popularity, that depends on the users' preferences. In practice, such information varies over time. Therefore, an approach to determine the file popularity patterns must be incorporated into caching policies. In this context, we study content caching at the wireless network edge using a deep reinforcement learning framework with Wolpertinger architecture. In particular, we propose deep actor-critic reinforcement learning based policies for both centralized and decentralized content caching. For centralized edge caching, we aim at maximizing the cache hit rate. In decentralized edge caching …",
      "venue": "IEEE Transactions on Cognitive Communications and Networking",
      "citations": 160,
      "authors": [
        "Chen Zhong",
        "M Cenk Gursoy",
        "Senem Velipasalar"
      ],
      "url": ""
    },
    {
      "title": "The noncoherent Rician fading channel-part I: structure of the capacity-achieving input",
      "year": 2005,
      "abstract": "Transmission of information over a discrete-time memoryless Rician fading channel is considered, where neither the receiver nor the transmitter knows the fading coefficients. First, the structure of the capacity-achieving input signals is investigated when the input is constrained to have limited peakedness by imposing either a fourth moment or a peak constraint. When the input is subject to second and fourth moment limitations, it is shown that the capacity-achieving input amplitude distribution is discrete with a finite number of mass points in the low-power regime. A similar discrete structure for the optimal amplitude is proven over the entire signal-to-noise ratio (SNR) range when there is only a peak-power constraint. The Rician fading with the phase-noise channel model, where there is phase uncertainty in the specular component, is analyzed. For this model, it is shown that, with only an average power constraint …",
      "venue": "IEEE Transactions on Wireless Communications",
      "citations": 139,
      "authors": [
        "Mustafa Cenk Gursoy",
        "H Vincent Poor",
        "Sergio Verdú"
      ],
      "url": ""
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "A deep reinforcement learning based framework for power-efficient resource allocation in cloud RANs",
      "year": 2017,
      "abstract": "Cloud Radio Access Networks (RANs) have become a key enabling technique for the next generation (5G) wireless communications, which can meet requirements of massively growing wireless data traffic. However, resource allocation in cloud RANs still needs to be further improved in order to reach the objective of minimizing power consumption and meeting demands of wireless users over a long operational period. Inspired by the success of Deep Reinforcement Learning (DRL) on solving complicated control problems, we present a novel DRL-based framework for power-efficient resource allocation in cloud RANs. Specifically, we define the state space, action space and reward function for the DRL agent, apply a Deep Neural Network (DNN) to approximate the action-value function, and formally formulate the resource allocation problem (in each decision epoch) as a convex optimization problem. We evaluate …",
      "venue": "2017 IEEE International Conference on Communications (ICC)",
      "citations": 323,
      "authors": [
        "Zhiyuan Xu",
        "Yanzhi Wang",
        "Jian Tang",
        "Jing Wang",
        "Mustafa Cenk Gursoy"
      ],
      "url": ""
    },
    {
      "title": "Deep reinforcement learning based resource allocation in low latency edge computing networks",
      "year": 2018,
      "abstract": "In this paper, we investigate strategies for the allocation of computational resources using deep reinforcement learning in mobile edge computing networks that operate with finite blocklength codes to support low latency communications. The end-to-end (E2E) reliability of the service is addressed, while both the delay violation probability and the decoding error probability are taken into account. By employing a deep reinforcement learning method, namely deep Q-learning, we design an intelligent agent at the edge computing node to develop a real-time adaptive policy for computational resource allocation for offloaded tasks of multiple users in order to improve the average E2E reliability. Via simulations, we show that under different task arrival rates, the realized policy serves to increase the task number that decreases the delay violation rate while guaranteeing an acceptable level of decoding error probability …",
      "venue": "2018 15th international symposium on wireless communication systems (ISWCS)",
      "citations": 173,
      "authors": [
        "Tianyu Yang",
        "Yulin Hu",
        "M Cenk Gursoy",
        "Anke Schmeink",
        "Rudolf Mathar"
      ],
      "url": ""
    },
    {
      "title": "SWIPT-enabled relaying in IoT networks operating with finite blocklength codes",
      "year": 2018,
      "abstract": "This paper considers simultaneous wireless information and power transfer (SWIPT) mechanisms in a relaying-assisted ultra-reliable low latency communication network operating with finite blocklength codes. The reliability of the network is maximized by the optimal selection of SWIPT parameters under both a power splitting (PS) protocol and a time switching (TS) protocol. In addition, we propose a protocol to improve the reliability performance by introducing a tradeoff between the PS and TS protocols. To further improve the reliability, a joint design is provided, which aligns the optimal selection of SWIPT parameters together with a blocklength allocation between two relaying hops. Via simulations, we validate our analytical model and show that the proposed algorithm achieves the same performance as that obtained with exhaustive search. In addition, we evaluate the considered network, and characterize the …",
      "venue": "IEEE Journal on Selected Areas in Communications",
      "citations": 128,
      "authors": [
        "Yulin Hu",
        "Yao Zhu",
        "M Cenk Gursoy",
        "Anke Schmeink"
      ],
      "url": ""
    }
  ],
  "source": "scholar"
}