{
  "name": "Michelle Blum",
  "affiliation": "Syracuse University",
  "interests": [
    "materials",
    "mechanics",
    "tribology",
    "engineering education"
  ],
  "citedby": 281,
  "h_index": 8,
  "i10_index": 8,
  "top_primary_author_publications": [
    {
      "title": "Low friction hydrogel for articular cartilage repair: evaluation of mechanical and tribological properties in comparison with natural cartilage tissue",
      "year": 2013,
      "abstract": "The mechanical and tribological properties of a novel biomaterial, a boundary lubricant functionalized hydrogel, were investigated and compared to natural cartilage tissue. This low friction hydrogel material was developed for use as a synthetic replacement for focal defects in articular cartilage. The hydrogel was made by functionalizing the biocompatible polymer polyvinyl alcohol with a carboxylic acid derivative boundary lubricant molecule. Two different gel processing techniques were used to create the hydrogels. The first method consisted of initially functionalizing the boundary lubricant to the polyvinyl alcohol and then creating hydrogels by physically crosslinking the reacted polymer. The second method consisted of creating non-functionalized polyvinyl alcohol hydrogels and then performing the functionalization reaction on the fully formed gel. Osteochondral bovine samples were collected and replicate …",
      "venue": "Materials Science and Engineering: C",
      "citations": 64,
      "authors": [
        "Michelle M Blum",
        "Timothy C Ovaert"
      ],
      "url": ""
    },
    {
      "title": "Experimental and numerical tribological studies of a boundary lubricant functionalized poro-viscoelastic PVA hydrogel in normal contact and sliding",
      "year": 2012,
      "abstract": "Hydrogels are a cross-linked network of polymers swollen with liquid and have the potential to be used as a synthetic replacement for local defects in load bearing tissues such as articular cartilage. Hydrogels display viscoelastic time dependent behavior, therefore experimental analysis of stresses at the surface and within the gel is difficult to perform. A three-dimensional model of a hydrogel was developed in the commercial finite element software ABAQUS™, implementing a poro-viscoelastic constitutive model along with a contact-dependent flow state and friction conditions. Water content measurements, sliding, and indentation experiments were performed on neat polyvinyl alcohol (PVA), and on low friction boundary lubricant functionalized (BLF-PVA) hydrogels, both manufactured by freeze–thaw processes. Modulus results from the indentation experiments and coefficient of friction values from the sliding …",
      "venue": "Journal of the mechanical behavior of biomedical materials",
      "citations": 43,
      "authors": [
        "Michelle M Blum",
        "Timothy C Ovaert"
      ],
      "url": ""
    },
    {
      "title": "Investigation of friction and surface degradation of innovative boundary lubricant functionalized hydrogel material for use as artificial articular cartilage",
      "year": 2013,
      "abstract": "Hydrogels have been proposed as a synthetic bearing material to replace locally damaged articular cartilage in order to delay a joint replacement. A crucial limitation is that hydrogel tribological properties do not compare to natural cartilage. In this study, the well-known hydrogel polymer, polyvinyl alcohol, was functionalized with organic fatty acid derivative boundary lubricants to create boundary lubricant functionalized hydrogels prepared by freeze–thaw methods. The tribological behavior of the boundary lubricant functionalized hydrogels was investigated and compared against polyvinyl alcohol hydrogels by friction and polymer loss measurements from a pin-on-flat reciprocating sliding apparatus. The wear behavior of the hydrogels was compared while articulated against steel pins in deionized water and bovine cartilage pins in phosphate buffer saline solution. Also the effect of increasing the hydrocarbon …",
      "venue": "Wear",
      "citations": 33,
      "authors": [
        "Michelle M Blum",
        "Timothy C Ovaert"
      ],
      "url": ""
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "Synthesis and characterization of a zwitterionic hydrogel blend with low coefficient of friction",
      "year": 2016,
      "abstract": "Hydrogels display a great deal of potential for a wide variety of biomedical applications. Often times the performance of these biomimetic materials is limited due to inferior friction and wear properties. This manuscript presents a method inspired by the tribological phenomena observed in nature for enhancing the lubricious properties of poly(vinyl alcohol) (PVA) hydrogels. This was achieved by blending PVA with various amounts of zwitterionic polymer, poly([2-(methacryloyloxy) ethyl] dimethyl-(3-sulfopropyl) ammonium hydroxide) (pMEDSAH). Our results indicate that pMEDSAH acts as an effective boundary lubricant, allowing for reduction in coefficient of friction by more than 80%. This reduction in friction coefficient was achieved while maintaining comparable mechanical and physical properties to that of the neat material. Also, these zwitterionic blends were found to be cytocompatible. Analysis of the structure to …",
      "venue": "Acta Biomaterialia",
      "citations": 48,
      "authors": [
        "Allen O Osaheni",
        "Eric B Finkelstein",
        "Patrick T Mather",
        "Michelle M Blum"
      ],
      "url": ""
    },
    {
      "title": "Synthesis and characterization of zwitterionic polymer brush functionalized hydrogels with ionic responsive coefficient of friction",
      "year": 2020,
      "abstract": "Freeze–thaw poly(vinyl alcohol) hydrogels (PVA-H) offer great potential for several biomedical applications due to their biomimetic mechanical properties and biocompatibility. Despite these advantages, the use of PVA-H for load bearing applications has been limited due to poor performance in boundary lubrication compared to natural tissue such as articular cartilage. Recently, zwitterionic polymer brushes have been shown to act as effective boundary lubricants on rigid substrates; however, to the best of our knowledge, the synergistic effects of zwitterionic brushes coupled with the biomimetic fluid load support exhibited by hydrogels have not been reported. We report here on our investigation involving the synthesis and characterization of two unique types of polymer brush functionalized PVA hydrogels. The zwitterionic polymers that were compared contained either [2-(methacryloyloxy)ethyl]dimethyl-3 …",
      "venue": "Langmuir",
      "citations": 25,
      "authors": [
        "Allen O Osaheni",
        "Ariel Ash-Shakoor",
        "Ivan Gitsov",
        "Patrick T Mather",
        "Michelle M Blum"
      ],
      "url": ""
    },
    {
      "title": "The use of a hydrogel implant in the repair of osteochondral defects of the knee: A biomechanical evaluation of restoration of native contact pressures in cadaver knees",
      "year": 2019,
      "abstract": "Osteochondral injuries have been treated by a variety of methods, each having its own drawbacks. The purpose of this study was to determine the biomechanical feasibility of using a hydrogel implant replacement for an osteochondral core defect. The hypothesis of this study was that the contact pressure of the native knee can be recreated with the use of a hydrogel implant.Six cadaver knees were tested in a knee simulator while contact pressures were measured on the tibial plateau. Pressure data was collected in the intact knee, after coring of the condyle and after insertion of a hydrogel implant. Following 1000 gait cycles of fatigue testing, each knee was taken through axial loading indentation testing where the stiffness of the in situ implant was compared to the contralateral condyle.While coring significantly reduced the peak pressure at the coring site from 1.8 MPa in the intact …",
      "venue": "Clinical Biomechanics",
      "citations": 12,
      "authors": [
        "Ronald A Sismondo",
        "Frederick W Werner",
        "Nathaniel R Ordway",
        "Allen O Osaheni",
        "Michelle M Blum",
        "Matthew G Scuderi"
      ],
      "url": ""
    }
  ]
}