{
  "name": "Min Liu",
  "affiliation": "Syracuse University",
  "interests": [
    "Construction Engineering and Management"
  ],
  "citedby": 2916,
  "h_index": 28,
  "i10_index": 56,
  "top_primary_author_publications": [
    {
      "title": "Construction fatalities in Singapore",
      "year": 2009,
      "abstract": "This study investigates proximal causes to 40 fatalities between 2006 and 2008 in Singapore’s construction industry. We statistically analyzed the data and found 11 characteristics of deceased workers, types of work, and the environment. Construction fatality causes in the US between 2003 and 2006 were also analyzed and compared with the data in Singapore. We developed 41 strategies to minimize fatalities. We interviewed seven Singapore and US construction safety managers for their opinions on the effectiveness of the strategies. We conclude that in addition to those recommended strategies, changes in organizational safety culture, enhancement of the penalty system, and effective communication are critical to improve safety performance in Singapore’s construction industry.",
      "venue": "",
      "citations": 200,
      "authors": [
        "Florence Yean Yng Ling",
        "Min Liu",
        "Yue Chiau Woo"
      ],
      "url": ""
    },
    {
      "title": "Work flow variation and labor productivity: Case study",
      "year": 2011,
      "abstract": "Different types of flow variation and how they affect construction project performance have been studied by previous researchers. One aspect that has not been well researched is how work flow variation and labor productivity are related in construction practice. To study that issue, 134 weeks of project production data were collected and analyzed to explore this relationship. Labor productivity was found to be positively correlated with Percent Plan Complete (PPC), a measure of work flow variation. The relationship between productivity and the ratio of total task completion to planned tasks, weekly workload, weekly work output, and weekly work hours was also studied, and no significant correlation was found. The results suggest that productivity is not improved by completing as many tasks as possible regardless of the plan, nor from increasing workload, work output, or the number of work hours expended. In …",
      "venue": "Journal of management in engineering",
      "citations": 184,
      "authors": [
        "Min Liu",
        "Glenn Ballard",
        "William Ibbs"
      ],
      "url": ""
    },
    {
      "title": "A comparative study on adopting human resource practices for safety management on construction projects in the United States and Singapore",
      "year": 2011,
      "abstract": "Good project management outcomes include completing projects to an acceptable level of quality, within budget and on time. As construction accidents may cause project delays, safety management plays an important role in a project's timely completion. This study aims to undertake a comparative study of HR practices adopted for safety management on construction projects in the United States (US) and Singapore and to investigate the relationship between HR practices and construction safety management outcomes (severity and frequency of accidents). The research method included exploratory interviews and industry surveys of contractors in the US and Singapore by email and post. Data were collected using structured questionnaires. Compared to Singapore contractors, the results show that US contractors' project management practices place significantly more emphasis on highlighting organizational …",
      "venue": "International journal of project management",
      "citations": 163,
      "authors": [
        "Diana NC Lai",
        "Min Liu",
        "Florence YY Ling"
      ],
      "url": ""
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "What impacts the performance of large-scale government projects?",
      "year": 2016,
      "abstract": "Government projects and programs contribute to national growth at a great magnitude. However, records show that they are not well managed, even when project teams follow established project management principles. As a result, this study aimed at identifying key characteristics of government projects and programs, and recommending how they can be used to improve performance. This paper analyzed 39 public projects undertaken in the U.S., UK, and Australia and reviewed officially by the national audit offices and government agencies, including the Los Angeles Metro, London Heathrow's Terminal 5, and the fatal Australia's Homeowner Insulation Program. Based on this analysis the paper suggests six key characteristics, 17 practical recommendations, and six research propositions. These findings can support government project managers to utilize project management approaches according to project …",
      "venue": "International journal of project management",
      "citations": 211,
      "authors": [
        "Peerasit Patanakul",
        "Young Hoon Kwak",
        "Ofer Zwikael",
        "Min Liu"
      ],
      "url": ""
    },
    {
      "title": "Causes of variation in construction project task starting times and duration",
      "year": 2011,
      "abstract": "In this research, variation is defined as the time difference between what was planned and what actually happened in terms of task starting times and duration. Variation in construction tasks is important as it can impact productivity performance. Construction projects consist of a large number of interdependent tasks. When the starting time and/or duration of one task varies, it can affect other downstream tasks and result in disruptions to the schedule and/or decreased productivity. The construction process is complex and involves numerous people with different levels of responsibility, which makes identifying the root causes of the variation difficult. A nationwide survey was administered to workers, foremen, and project managers to identify the most prevalent causes and magnitude of both starting time and task duration variation. Fifty individual causes of variation were divided into eight categories: prerequisite work …",
      "venue": "Journal of construction engineering and management",
      "citations": 163,
      "authors": [
        "Brad W Wambeke",
        "Simon M Hsiang",
        "Min Liu"
      ],
      "url": ""
    },
    {
      "title": "Road Map for Lean Implementation at the Project Level",
      "year": 2007,
      "abstract": "CII Research Team 234 was launched to understand secrets of success in applying lean at the project level and to translate this understanding into an implementation road map. This involves understanding the peculiarity of projects as a type of production system, the adaptation of lean principles and methods appropriate to this type of production system, and the differences in roles and relationships among project participants and how those differences impact implementation. Our scope was restricted to the project, and only deals with extra-project activities that are relevant to project management; for example, anticipating how the facility to be delivered by the project will be operated, maintained, altered, and ultimately decommissioned. This introduction explains how the research team understood and carried out its mission and how the remainder of the report is structured.",
      "venue": "The Construction Industry Institute",
      "citations": 123,
      "authors": [
        "Glenn Ballard",
        "Yong Woo Kim",
        "Jin-Woo Jang",
        "Min Liu"
      ],
      "url": ""
    }
  ]
}