{
  "name": "M. Ahmed",
  "affiliation": "",
  "interests": [],
  "citedby": 6,
  "h_index": 1,
  "i10_index": 0,
  "top_primary_author_publications": [
    {
      "title": "Letter to the Editor: Enterohaemorrhagic Escherichia coli O157: A survey of dairy cattle in Tripoli, Libya",
      "year": 2014,
      "abstract": null,
      "venue": "",
      "citations": 6,
      "authors": [
        "M. Ahmed"
      ],
      "url": "https://www.semanticscholar.org/paper/57b1e7c5b1219d4b320bde322b9ce140dce15f38"
    },
    {
      "title": "Assessment of Homocysteine level in H.pylori infected Sudanese Patients",
      "year": 2017,
      "abstract": "The body turns back homocysteine into methionine with the help of vitamin B12. H.pylori induced -gastritis impairs folate and vitamin B12 absorption leading to B12 deficiency. Consequently homocysteine level will increase because this reaction cannot take place. The study aimed to assess the homocysteine level in H.pylori infected patients and H.pylori non-infected controls, to correlate the level of homocysteine with the duration of infection. A case control study was conducted in Khartoum state, Sudan. Thirty patients with H.pylori infection were recruited; 7 cases were treated. Age and sex matched 30 apparently healthy subjects with no H.pylori infection were enrolled as controls. The presence of H.pylori infection was diagnosed clinically and confirmed by stool antigen test. Plasma homocysteine level was measured using Biosystem reagents (homocysteine enzymatic cycling) and fully automated Biosystem device (A15). Homocysteine was increased in 21 (70%) out of 30 H.pylori infected cases. There was a significant difference in homocysteine level (P-value: 0.018) between cases and controls; with a mean of 17.6, 14.5 μmol/L ; respectively. Moreover, there was a significant association between H.pylori infection and Homocysteinemia ( P-value was < 0.0002). However there was no significant difference in homocysteine level (P-value: 0.23) between treated and un-treated cases; with a mean of 17.1, 19.3 μmol/L ; respectively. In a linear regression analysis; there was a moderate positive correlation between plasma homocysteine level and durations of H.pylori infection ( 6-12 ,˃12 months); with correlation co-efficient; R : 0.5; ( p =0.004 , p=0.0001;) respectively. The plasma homocysteine level increases in H.pylori infection. There is a positive correlation between Homocysteine level and the duration of H.pylori infection.",
      "venue": "",
      "citations": 0,
      "authors": [
        "M. Ahmed",
        "A. Abass",
        "A. A. K. Humeida"
      ],
      "url": "https://www.semanticscholar.org/paper/e07ec06caa8bc943126f25e25dae1ff4385791f0"
    }
  ],
  "top_secondary_author_publications": []
}