{
  "name": "Nadeem Ghani",
  "affiliation": "",
  "interests": [],
  "citedby": 11,
  "h_index": 1,
  "i10_index": 0,
  "top_primary_author_publications": [
    {
      "title": "The Effect of Glare on Regan Contrast Letter Acuity Scores Using Dye-Based and Reflective Laser Eye Protection",
      "year": 2001,
      "abstract": "Abstract : Current laser eye protection devices (LEPDs) are dye-based or reflective. While both technologies block the laser wavelengths, reflective LEPDs generally transmit more visible light than do dye-based LEPDs. Consequently reflective LEPDs are generally superior to dye-based LEPDs for the sparse light conditions of night. Reflective LEPDs are also better at maintaining a constant color appearance which is important for tasks requiring recognition of color coded information such as reading color maps or color cockpit displays. The advantages of reflective LEPDS, higher light transmission and better color recognition, need to be considered in association with other optical qualities of reflective LEPDs. One significant measure of optical quality is haze, which tends to be higher in reflective LEPDs. Wearing an LEPD with high haze can accentuate the impact of glare. Glare reduces visual acuity, particularly at low contrast levels. Differences in contrast acuity between dye-based and reflective LEPDs were investigated in the current experiment. Under indoor lighting (photopic) contrast acuity was separately measured with and without glare. In the absence of glare, contrast acuity remained high with all LEPDs. Only small decrements in the ability to identify very low contrast stimuli were found. In the presence of glare, the ability to identify low contrast stimuli was substantially reduced while wearing the reflective LEPDs with higher haze. While reflective LEPDs have been optimized for nighttime use, these data suggest that glare problems from the sun might be experienced while wearing reflective LEPD if protection is required during the day.",
      "venue": "",
      "citations": 0,
      "authors": [
        "Nadeem Ghani",
        "J. Dykes",
        "P. Garcia",
        "E. Schmeisser",
        "D. Maler"
      ],
      "url": "https://www.semanticscholar.org/paper/69ea11c136ea89bacbeb7b0230b063732d5288a5"
    },
    {
      "title": "Pi-mechanisms reinterpreted as combinations of cone types and channels /",
      "year": 1995,
      "abstract": null,
      "venue": "",
      "citations": 0,
      "authors": [
        "Nadeem Ghani"
      ],
      "url": "https://www.semanticscholar.org/paper/05728aaa0f9b9ef7ea51d9ed9d4997494c4297da"
    },
    {
      "title": "PI-mechanisms reinterpreted as combination of cone types.",
      "year": 1995,
      "abstract": null,
      "venue": "",
      "citations": 0,
      "authors": [
        "Nadeem Ghani"
      ],
      "url": "https://www.semanticscholar.org/paper/75b7b45ef4f3988efbb74c165468a8f8dc6a729b"
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "Chromatic Content of Spectral Lights",
      "year": 1996,
      "abstract": null,
      "venue": "Vision Research",
      "citations": 10,
      "authors": [
        "C. R. Ingling",
        "J. Barley",
        "Nadeem Ghani"
      ],
      "url": "https://www.semanticscholar.org/paper/63179cfdd855742746d98598e8ecd99fbccbc749"
    },
    {
      "title": "Effects of Background Field-of-View and Depth-Plane on the Oculogyral Illusion",
      "year": 2001,
      "abstract": "This study examined the effects of background field-of-view and depth-plane on the oculogyral illusion. Seven subjects viewed a stationary fixation stimulus during the postrotatory interval following a 45-sec. constant-velocity chair rotation. The duration of the illusory movement of the fixation stimulus during the postrotatory interval was measured, along with the duration of the illusion of whole-body rotation (known as the somatogyral illusion) and the duration of the subject's slow-phase vestibular nystagmus. Subjects viewed the fixation stimulus by itself in a No-background condition or when surrounded by six background fields formed by the combination of two fields-of-view (35° and 115°) and three depth-planes (near, coplanar, and far). The different background fields inhibited the oculogyral illusion relative to the No-background condition but did not differ statistically from each other. The somatogyral durations better matched the oculogyral ones than did nystagmus decay, especially when a background field was present. These results suggest that the oculogyral illusion is more related to the experience of whole-body rotation than to oculomotor mechanisms and that the inhibitory effect of a background scene is only modestly affected by its field-of-view and depth-plane.",
      "venue": "Perceptual and Motor Skills",
      "citations": 1,
      "authors": [
        "F. Previc",
        "K. W. Stevens",
        "Nadeem Ghani",
        "D. Ludwig"
      ],
      "url": "https://www.semanticscholar.org/paper/e7baffad26d2d794fd2837ca1bbca22da84020b7"
    },
    {
      "title": "The Cradle Society (A)",
      "year": 2017,
      "abstract": "Provides an account of how The Cradle, a nonprofit adoption agency, went from the brink of dissolution to become a thriving organization carrying out its mission. Under the leadership of Julie Tye, the organization and its board underwent an extensive strategic planning process and made significant changes to the organization's strategy, structure, and culture. Describes the condition of The Cradle before Tye's arrival.",
      "venue": "",
      "citations": 0,
      "authors": [
        "A. Donnelly",
        "Brenda Ellington-Booth",
        "Nadeem Ghani"
      ],
      "url": "https://www.semanticscholar.org/paper/3d9a542db96489ac0554284daed0cfd007acff2e"
    }
  ]
}