{
  "name": "Pankaj K. Jha",
  "affiliation": "Assistant Professor, EECS Syracuse University",
  "interests": [
    "quantum sensing and metrology",
    "quantum nano- and meta-photonics",
    "machine learning",
    "quantum optics",
    "quantum technology",
    "optical devices",
    "nanomaterials",
    "bio-inspired materials",
    "bio-nano ​interfaces",
    "quantum information science"
  ],
  "citedby": 1402,
  "h_index": 21,
  "i10_index": 34,
  "top_primary_author_publications": [
    {
      "title": "Metasurface-Enabled Remote Quantum Interference",
      "year": 2015,
      "abstract": "An anisotropic quantum vacuum (AQV) opens novel pathways for controlling light-matter interaction in quantum optics, condensed matter physics, etc. Here, we theoretically demonstrate a strong AQV over macroscopic distances enabled by a judiciously designed array of subwavelength-scale nanoantennas—a metasurface. We harness the phase-control ability and the polarization-dependent response of the metasurface to achieve strong anisotropy in the decay rate of a quantum emitter located over distances of hundreds of wavelengths. Such an AQV induces quantum interference among radiative decay channels in an atom with orthogonal transitions. Quantum vacuum engineering with metasurfaces holds promise for exploring new paradigms of long-range light-matter interaction for atom optics, solid-state quantum optics, quantum information processing, etc.",
      "venue": "Physical Review Letters",
      "citations": 157,
      "authors": [
        "Pankaj K. Jha",
        "Xingjie Ni",
        "Chihhui Wu",
        "Yuan Wang",
        "Xiang Zhang"
      ],
      "url": ""
    },
    {
      "title": "Quantum-coherence-enhanced surface plasmon amplification by stimulated emission of radiation",
      "year": 2013,
      "abstract": "We investigate surface plasmon amplification in a silver nanoparticle coupled to an externally driven three-level gain medium and show that quantum coherence significantly enhances the generation of surface plasmons. Surface plasmon amplification by stimulated emission of radiation is achieved in the absence <?format ?>of population inversion on the spasing transition, which reduces the pump requirements. The coherent drive allows us to control the dynamics and holds promise for quantum control of nanoplasmonic devices.",
      "venue": "Physical Review Letters",
      "citations": 124,
      "authors": [
        "Konstantin E Dorfman",
        "Pankaj K Jha",
        "Dmitri V Voronine",
        "Patrice Genevet",
        "Federico Capasso",
        "Marlan O Scully"
      ],
      "url": ""
    },
    {
      "title": "Nonreciprocal Localization of Photons",
      "year": 2018,
      "abstract": "We demonstrate that it is possible to localize photons nonreciprocally in a moving photonic lattice made by spatiotemporally modulating the atomic response, where the dispersion acquires a spectral Doppler shift with respect to the probe direction. A static defect placed in such a moving lattice produces a spatial localization of light in the band gap with a shifting frequency that depends on the direction of incident field with respect to the moving lattice. This phenomenon has an impact not only in photonics but also in broader areas such as condensed matter and acoustics, opening the doors for designing new devices such as compact isolators, circulators, nonreciprocal traps, sensors, unidirectional tunable filters, and possibly even a unidirectional laser.",
      "venue": "Physical Review Letters",
      "citations": 77,
      "authors": [
        "H Ramezani",
        "P. K Jha",
        "Yuan Wang",
        "Xiang Zhang"
      ],
      "url": ""
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "Time-Resolved Surface-Enhanced Coherent Sensing of Nanoscale Molecular Complexes",
      "year": 2012,
      "abstract": "Nanoscale real-time molecular sensing requires large signal enhancement, small background, short detection time and high spectral resolution. We demonstrate a new vibrational spectroscopic technique which satisfies all of these conditions. This time-resolved surface-enhanced coherent anti-Stokes Raman scattering (tr-SECARS) spectroscopy is used to detect hydrogen-bonded molecular complexes of pyridine with water in the near field of gold nanoparticles with large signal enhancement and a fraction of a second collection time. Optimal spectral width and time delays of ultrashort laser pulses suppress the surface-enhanced non-resonant background. Time-resolved signals increase the spectral resolution which is limited by the width of the probe pulse and allow measuring nanoscale vibrational dephasing dynamics. This technique combined with quantum chemistry simulations may be used for the …",
      "venue": "Scientific Report",
      "citations": 75,
      "authors": [
        "DV Voronine",
        "AM Sinyukov",
        "X Hua",
        "K Wang",
        "PK Jha",
        "E Munusamy",
        "SE Wheeler",
        "GR Welch",
        "AV Sokolov",
        "MO Scully"
      ],
      "url": ""
    },
    {
      "title": "Using Quantum Coherence to Generate Gain in the XUV and X-Ray: Gain-Swept Superradiance and Lasing Without Inversion",
      "year": 2012,
      "abstract": "It was shown some time ago that when the excitation of an ensemble of two-level atoms is swept in the direction of lasing, so that atoms are prepared in the excited state just as the radiation from previously excited atoms reaches them, the resulting laser amplifier is “highly anomalous” and yields superradiant emission without population inversion. We here show that transient gain in a three-level system has common features with Dicke superradiance and can yield strong extreme ultraviolet lasing in, for example, He atoms (at 58 nm) or He-like ions such as  B 3+  (at 6.1 nm).",
      "venue": "IEEE Journal of Selected Topics in Quantum Electronics",
      "citations": 61,
      "authors": [
        "Eyob A Sete",
        "Anatoly A Svidzinsky",
        "Yuri V Rostovtsev",
        "Hichem Eleuch",
        "Pankaj K Jha",
        "Szymon Suckewer",
        "Marlan O Scully"
      ],
      "url": ""
    },
    {
      "title": "Mid-Infrared Radiative Emission from Bright Hot Plasmons in Graphene",
      "year": 2021,
      "abstract": "Carrier excitation and decay processes in graphene are of broad interest since relaxation pathways that are not present in conventional materials are enabled by a gapless Dirac electronic band structure. Here, we report that a previously unobserved decay pathway—hot plasmon emission—results in Fermi-level-dependent mid-infrared emission in graphene. Our observations of non-thermal contributions to Fermi-level-dependent radiation are an experimental demonstration of hot plasmon emission arising from a photo-inverted carrier distribution in graphene achieved via ultrafast optical excitation. Our calculations indicate that the reported plasmon emission process can be several orders of magnitude brighter than Planckian emission mechanisms in the mid-infrared spectral range. Both the use of gold nanodisks to promote scattering and localized plasmon excitation and polarization-dependent excitation …",
      "venue": "Nature Materials",
      "citations": 49,
      "authors": [
        "L Kim",
        "S Kim",
        "PK Jha",
        "VW Brar",
        "HA Atwater"
      ],
      "url": ""
    }
  ],
  "source": "scholar"
}