{
  "name": "R. Aboutaha",
  "affiliation": "",
  "interests": [
    "forensic engineering and structural failures"
  ],
  "citedby": 951,
  "h_index": 13,
  "i10_index": 0,
  "top_primary_author_publications": [
    {
      "title": "Rehabilitation of shear critical concrete columns by use of rectangular steel jackets",
      "year": 1999,
      "abstract": null,
      "venue": "",
      "citations": 135,
      "authors": [
        "R. Aboutaha",
        "M. Engelhardt",
        "J. Jirsa",
        "M. Kreger"
      ],
      "url": "https://www.semanticscholar.org/paper/dec2c6cd96e851175de4fd3b343b789a1209a33a"
    },
    {
      "title": "Retrofit of Concrete Columns with Inadequate Lap Splices by the Use of Rectangular Steel Jackets",
      "year": 1996,
      "abstract": "This paper describes an experimental research program on the use of rectangular steel jackets for seismic retrofit of non-ductile reinforced concrete frame columns. Eleven large scale columns were tested to examine the effectiveness of various types of steel jackets for improving the ductility and strength of columns with an inadequate lap splice in the longitudinal reinforcement. Response of the columns before and after being strengthened with steel jackets was examined. Several types of steel jackets were investigated, including rectangular solid steel jackets with and without adhesive anchor bolts. The test results indicate that a thin rectangular steel jacket combined with adhesive anchor bolts can be a highly effective retrofit measure for reinforced concrete columns with an inadequate lap splice. Design guidelines for the use of rectangular steel jackets as a seismic retrofit for non-ductile reinforced concrete columns are presented.",
      "venue": "",
      "citations": 90,
      "authors": [
        "R. Aboutaha",
        "M. Engelhardt",
        "J. Jirsa",
        "M. Kreger"
      ],
      "url": "https://www.semanticscholar.org/paper/33c13ec82eba51f8a08f291dab0adfb03092e602"
    },
    {
      "title": "Seismic Resistance of Steel-Tubed High-Strength Reinforced-Concrete Columns",
      "year": 1999,
      "abstract": "In this paper, experimental investigation of cyclic response of steel-tubed high-strength reinforced-concrete (STHSRC) columns is presented. An STHSRC column is an ordinary reinforced-concrete column where most of the transverse reinforcement is in the form of a thin steel tube. The steel tube confines the whole concrete section and provides high shear resistance. Steel-tubed columns are more ductile and have higher lateral resistance than ordinary reinforced-concrete columns and concrete-filled tubed columns, even under high axial compressive loads. In this paper, the seismic behavior of STHSRC columns is presented. Six full-scale columns were experimentally investigated under constant axial loads and cyclic lateral load/displacement. Test results were compared with those of ordinary high-strength reinforced-concrete columns. Based on the findings of this research, STHSRC columns exhibit higher lateral strength and ductility than ordinary reinforced-concrete columns. Unlike that of ordinary reinforced-co...",
      "venue": "",
      "citations": 82,
      "authors": [
        "R. Aboutaha",
        "R. Machado"
      ],
      "url": "https://www.semanticscholar.org/paper/70eb347adf20f834c4743ef821381eac1ff11bdb"
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "Effect of steel corrosion and loss of concrete cover on strength of deteriorated RC columns",
      "year": 2011,
      "abstract": null,
      "venue": "",
      "citations": 90,
      "authors": [
        "M. Tapan",
        "R. Aboutaha"
      ],
      "url": "https://www.semanticscholar.org/paper/dcda63d9a1582e9868244e05f5a9d56e2fd1f0e1"
    },
    {
      "title": "Environmental Reduction Factors for GFRP Bars Used as Concrete Reinforcement: New Scientific Approach",
      "year": 2010,
      "abstract": "This paper presents a new approach that incorporates the effects of temperature, design life, and relative humidity (RH) of exposure into the environmental reduction factor (RF) for glass fiber reinforced polymer (GFRP) bars used as concrete reinforcement. The environmental RFs for GFRP bars that are adopted in various guidelines are presented and discussed. By using time extrapolation and time-temperature shift approaches, a new equation for design strength of GFRP bar under various exposure time and temperature was proposed. The effect of moisture, in the form of RH, was incorporated into the new equation by investigating the degradation mechanism of GFRP bar owing to alkali attack and the relationship between the RH and concrete pore water. Design examples for strength RFs linked to service life, temperature, and RH were presented on the basis of reported durability data for E-glass/vinyl ester (VE) GFRP bars embedded in concrete.",
      "venue": "",
      "citations": 68,
      "authors": [
        "Jianwei Huang",
        "R. Aboutaha"
      ],
      "url": "https://www.semanticscholar.org/paper/467d2e37dbee7652cfdd9b4c2d3c65ab48bbef9a"
    },
    {
      "title": "Cyclic Response of Exterior Reinforced Concrete Beam-Column Joints Reinforced with Headed Bars-Experimental Investigation",
      "year": 2003,
      "abstract": null,
      "venue": "",
      "citations": 67,
      "authors": [
        "Nuttawat Chutarat",
        "R. Aboutaha"
      ],
      "url": "https://www.semanticscholar.org/paper/b7cdc71de03bd59182660f5cb703c863fd8c79f2"
    }
  ],
  "source": "semanticscholar"
}