{
  "name": "Sara Eftekharnejad",
  "affiliation": "Associate Professor,  Syracuse University",
  "interests": [],
  "citedby": 1980,
  "h_index": 14,
  "i10_index": 17,
  "top_primary_author_publications": [
    {
      "title": "Impact of increased penetration of photovoltaic generation on power systems",
      "year": 2012,
      "abstract": "Present renewable portfolio standards are changing power systems by replacing conventional generation with alternate energy resources such as photovoltaic (PV) systems. With the increase in penetration of PV resources, power systems are expected to experience a change in dynamic and operational characteristics. This paper studies the impact of increased penetration of PV systems on static performance as well as transient stability of a large power system, in particular the transmission system. Utility scale and residential rooftop PVs are added to the aforementioned system to replace a portion of conventional generation resources. While steady state voltages are observed under various PV penetration levels, the impact of reduced inertia on transient stability performance is also examined. The studied system is a large test system representing a portion of the Western U.S. interconnection. The simulation …",
      "venue": "IEEE transactions on power systems",
      "citations": 1039,
      "authors": [
        "Sara Eftekharnejad",
        "Vijay Vittal",
        "Gerald Thomas Heydt",
        "Brian Keel",
        "Jeffrey Loehr"
      ],
      "url": ""
    },
    {
      "title": "Small signal stability assessment of power systems with increased penetration of photovoltaic generation: A case study",
      "year": 2013,
      "abstract": "The present paper investigates the effect of high penetration of photovoltaic (PV) systems on the small signal stability of a large power system. Reduced system inertia and altered power flow patterns as a result of the addition of the utility scale and residential rooftop PVs that replace a portion of conventional generation resources, may lead to decreased damping of the critical modes of the system. To identify the critical modes of the system and the effect of the high PV penetration on these modes, eigenvalue analysis is carried out on the aforementioned system under various PV penetration levels. To substantiate the results observed from the small signal analysis, transient analysis is carried out on the system under various PV penetration levels. The simulation results effectively identify the impact of high PV penetration on small signal stability of the studied system.",
      "venue": "IEEE transactions on sustainable energy",
      "citations": 324,
      "authors": [
        "Sara Eftekharnejad",
        "Vijay Vittal",
        "Gerald Thomas Heydt",
        "Brian Keel",
        "Jeffrey Loehr"
      ],
      "url": ""
    },
    {
      "title": "Optimal generation dispatch with high penetration of photovoltaic generation",
      "year": 2014,
      "abstract": "Power system operation practices are changing with the addition of renewable energy resources such as photovoltaic (PV) sources. The diverse and intermittent nature of these resources demands new operation strategies to ensure system reliability. As more PV units are added to power systems, the power generated by conventional generation resources should be reduced to accommodate these new resources. The reduction in fossil-fired generation allows realization of benefits in the sustainability of the generation mix. While some of the conventional generating units are retired, some should be retained for system reliability. This paper investigates the impact of generation redispatch or generation displacement in systems with high PV penetration. Comparing various study scenarios, a method based on regression techniques and Chebyshevs inequality is introduced in this paper. This method is used to …",
      "venue": "IEEE Transactions on Sustainable Energy",
      "citations": 89,
      "authors": [
        "Sara Eftekharnejad",
        "Gerald Thomas Heydt",
        "Vijay Vittal"
      ],
      "url": ""
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "Packet-data anomaly detection in PMU-based state estimator using convolutional neural network",
      "year": 2019,
      "abstract": "With more phasor measurement units (PMU) being deployed by utilities for reliable monitoring of power systems, there grows an increasing risk of vulnerability to various cyber-attacks. This paper is concerned with a class of false data injection attacks (FDIA) which aim to modify PMU measurements resulting in incorrect state estimation solutions. We extract multi-variate time-series signals from PMU data packets aggregated in phasor data concentrators (PDC) corresponding to different events such as line faults and trips, generation and load fluctuations, shunt disconnections and FDIA prior to every cycle of state estimation (SE). A Convolutional Neural Network (CNN) data filter with Nesterov Adam gradient descent and categorical cross entropy loss is proposed to validate the PMU data. This filter extracts inter time-series relationships to classify different power system events by comparing the temporal structure of …",
      "venue": "International Journal of Electrical Power & Energy Systems",
      "citations": 153,
      "authors": [
        "Sagnik Basumallik",
        "Rui Ma",
        "Sara Eftekharnejad"
      ],
      "url": ""
    },
    {
      "title": "A PMU-based data-driven approach for classifying power system events considering cyberattacks",
      "year": 2020,
      "abstract": "Transient event identification is essential for power system operation and situational awareness. The increased penetration of the high sampling frequency phasor measurement units (PMUs) enables using PMU data to analyze power system events, and thus enhances power system visualization, monitoring and control. At the same time, the risks associated with cyberattacks on power systems increase. A malicious cyberattack on PMUs, aiming at generating fake transient data, may lead to incorrect actions that jeopardize system reliability. Therefore, it is critical to distinguish between fake data and real data when analyzing transient events. Utilizing PMU measurements, this article develops a data-driven approach, based on text-mining methodologies, for classifying transient events and identifying fake events caused by false data attacks. The developed methodology provides credible information regarding the …",
      "venue": "IEEE Systems Journal",
      "citations": 43,
      "authors": [
        "Rui Ma",
        "Sagnik Basumallik",
        "Sara Eftekharnejad"
      ],
      "url": ""
    },
    {
      "title": "Mixed copula-based uncertainty modeling of hourly wind farm production for power system operational planning studies",
      "year": 2020,
      "abstract": "An effective model to represent real-world wind power production scenarios is essential for an accurate assessment of the impact of wind power generation on power systems. Such a model should capture the spatial and temporal correlations between different wind turbines that are part of a wind farm. Accurate modeling of these correlations will ensure that the wind power uncertainty can be properly quantified. This is especially critical when analyzing systems with high penetration of wind power productions. This paper addresses this critical need by developing the  Hourly Mixed Copula Model , a new probabilistic model, based on Gaussian and Archimedean copulas, to model the uncertainty and variability of wind power generation. This model enables the simulation of realistic scenarios of a wind farm power production. Metrics such as the Euclidean distance and Kullback-Leibler divergence are used to …",
      "venue": "IEEE Access",
      "citations": 31,
      "authors": [
        "Wolf Peter Jean Philippe",
        "Shan Zhang",
        "Sara Eftekharnejad",
        "Prasanta K Ghosh",
        "Pramod K Varshney"
      ],
      "url": ""
    }
  ]
}