{
  "name": "Shalabh C. Maroo",
  "affiliation": "Professor, Mechanical and Aerospace Engineering, Syracuse University",
  "interests": [
    "thermal management",
    "energy conversion",
    "nano and micro-technology",
    "nanotechnology",
    "desalination",
    "heat transfer"
  ],
  "citedby": 2470,
  "h_index": 26,
  "i10_index": 38,
  "top_primary_author_publications": [
    {
      "title": "Wettability of graphene",
      "year": 2013,
      "abstract": "Graphene, an atomically thin two-dimensional material, has received significant attention due to its extraordinary electronic, optical, and mechanical properties. Studies focused on understanding the wettability of graphene for thermo-fluidic and surface-coating applications, however, have been sparse. Meanwhile, wettability results reported in literature via static contact angle measurement experiments have been contradictory and highlight the lack of clear understanding of the underlying physics that dictates wetting behavior. In this work, dynamic contact angle measurements and detailed graphene surface characterizations were performed to demonstrate that the defects present in CVD grown and transferred graphene coatings result in unusually high contact angle hysteresis (16–37°) on these otherwise smooth surfaces. Hence, understanding the effect of the underlying substrate based on static contact angle …",
      "venue": "Nano letters",
      "citations": 535,
      "authors": [
        "Rishi Raj",
        "Shalabh C Maroo",
        "Evelyn N Wang"
      ],
      "url": ""
    },
    {
      "title": "Critical height of micro/nano structures for pool boiling heat transfer enhancement",
      "year": 2013,
      "abstract": "Critical heat flux (CHF) enhancement by surface modifications has been an extensively researched area in pool boiling heat transfer. Here we report a fundamental mechanism of CHF enhancement where nano/micro ridges are fabricated on surfaces to fragment and evaporate the metastable non-evaporating/adsorbed film present at the base of a bubble in the contact line region. CHF increase of∼ 125% is obtained with only∼ 40% increase in surface area. An analytical model is extended to explain the CHF enhancement and to determine the average non-evaporating film thickness, which serves as the critical height for nano/micro structures for pool boiling heat transfer enhancement.",
      "venue": "Applied Physics Letters",
      "citations": 159,
      "authors": [
        "An Zou",
        "Shalabh C Maroo"
      ],
      "url": ""
    },
    {
      "title": "Negative pressures in nanoporous membranes for thin film evaporation",
      "year": 2013,
      "abstract": "We present a nanoporous membrane-based approach, which decouples the capillary pressure from the viscous resistance, to achieve high driving pressures and efficient liquid delivery for thin film evaporation. By using alumina membranes with≈ 150 nm pore diameters, absolute liquid pressures as low as− 300 kPa were achieved using isopropyl alcohol, while dissipating maximum interfacial heat fluxes of≈ 96 W/cm 2. Design guidelines are provided to achieve higher interfacial heat fluxes with reduced membrane thicknesses. This work shows a promising approach to address thermal management needs for next generation electronic devices.",
      "venue": "Applied Physics Letters",
      "citations": 135,
      "authors": [
        "Rong Xiao",
        "Shalabh C Maroo",
        "Evelyn N Wang"
      ],
      "url": ""
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "Nano-and microstructures for thin-film evaporation—A review",
      "year": 2014,
      "abstract": "Evaporation from thin films is a key feature of many processes, including energy conversion, microelectronics cooling, boiling, perspiration, and self-assembly operations. The phase change occurring in these systems is governed by transport processes at the contact line where liquid, vapor, and solid meet. Evidence suggests that altering the surface chemistry and surface topography on the micro- and the nanoscales can be used to dramatically enhance vaporization. The 2013 International Workshop on Micro- and Nanostructures for Phase-Change Heat Transfer brought together a group of experts to review the current state-of-the-art and discuss future research needs. This article is focused on the thin-film evaporation panel discussion and outlines some of the key principles and conclusions reached by that panel and the workshop attendees.",
      "venue": "",
      "citations": 255,
      "authors": [
        "JL Plawsky",
        "AG Fedorov",
        "SV Garimella",
        "HB Ma",
        "SC Maroo",
        "L Chen",
        "Youngsuk Nam"
      ],
      "url": ""
    },
    {
      "title": "Early evaporation of microlayer for boiling heat transfer enhancement",
      "year": 2016,
      "abstract": "For over five decades, an enhancement in pool boiling heat transfer has been achieved by altering the surface wetting, wickability, roughness, nucleation site density, and providing separate liquid/vapor pathways. In this work, a new enhancement mechanism based on the early evaporation of the microlayer is discovered and validated. The microlayer is a thin liquid film present at the base of a vapor bubble. The presence of microridges on the silicon dioxide surface partitions the microlayer and disconnects it from the bulk liquid, causing it to evaporate sooner, thus leading to increase in the bubble growth rate, heat transfer, departure frequency, and critical heat flux (CHF). Compared to a plain surface, an ∼120% enhancement in CHF is obtained with only an ∼18% increase in surface area. A CHF enhancement map is developed on the basis of the ridge height and spacing, resulting in three regions of full, partial …",
      "venue": "Langmuir",
      "citations": 95,
      "authors": [
        "An Zou",
        "Dhirendra P Singh",
        "Shalabh C Maroo"
      ],
      "url": ""
    },
    {
      "title": "Materials, fabrication, and manufacturing of micro/nanostructured surfaces for phase-change heat transfer enhancement",
      "year": 2014,
      "abstract": "This article describes the most prominent materials, fabrication methods, and manufacturing schemes for micro- and nanostructured surfaces that can be employed to enhance phase-change heat transfer phenomena. The numerous processes include traditional microfabrication techniques such as thin-film deposition, lithography, and etching, as well as template-assisted and template-free nanofabrication techniques. The creation of complex, hierarchical, and heterogeneous surface structures using advanced techniques is also reviewed. Additionally, research needs in the field and future directions necessary to translate these approaches from the laboratory to high-performance applications are identified. Particular focus is placed on the extension of these techniques to the design of micro/nanostructures for increased performance, manufacturability, and reliability. The current research needs and goals are …",
      "venue": "Nanoscale and Microscale Thermophysical Engineering",
      "citations": 82,
      "authors": [
        "Matthew McCarthy",
        "Konstantinos Gerasopoulos",
        "Shalabh C Maroo",
        "A John Hart"
      ],
      "url": ""
    }
  ],
  "source": "scholar"
}