{
  "name": "Sharon Alestalo",
  "affiliation": "Program Director, Faculty Affairs and WiSE at Syracuse University",
  "interests": [
    "gender equity",
    "inclusion",
    "diversity",
    "higher education",
    "science & engineering"
  ],
  "citedby": 28,
  "h_index": 3,
  "i10_index": 0,
  "top_primary_author_publications": [
    {
      "title": "Faculty mentoring in a networked world",
      "year": 2014,
      "abstract": "In addition to current mentoring research, this manual has been informed by the expertise and experiences of other National Science Foundation ADVANCE projects and faculty mentoring programs at other Universities. Notably, guidance on content and helpful tools has been adapted from such resources as the Faculty Mentoring Toolkit: A",
      "venue": "Syracuse, NY: Syracuse University",
      "citations": 7,
      "authors": [
        "M Garland",
        "S Alestalo"
      ],
      "url": ""
    },
    {
      "title": "Geotechnical women faculty from 1989–2017: A US Case study",
      "year": 2018,
      "abstract": "This case study addresses the advancements of women geotechnical engineering faculty in the U.S. over the past 30 years. In 1989, there were just eight women geotechnical faculty in the U.S. Today, we estimate that there are more than 80. Since 1989, there have been various efforts to increase the number and visibility of women geotechnical faculty, including NSF-funded workshops in 1989, 2003, and 2017; listservs and technical committees designed to connect women faculty and/or professionals; and networking efforts to develop and maintain connections between men and women geotechnical faculty for the purpose of enhancing the potential for collaboration between academia and industry. We discuss the various efforts, their successes and failures, and the lessons learned from these efforts.",
      "venue": "",
      "citations": 5,
      "authors": [
        "Patricia M Gallagher",
        "Sharon W Alestalo",
        "Shobha K Bhatia",
        "Adda Athanasopoulos-Zekkos",
        "Sucheta Soundarajan"
      ],
      "url": ""
    },
    {
      "title": "Support of women geotechnical engineering faculty: History and initiatives",
      "year": 2015,
      "abstract": "The inability of the geotechnical engineering profession and individual institutions to create systemic equality in culture, outcomes and representation for women faculty results in persistent and severe isolation. This isolation generates a tandem set of challenges that directly impact the recruitment, retention and career success of women faculty. Current data sources indicates that approximately 11% of national geotechnical engineering faculty are women compared to sister disciplines such as structural engineering which range from 15% to 17%. Furthermore, over a third of the US research one universities with geotechnical engineering programs have no women faculty and only 1 out of 10 have two or more. These figures paint a clear and precarious picture of the isolation and underrepresentation which also contributes directly to the pipeline problem; fewer women entering and completing their education at the …",
      "venue": "",
      "citations": 5,
      "authors": [
        "Sharon W Alestalo",
        "Shobha K Bhatia",
        "Beena Sukumaran"
      ],
      "url": ""
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "Increasing Collaboration among Geotechnical Engineering Faculty: A Case Study from the “Geotechnical Engineering Women Faculty: Networked and Thriving” Project",
      "year": 2019,
      "abstract": "The number of women in the geotechnical engineering profession has increased exponentially in the past 30 years. Even so, women only comprise about 20% of the geotechnical faculty in the U.S. This case study describes a recent project to create an enduring network of geotechnical engineering faculty colleagues and collaborators, both women and men. The authors implemented a professional development intervention model to improve networks and collaboration and a social network survey to improve understanding of existing networks and practices. Within the intervention model, a successful strategy for establishing new collaborations and enhancing existing collaborations, was the award of small seed grants combined with the structured opportunities to meet and learn together. The seed grant program could be a model for academic institutions and other organizations to facilitate collaborative efforts that …",
      "venue": "",
      "citations": 3,
      "authors": [
        "Patricia Gallagher",
        "Shobha Bhatia",
        "Sharon Alestalo",
        "Sucheta Soundarajan",
        "Adda Athanasopoulos-Zekkos"
      ],
      "url": ""
    },
    {
      "title": "Promoting child welfare: Training professionals to support healthy marriages, relationships, and families: Resources for human service practitioners and educators",
      "year": 2008,
      "abstract": "Promoting child welfare: training professionals to support healthy marriages, relationships, and \nfamilies : resources for human service practitioners and educators — Experts@Syracuse Skip \nto main navigation Skip to search Skip to main content Experts@Syracuse Home \nExperts@Syracuse Logo Help & FAQ Home Profiles Research units Research output \nEquipment Grants Activities Press and Media Prizes Search by expertise, name or affiliation \nPromoting child welfare: training professionals to support healthy marriages, relationships, and \nfamilies : resources for human service practitioners and educators Keith Anthony Alford, Nancy \nR Mudrick, Sharon Alestalo, School of Social Work, Syracuse University School of Social Work \nAging Studies Institute Research output: Non-textual form › Data set/Database Overview \nOriginal language English (US) Place of Publication Syracuse, NY Publisher College of Human …",
      "venue": "",
      "citations": 1,
      "authors": [
        "Keith Anthony Alford",
        "Nancy R Mudrick",
        "Sharon Alestalo"
      ],
      "url": ""
    },
    {
      "title": "Intersectionality as Praxis for Equity in STEM: A WiSE Women of Color Program",
      "year": 2019,
      "abstract": "Intersectionality as Praxis for Equity in STEM: A WiSE Women of Color Program — Experts@Syracuse \nSkip to main navigation Skip to search Skip to main content Experts@Syracuse Home \nExperts@Syracuse Logo Help & FAQ Home Profiles Research units Research output \nEquipment Grants Activities Press and Media Prizes Search by expertise, name or affiliation \nIntersectionality as Praxis for Equity in STEM: A WiSE Women of Color Program Dawn R. \nJohnson, Michelle M. Blum, Kate Lewis, Sharon W. Alestalo Department of Higher Education \nThe BioInspired Institute Aging Studies Institute Research output: Chapter in Book/Entry/Poem › \nChapter (peer-reviewed) › peer-review Overview Original language English (US) Title of host \npublication Intersectionality & Higher Education: Theory, Research and Praxis Chapter 19 State \nPublished - 2019 Cite this APA Standard Harvard Vancouver Author BIBTEX RIS Powered …",
      "venue": "",
      "citations": 0,
      "authors": [
        "Dawn R Johnson",
        "Michelle M Blum",
        "Kate Lewis",
        "Sharon W Alestalo"
      ],
      "url": ""
    }
  ],
  "source": "scholar"
}