{
  "name": "Sucheta Soundarajan",
  "affiliation": "Syracuse University",
  "interests": [
    "Data Mining",
    "Social Network Analysis",
    "Algorithms"
  ],
  "citedby": 1024,
  "h_index": 16,
  "i10_index": 22,
  "top_primary_author_publications": [
    {
      "title": "Using community information to improve the precision of link prediction methods",
      "year": 2012,
      "abstract": "Because network data is often incomplete, researchers consider the link prediction problem, which asks which non-existent edges in an incomplete network are most likely to exist in the complete network. Classical approaches compute the 'similarity' of two nodes, and conclude that highly similar nodes are most likely to be connected in the complete network. Here, we consider several such similarity-based measures, but supplement the similarity calculations with community information. We show that for many networks, the inclusion of community information improves the accuracy of similarity-based link prediction methods.",
      "venue": "",
      "citations": 152,
      "authors": [
        "Sucheta Soundarajan",
        "John Hopcroft"
      ],
      "url": ""
    },
    {
      "title": "A guide to selecting a network similarity method",
      "year": 2014,
      "abstract": "We consider the problem of determining how similar two networks (without known node-correspondences) are. This problem occurs frequently in real-world applications such as transfer learning and change detection. Many network-similarity methods exist; and it is unclear how one should select from amongst them. We provide the first empirical study on the relationships between different network-similarity methods. Specifically, we present (1) an approach for identifying groups of comparable network-similarity methods and (2) an approach for computing the consensus among a given set of network-similarity methods. We compare and contrast twenty network-similarity methods by applying our approaches to a variety of real datasets spanning multiple domains. Our experiments demonstrate that (1) different network-similarity methods are surprisingly well correlated, (2) some complex network-similarity methods …",
      "venue": "",
      "citations": 85,
      "authors": [
        "Sucheta Soundarajan",
        "Tina Eliassi-Rad",
        "Brian Gallagher"
      ],
      "url": ""
    },
    {
      "title": "On the separability of structural classes of communities",
      "year": 2012,
      "abstract": "Three major factors govern the intricacies of community extraction in networks: (1) the application domain includes a wide variety of networks of fundamentally different natures, (2) the literature offers a multitude of disparate community detection algorithms, and (3) there is no consensus characterizing how to discriminate communities from non-communities. In this paper, we present a comprehensive analysis of community properties through a class separability framework. Our approach enables the assessement of the structural dissimilarity among the output of multiple community detection algorithms and between the output of algorithms and communities that arise in practice. To demostrate this concept, we furnish our method with a large set of structural properties and multiple community detection algorithms. Applied to a diverse collection of large scale network datasets, the analysis reveals that (1) the different …",
      "venue": "",
      "citations": 60,
      "authors": [
        "Bruno Abrahao",
        "Sucheta Soundarajan",
        "John Hopcroft",
        "Robert Kleinberg"
      ],
      "url": ""
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "Hidden community detection in social networks",
      "year": 2018,
      "abstract": "This paper introduces a new graph-theoretical concept of hidden community for analysing complex networks, which contain both stronger or dominant communities and weak communities. The weak communities are termed as being with the hidden community structure if most of its members also belong to the stronger communities. We propose a meta-approach, namely HICODE (HIdden COmmunity DEtection), for identifying the hidden community structure as well as enhancing the detection of the dominant community structure. Extensive experiments on real-world networks are carried out and the obtained results demonstrate that HICODE outperforms several state-of-the-art community detection methods in terms of uncovering both the dominant and the hidden structure. Due to the difficulty of labeling all ground truth communities in real-world datasets, HICODE provides a promising technique to pinpoint the …",
      "venue": "Information Sciences",
      "citations": 119,
      "authors": [
        "Kun He",
        "Yingru Li",
        "Sucheta Soundarajan",
        "John E Hopcroft"
      ],
      "url": ""
    },
    {
      "title": "An ultra-efficient memristor-based DNN framework with structured weight pruning and quantization using ADMM",
      "year": 2019,
      "abstract": "The high computation and memory storage of large deep neural networks (DNNs) models pose intensive challenges to the conventional Von-Neumann architecture, incurring sub-stantial data movements in the memory hierarchy. The memristor crossbar array has emerged as a promising solution to mitigate the challenges and enable low-power acceleration of DNNs. Memristor-based weight pruning and weight quantization have been seperately investigated and proven effectiveness in reducing area and power consumption compared to the original DNN model. However, there has been no systematic investigation of memristor-based neuromorphic computing (NC) systems considering both weight pruning and weight quantization. In this paper, we propose an unified and systematic memristor-based framework considering both structured weight pruning and weight quantization by incorporating alternating …",
      "venue": "2019 IEEE/ACM International Symposium on Low Power Electronics and Design (ISLPED)",
      "citations": 56,
      "authors": [
        "Geng Yuan",
        "Xiaolong Ma",
        "Caiwen Ding",
        "Sheng Lin",
        "Tianyun Zhang",
        "Zeinab S Jalali",
        "Yilong Zhao",
        "Li Jiang",
        "Sucheta Soundarajan",
        "Yanzhi Wang"
      ],
      "url": ""
    },
    {
      "title": "Measuring and improving the core resilience of networks",
      "year": 2018,
      "abstract": "The concept of k-cores is important for understanding the global structure of networks, as well as for identifying central or important nodes within a network. It is often valuable to understand the resilience of the k-cores of a network to attacks and dropped edges (i.e., damaged communications links). We provide a formal definition of a network»s core resilience, and examine the problem of characterizing core resilience in terms of the network»s structural features: in particular, which structural properties cause a network to have high or low core resilience? To measure this, we introduce two novel node properties,Core Strength andCore Influence, which measure the resilience of individual nodes» core numbers and their influence on other nodes» core numbers. Using these properties, we propose theMaximize Resilience of k-Core algorithm to add edges to improve the core resilience of a network. We consider two …",
      "venue": "",
      "citations": 37,
      "authors": [
        "Ricky Laishram",
        "Ahmet Erdem Sariyüce",
        "Tina Eliassi-Rad",
        "Ali Pinar",
        "Sucheta Soundarajan"
      ],
      "url": ""
    }
  ],
  "source": "scholar"
}