{
  "name": "Tong Lin",
  "affiliation": "Syracuse University",
  "interests": [
    "Indoor Air Quality",
    "Turbomachinery"
  ],
  "citedby": 46,
  "h_index": 4,
  "i10_index": 2,
  "top_primary_author_publications": [
    {
      "title": "Ceiling impact on air disinfection performance of Upper-Room Germicidal Ultraviolet (UR-GUV)",
      "year": 2022,
      "abstract": "This study used Computational Fluid Dynamics (CFD) to investigate air disinfection for SARS-CoV-2 by the Upper-Room Germicidal Ultraviolet (UR-GUV), with focus on ceiling impact. The study includes three indoor settings, i.e., low (airport bus), medium (classroom) and high (rehearsal room) ceilings, which were ventilated with 100% clean air (CA case), 80% air-recirculation with a low filtration (LF case), and 80% air-recirculation with a high filtration (HF case). According to the results, using UR-GUV can offset the increased infection risk caused by air recirculation, with viral concentrations in near field (NF) and far field (FF) in the LF case similar to those in the CA case. In the CA case, fraction remaining (FR) was 0.48–0.73 with 25% occupancy rate (OR) and 0.49–0.91 with 45% OR in the bus, 0.41 in NF and 0.11 in FF in the classroom, and 0.18 in NF and 0.09 in FF in the rehearsal room. Obviously, UR-GUV …",
      "venue": "Building and Environment",
      "citations": 15,
      "authors": [
        "Shengwei Zhu",
        "Tong Lin",
        "Lingzhe Wang",
        "Edward A Nardell",
        "Richard L Vincent",
        "Jelena Srebric"
      ],
      "url": ""
    },
    {
      "title": "Characterization of aerosol plumes from singing and playing wind instruments associated with the risk of airborne virus transmission",
      "year": 2022,
      "abstract": "The exhalation of aerosols during musical performances or rehearsals posed a risk of airborne virus transmission in the COVID‐19 pandemic. Previous research studied aerosol plumes by only focusing on one risk factor, either the source strength or convective transport capability. Furthermore, the source strength was characterized by the aerosol concentration and ignored the airflow rate needed for risk analysis in actual musical performances. This study characterizes aerosol plumes that account for both the source strength and convective transport capability by conducting experiments with 18 human subjects. The source strength was characterized by the source aerosol emission rate, defined as the source aerosol concentration multiplied by the source airflow rate (brass 383 particle/s, singing 408 particle/s, and woodwind 480 particle/s). The convective transport capability was characterized by the plume …",
      "venue": "Indoor air",
      "citations": 12,
      "authors": [
        "Lingzhe Wang",
        "Tong Lin",
        "Hevander Da Costa",
        "Shengwei Zhu",
        "Tehya Stockman",
        "Abhishek Kumar",
        "James Weaver",
        "Mark Spede",
        "Donald K Milton",
        "Jean Hertzberg",
        "Darin W Toohey",
        "Marina E Vance",
        "Shelly L Miller",
        "Jelena Srebric"
      ],
      "url": ""
    },
    {
      "title": "Tradeoffs between ventilation, air mixing, and passenger density for the airborne transmission risk in airport transportation vehicles",
      "year": 2022,
      "abstract": "Airport transportation vehicles, such as buses, aerotrains, and shuttles, provide important passenger transfer services in airports. This study quantitatively investigated COVID-19 aerosol infection risk and identified acceptable operational conditions, such as passenger occupancy rates and duration of rides, given the performance of vehicle ventilation. The greatest risk to the largest number of passengers is from an index case whose exhaled breath would take the longest time to exit the vehicle. The study identified such a case based on ventilation patterns, and it tracked the spread of viral aerosols (5 μm) by using the Wells-Riley equation to predict aerosol infection risk distribution. These distributions allowed a definition of an imperfect mixing degree (δ) as the ratio of actual risk and the calculated risk under a perfect mixing condition, and further derived regression equations to predict δ in the far-field (FF) and near …",
      "venue": "Building and Environment",
      "citations": 7,
      "authors": [
        "Shengwei Zhu",
        "Tong Lin",
        "Jose Guillermo Cedeno Laurent",
        "John D Spengler",
        "Jelena Srebric"
      ],
      "url": ""
    }
  ],
  "top_secondary_author_publications": []
}