{
  "name": "Victor Duenas",
  "affiliation": "Syracuse University",
  "interests": [
    "Control Theory",
    "Adaptive Control",
    "Rehabilitation Robotics",
    "Functional Electrical Stimulation"
  ],
  "citedby": 485,
  "h_index": 14,
  "i10_index": 20,
  "top_primary_author_publications": [
    {
      "title": "Motorized and functional electrical stimulation induced cycling via switched repetitive learning control",
      "year": 2018,
      "abstract": "Cycling induced by functional electrical stimulation (FES) coupled with motorized assistance is a promising rehabilitative strategy. A switching controller that activates lower limb muscles alongside an electric motor based on the crank angle is developed to facilitate cycling. Due to the periodic nature of cadence tracking in cycling, a repetitive learning controller (RLC) is developed to track a desired cadence trajectory with a known period. The RLC is developed for an uncertain, nonlinear cycle-rider system with autonomous state-dependent switching. Electrical stimulation switches across multiple lower limb muscle groups based on the torque effectiveness throughout the crank cycle. The electric motor provides assistance when the muscle groups yield low torque production. A Lyapunov-based stability analysis that invokes a recently developed LaSalle-Yoshizawa corollary for nonsmooth systems is used to …",
      "venue": "IEEE Transactions on Control Systems Technology",
      "citations": 45,
      "authors": [
        "Victor H Duenas",
        "Christian A Cousin",
        "Anup Parikh",
        "Paul Freeborn",
        "Emily J Fox",
        "Warren E Dixon"
      ],
      "url": ""
    },
    {
      "title": "Passivity-based iterative learning control for cycling induced by functional electrical stimulation with electric motor assistance",
      "year": 2018,
      "abstract": "This brief examines the use of a learning control method in a passivity-based framework to control a motorized cycle-rider system with functional electrical stimulation (FES) of the quadriceps muscle groups. FES cycling with motorized assistance has been used in the rehabilitation of people with neurological conditions. The concepts of adaptation and passivity are explored to compensate for the uncertain nonlinear time-varying dynamics of the motorized FES cycle-rider system. The system is modeled as a closed-loop feedback, state-dependent switched system such that in each cycle, the quadriceps muscle groups produce the functional torque and the electric motor provides assistance as needed. The output strictly passive feature of the closed-loop system is proven by considering a learning control input. Then, an adaptive update law, based on iterative learning control, is developed to guarantee the …",
      "venue": "IEEE Transactions on Control Systems Technology",
      "citations": 36,
      "authors": [
        "Vahideh Ghanbari",
        "Victor H Duenas",
        "Panos J Antsaklis",
        "Warren E Dixon"
      ],
      "url": ""
    },
    {
      "title": "Closed-loop cadence and instantaneous power control on a motorized functional electrical stimulation cycle",
      "year": 2019,
      "abstract": "Motorized functional electrical stimulation (FES) cycling is a rehabilitation therapy in which electrical stimulation is used to activate lower body muscles to pedal a cycle in conjunction with motorized assistance. FES cycling has been demonstrated to improve cardiovascular parameters, muscle mass, and motor control of people with neurological conditions (NCs). A common FES cycling objective is simultaneous cadence and power (torque) tracking; however, it is unclear how to best coordinate the FES and motor contributions and if power should be tracked instantaneously or averaged over a period of time. This article develops a new FES cycling controller using a switched Lyapunov-like dwell-time analysis for the nonlinear, uncertain cycling system to conclude global exponential cadence tracking and uniformly ultimately bounded power tracking. To evaluate the performance of the developed controller …",
      "venue": "IEEE Transactions on Control Systems Technology",
      "citations": 34,
      "authors": [
        "Christian A Cousin",
        "Victor H Duenas",
        "Courtney A Rouse",
        "Matthew J Bellman",
        "Paul Freeborn",
        "Emily J Fox",
        "Warren E Dixon"
      ],
      "url": ""
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "Controlling the cadence and admittance of a functional electrical stimulation cycle",
      "year": 2019,
      "abstract": "For an individual suffering from a neurological condition, such as spinal cord injury, traumatic brain injury, or stroke, motorized functional electrical stimulation (FES) cycling is a rehabilitation strategy, which offers numerous health benefits. Motorized FES cycling is an example of physical human-robot interaction in which both systems must be controlled; the human is actuated by applying neuromuscular electrical stimulation to the large leg muscle groups, and the cycle is actuated through its onboard electric motor. While the rider is stimulated using a robust sliding-mode controller, the cycle utilizes an admittance controller to preserve rider safety. The admittance controller is shown to be passive with respect to the rider, and the cadence controller is shown to be globally exponentially stable through a Lyapunov-like switched systems stability analysis. Experiments are conducted on three able-bodied participants and …",
      "venue": "IEEE Transactions on Neural Systems and Rehabilitation Engineering",
      "citations": 34,
      "authors": [
        "Christian A Cousin",
        "Courtney A Rouse",
        "Victor H Duenas",
        "Warren E Dixon"
      ],
      "url": ""
    },
    {
      "title": "Closed-loop torque and kinematic control of a hybrid lower-limb exoskeleton for treadmill walking",
      "year": 2022,
      "abstract": "Restoring and improving the ability to walk is a top priority for individuals with movement impairments due to neurological injuries. Powered exoskeletons coupled with functional electrical stimulation (FES), called hybrid exoskeletons, exploit the benefits of activating muscles and robotic assistance for locomotion. In this paper, a cable-driven lower-limb exoskeleton is integrated with FES for treadmill walking at a constant speed. A nonlinear robust controller is used to activate the quadriceps and hamstrings muscle groups via FES to achieve kinematic tracking about the knee joint. Moreover, electric motors adjust the knee joint stiffness throughout the gait cycle using an integral torque feedback controller. For the hip joint, a robust sliding-mode controller is developed to achieve kinematic tracking using electric motors. The human-exoskeleton dynamic model is derived using Lagrangian dynamics and incorporates phase-dependent switching to capture the effects of transitioning from the stance to the swing phase, and vice versa. Moreover, low-level control input switching is used to activate individual muscles and motors to achieve flexion and extension about the hip and knee joints. A Lyapunov-based stability analysis is developed to ensure exponential tracking of the kinematic and torque closed-loop error systems, while guaranteeing that the control input signals remain bounded. The developed controllers were tested in real-time walking experiments on a treadmill in three able-bodied individuals at two gait speeds. The experimental results demonstrate the feasibility of coupling a cable-driven exoskeleton with FES for treadmill walking using a …",
      "venue": "Frontiers in Robotics and AI",
      "citations": 19,
      "authors": [
        "Chen-Hao Chang",
        "Jonathan Casas",
        "Steven W Brose",
        "Victor H Duenas"
      ],
      "url": ""
    },
    {
      "title": "FES cycling in stroke: novel closed-loop algorithm accommodates differences in functional impairments",
      "year": 2019,
      "abstract": "",
      "venue": "IEEE Transactions on Biomedical Engineering",
      "citations": 17,
      "authors": [
        "Courtney A Rouse",
        "Ryan J Downey",
        "Chris M Gregory",
        "Christian A Cousin",
        "Victor H Duenas",
        "Warren E Dixon"
      ],
      "url": ""
    }
  ],
  "source": "scholar"
}