{
  "name": "Yizhi Liu",
  "affiliation": "Assistant Professor, Syracuse University",
  "interests": [
    "Construction Robotics",
    "Construction Automation",
    "Human-Robot Collaboration"
  ],
  "citedby": 579,
  "h_index": 10,
  "i10_index": 11,
  "top_primary_author_publications": [
    {
      "title": "Brain-computer interface for hands-free teleoperation of construction robots",
      "year": 2021,
      "abstract": "Recently, the use of collaborative robots has started to emerge at construction sites. Such incorporation into these human-dominated environments can raise safety concerns as most robots are not fully automated and require some sort of control mechanism. Conventional control systems may fall short under specific situations in which workers require robotic assistance but cannot use their hands to control the robot. Brain-computer interface (BCI) can offer such hands-free controllability, a non-muscular communicative channel that can establish an interpretive pathway between humans and robots. This paper proposes a BCI-based system to remotely control a robot by continuously capturing workers' brainwaves acquired from a wearable electroencephalogram (EEG) device and interpreting them into robotic commands with 90% accuracy. The findings revealed the proposed system holds promise for enhancing …",
      "venue": "Automation in Construction",
      "citations": 125,
      "authors": [
        "Yizhi Liu",
        "Mahmoud Habibnezhad",
        "Houtan Jebelli"
      ],
      "url": ""
    },
    {
      "title": "Brainwave-driven human-robot collaboration in construction",
      "year": 2021,
      "abstract": "Due to the unstructured, fast-changing environment of construction sites, robots require human assistance to perform various tasks, especially those involving high dexterity and nuanced human judgment. However, in shared physical spaces, human-robot collaboration (HRC) can raise new safety concerns as workers' mental health can be adversely affected by poor communication between the two peers. To create a harmonized, safe HRC, this study proposes a worker-centered collaborative framework that enables robots to capture workers' brainwaves from wearable electroencephalograph, evaluate their task-related cognitive load, and adjust the robotic performance accordingly. The framework was examined by asking 14 subjects to execute a collaborative construction task with a terrestrial robot under various levels of cognitive loads. The results showed the robot could regulate its working pace with 81.91 …",
      "venue": "Automation in Construction",
      "citations": 122,
      "authors": [
        "Yizhi Liu",
        "Mahmoud Habibnezhad",
        "Houtan Jebelli"
      ],
      "url": ""
    },
    {
      "title": "Paving the way for future EEG studies in construction: dependent component analysis for automatic ocular artifact removal from brainwave signals",
      "year": 2021,
      "abstract": "Construction workers’ poor mental states can lead to numerous safety and productivity issues. One major trend in construction research is quantitatively evaluating workers’ psychophysiological states. With the advances in wearable electroencephalogram (EEG) devices, such assessment can be possible by interpreting workers’ brainwave patterns. However, the recorded EEG signals are highly contaminated with signal noises, particularly ocular-related artifacts generated from blinking and eye movement. Although most of the noise can be suppressed by well-established filtering techniques, ocular artifacts cannot be eliminated easily and automatically by conventional techniques. To overcome this challenge, this study proposes a procedure to reduce ocular artifacts by integrating dependence component analysis, image processing, and machine learning algorithms. The results demonstrated the potential of the …",
      "venue": "Journal of Construction Engineering and Management",
      "citations": 35,
      "authors": [
        "Yizhi Liu",
        "Mahmoud Habibnezhad",
        "Shayan Shayesteh",
        "Houtan Jebelli",
        "SangHyun Lee"
      ],
      "url": ""
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "Assessing occupational risk of heat stress at construction: A worker-centric wearable sensor-based approach",
      "year": 2021,
      "abstract": "Construction workers are at a high risk of exposure to excessive heat generated by several factors such as intensive physical activities, personal protective clothing, and frequent heat events at construction sites. Previous studies attempted to evaluate the occupational risk of heat stress by concentrating on environmental variables or the self-assessment measures of perceived heat. Despite their potentials, most of these approaches were intrusive, inaccurate, and intermittent. More importantly, they mainly overlooked the disparities in workers' physical and physiological characteristics. To address these limitations, this study proposes a heat-stress risk-assessment process to evaluate workers' bodily responses to heat – heat strain – based on the continuous measurement of their physiological signals. To this end, workers' physiological signals were captured using a wristband-type biosensor. Subsequently, their …",
      "venue": "Safety science",
      "citations": 74,
      "authors": [
        "Shahrad Shakerian",
        "Mahmoud Habibnezhad",
        "Amit Ojha",
        "Gaang Lee",
        "Yizhi Liu",
        "Houtan Jebelli",
        "SangHyun Lee"
      ],
      "url": ""
    },
    {
      "title": "Human-robot teaming in construction: Evaluative safety training through the integration of immersive technologies and wearable physiological sensing",
      "year": 2023,
      "abstract": "Occupational safety has become a major issue in the construction industry over the years. Studies have shown that work-related accidents are mostly caused by the unsafe behaviors of construction workers, implying that they can be avoided with the appropriate safety training. With emerging technologies being increasingly implemented in the construction industry, there is a growing need to improve pedagogical techniques to equip workers with the multidisciplinary skills required to safely accomplish construction tasks. Construction robots are fine examples of such technologies that necessitate more effective training, as their adoption in the field is closely tied to workers’ safety. However, there is a lack of robust safety training methods for working with robots that can ensure the effectiveness of the training process. To address this issue, this study proposes a virtual avatar-based training platform for collaborating …",
      "venue": "Safety science",
      "citations": 42,
      "authors": [
        "Shayan Shayesteh",
        "Amit Ojha",
        "Yizhi Liu",
        "Houtan Jebelli"
      ],
      "url": ""
    },
    {
      "title": "Non-invasive physical demand assessment using wearable respiration sensor and random forest classifier",
      "year": 2021,
      "abstract": "Physically demanding tasks are one of the leading causes of fatigue among workers in labor-intensive industries such as construction. Despite the recent development in physical demand assessment, there is a lack of a practical solution to reduce injuries and illnesses resulted from high-intensity tasks. Consequently, this study proposes a framework to assess the workers' physical demand level using an off-the-shelf respiration sensor. In the proposed framework, the extracted features from respiratory signals in the time and frequency domain are used to train the random forest classifier. Then, the trained model is used to classify the physical demand of the worker in new observations. To evaluate the performance of the proposed framework, an experiment including a masonry wall construction task was designed where the respiratory signals of the 15 participants were recorded. Then, the collected signals were …",
      "venue": "Journal of Building Engineering",
      "citations": 35,
      "authors": [
        "Milad Sadat-Mohammadi",
        "Shahrad Shakerian",
        "Yizhi Liu",
        "Somayeh Asadi",
        "Houtan Jebelli"
      ],
      "url": ""
    }
  ]
}