{
  "name": "Young B Moon",
  "affiliation": "Syracuse University",
  "interests": [
    "Cyber-Manufacturing Systems",
    "Machine Learning",
    "Modeling and Simulation",
    "Cyber-Physical Security",
    "Sustainability"
  ],
  "citedby": 3081,
  "h_index": 26,
  "i10_index": 55,
  "top_primary_author_publications": [
    {
      "title": "Enterprise Resource Planning (ERP): a review of the literature",
      "year": 2007,
      "abstract": "This article is a review of work published in various journals on the topics of Enterprise Resource Planning (ERP) between January 2000 and May 2006. A total of 313 articles from 79 journals are reviewed. The article intends to serve three goals. First, it will be useful to researchers who are interested in understanding what kinds of questions have been addressed in the area of ERP. Second, the article will be a useful resource for searching for research topics. Third, it will serve as a comprehensive bibliography of the articles published during the period. The literature is analysed under six major themes and nine sub-themes.",
      "venue": "International Journal of Management and Enterprise Development",
      "citations": 590,
      "authors": [
        "Young Moon"
      ],
      "url": ""
    },
    {
      "title": "Generalized part family formation using neural network techniques",
      "year": 1992,
      "abstract": "The spontaneous generalization capability of neural network models has been exploited for solving the part family formation problem. Our approach combines the useful capacities of the neural network technique with the flexibility of the similarity coefficient method. Notably, the constraint satisfaction model of neural networks is adopted. In generalized part family formation, several practical factors such as sequence of operations, lot size, and multiple process plans are also considered. Our approach proves to be highly flexible in satisfying various requirements and efficient for integration with other manufacturing functions.",
      "venue": "Journal of Manufacturing Systems",
      "citations": 148,
      "authors": [
        "YB Moon",
        "SC Chi"
      ],
      "url": ""
    },
    {
      "title": "Simulation Modeling for Sustainability: A Review of the Literature",
      "year": 2017,
      "abstract": "This article is a review of work published in various journals and conference proceedings on the topics of Simulation Modelling for Sustainability between January 2000 and May 2015. A total of 192 papers are reviewed. The article intends to serve three goals. First, it will be useful to researchers who wish to know what kinds of questions have been raised and how they have been addressed in the areas of simulation modelling for sustainability. Second, the article will be a useful resource for searching research topics. Third, it will serve as a comprehensive bibliography of the papers published during the period. The literature is analysed for application areas, simulation methods and dimensions of the triple bottom line model of sustainable development.",
      "venue": "International Journal of Sustainable Engineering",
      "citations": 142,
      "authors": [
        "Young B Moon"
      ],
      "url": ""
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "Detecting cyber-physical attacks in CyberManufacturing systems with machine learning methods",
      "year": 2019,
      "abstract": "CyberManufacturing system (CMS) is a vision for future manufacturing systems. The concept delineates a vision of advanced manufacturing system integrated with technologies such as Internet of Things, Cloud Computing, Sensors Network and Machine Learning. As a result, cyber-attacks such as Stuxnet attack will increase along with growing simultaneous connectivity. Now, cyber-physical attacks are new and unique risks to CMSs and modern cyber security countermeasure is not enough. To learn this new vulnerability, the cyber-physical attacks is defined via a taxonomy under the vision of CMS. Machine learning on physical data is studied for detecting cyber-physical attacks. Two examples were developed with simulation and experiments: 3D printing malicious attack and CNC milling machine malicious attack. By implementing machine learning methods in physical data, the anomaly detection algorithm …",
      "venue": "Journal of Intelligent Manufacturing",
      "citations": 282,
      "authors": [
        "Mingtao Wu",
        "Zhengyi Song",
        "Young B. Moon"
      ],
      "url": ""
    },
    {
      "title": "Detecting malicious defects in 3d printing process using machine learning and image classification",
      "year": 2016,
      "abstract": "3D printing, or additive manufacturing, is a key technology for future manufacturing systems. However, 3D printing systems have unique vulnerabilities presented by the ability to affect the infill without affecting the exterior.In order to detect malicious infill defects in 3D printing process, this paper proposes the following: 1) investigate malicious defects in the 3D printing process, 2) extract features based on simulated 3D printing process images, and 3) an experiment of image classification with one group of non-defect infill image and the other group of defect infill training image from 3D printing process. The images are captured layer by layer from the top view of software simulation preview.The data extracted from images is input to two machine learning algorithms, Naive Bayes Classifier and J48 Decision Trees. The result shows Naive Bayes Classifier has an accuracy of 85.26% and J48 Decision Trees …",
      "venue": "International Mechanical Engineering Congress and Exposition (IMECE)",
      "citations": 108,
      "authors": [
        "Mingtao Wu",
        "Vir V Phoha",
        "Young B Moon",
        "Amith K Belman"
      ],
      "url": ""
    },
    {
      "title": "Hybrid modeling and simulation for complementing Lifecycle Assessment",
      "year": 2014,
      "abstract": "This paper presents a new complementary lifecycle assessment (LCA) approach to address several limitations of the standard LCA methodology. An integrated approach of agent-based modeling, system dynamics and discrete event simulation was adopted to complement the standard LCA methodology. A hybrid simulation model was developed as a proof-of-concept system, then it was validated using a case study of bottled water and alternative drink products. The model was based on the assumption that parameters and relationships were constant regardless of local uniqueness. The research demonstrates that the hybrid modeling and simulation method can address several limitations of the standard LCA. Also, it is also proven that the method has a potential to address social and economic aspects.",
      "venue": "Computers & Industrial Engineering",
      "citations": 77,
      "authors": [
        "Bochao Wang",
        "Séverin Brême",
        "Young B Moon"
      ],
      "url": ""
    }
  ]
}