{
  "name": "Yue Cao",
  "affiliation": "EECS, Syracuse University",
  "interests": [
    "robotics",
    "artificial intelligence"
  ],
  "citedby": 43,
  "h_index": 4,
  "i10_index": 1,
  "top_primary_author_publications": [
    {
      "title": "Robot Behavior-Tree-Based Task Generation with Large Language Models",
      "year": 2023,
      "abstract": "Nowadays, the behavior tree is gaining popularity as a representation for robot tasks due to its modularity and reusability. Designing behavior-tree tasks manually is time-consuming for robot end-users, thus there is a need for investigating automatic behavior-tree-based task generation. Prior behavior-tree-based task generation approaches focus on fixed primitive tasks and lack generalizability to new task domains. To cope with this issue, we propose a novel behavior-tree-based task generation approach that utilizes state-of-the-art large language models. We propose a Phase-Step prompt design that enables a hierarchical-structured robot task generation and further integrate it with behavior-tree-embedding-based search to set up the appropriate prompt. In this way, we enable an automatic and cross-domain behavior-tree task generation. Our behavior-tree-based task generation approach does not require a set of pre-defined primitive tasks. End-users only need to describe an abstract desired task and our proposed approach can swiftly generate the corresponding behavior tree. A full-process case study is provided to demonstrate our proposed approach. An ablation study is conducted to evaluate the effectiveness of our Phase-Step prompts. Assessment on Phase-Step prompts and the limitation of large language models are presented and discussed.",
      "venue": "Proceedings of the AAAI 2023 Spring Symposium on Challenges Requiring the Combination of Machine Learning and Knowledge Engineering (AAAI-MAKE 2023)",
      "citations": 26,
      "authors": [
        "Yue Cao",
        "CS George Lee"
      ],
      "url": ""
    },
    {
      "title": "Ground Manipulator Primitive Tasks to Executable Actions Using Large Language Models",
      "year": 2023,
      "abstract": "Layered architectures have been widely used in robot systems. The majority of them implement planning and execution functions in separate layers. However, there still lacks a straightforward way to transit high-level tasks in the planning layer to the low-level motor commands in the execution layer. In order to tackle this challenge, we propose a novel approach to ground the manipulator primitive tasks to robot low-level actions using large language models (LLMs). We designed a program-function-like prompt based on the task frame formalism. In this way, we enable LLMs to generate position/force set-points for hybrid control. Evaluations over several state-of-the-art LLMs are provided.",
      "venue": "Proceedings of the AAAI Symposium Series",
      "citations": 6,
      "authors": [
        "Yue Cao",
        "CS George Lee"
      ],
      "url": ""
    },
    {
      "title": "Behavior-Tree Embeddings for Robot Task-Level Knowledge",
      "year": 2022,
      "abstract": "Recently, the behavior tree is gaining popularity as a robotic task-level knowledge representation. Manual design of behavior trees from scratch is tedious and cumbersome. Motivated by the need for an efficient way to reuse or transfer robot task-level knowledge, we propose a vector-space embedding approach that encodes a symbolic task into a numerical form. This approach, called behavior-tree embedding, takes a behavior tree that produces a single task as input and generates a corresponding vector. By exploiting the pretrained language-embedding model and the node-aggregation mechanism, the produced embedding is capable of preserving both semantic information of task description and structural information of the hierarchical task organization. We evaluated the effectiveness and versatility of our proposed vector-space embedding approach in three different tasks.",
      "venue": "2022 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS)",
      "citations": 6,
      "authors": [
        "Yue Cao",
        "CS George Lee"
      ],
      "url": ""
    }
  ],
  "top_secondary_author_publications": []
}