{
  "name": "Zhao Qin",
  "affiliation": "Assistant Professor of Civil and Environmental Engineering, Syracuse University",
  "interests": [
    "biological material",
    "molecular dynamics",
    "material design",
    "biomechanics"
  ],
  "citedby": 8893,
  "h_index": 53,
  "i10_index": 109,
  "top_primary_author_publications": [
    {
      "title": "The mechanics and design of a lightweight three-dimensional graphene assembly",
      "year": 2017,
      "abstract": "Recent advances in three-dimensional (3D) graphene assembly have shown how we can make solid porous materials that are lighter than air. It is plausible that these solid materials can be mechanically strong enough for applications under extreme conditions, such as being a substitute for helium in filling up an unpowered flight balloon. However, knowledge of the elastic modulus and strength of the porous graphene assembly as functions of its structure has not been available, preventing evaluation of its feasibility. We combine bottom-up computational modeling with experiments based on 3D-printed models to investigate the mechanics of porous 3D graphene materials, resulting in new designs of carbon materials. Our study reveals that although the 3D graphene assembly has an exceptionally high strength at relatively high density (given the fact that it has a density of 4.6% that of mild steel and is 10 times as …",
      "venue": "Science advances",
      "citations": 463,
      "authors": [
        "Zhao Qin",
        "Gang Seob Jung",
        "Min Jeong Kang",
        "Markus J Buehler"
      ],
      "url": ""
    },
    {
      "title": "Influence of cross-link structure, density and mechanical properties in the mesoscale deformation mechanisms of collagen fibrils",
      "year": 2015,
      "abstract": "Collagen is a ubiquitous protein with remarkable mechanical properties. It is highly elastic, shows large fracture strength and enables substantial energy dissipation during deformation. Most of the connective tissue in humans consists of collagen fibrils composed of a staggered array of tropocollagen molecules, which are connected by intermolecular cross-links. In this study, we report a three-dimensional coarse-grained model of collagen and analyze the influence of enzymatic cross-links on the mechanics of collagen fibrils. Two representatives immature and mature cross-links are implemented in the mesoscale model using a bottom-up approach. By varying the number, type and mechanical properties of cross-links in the fibrils and performing tensile test on the models, we systematically investigate the deformation mechanisms of cross-linked collagen fibrils. We find that cross-linked fibrils exhibit a three phase …",
      "venue": "Journal of the mechanical behavior of biomedical materials",
      "citations": 440,
      "authors": [
        "Baptiste Depalle",
        "Zhao Qin",
        "Sandra J Shefelbine",
        "Markus J Buehler"
      ],
      "url": ""
    },
    {
      "title": "Polymorphic regenerated silk fibers assembled through bioinspired spinning",
      "year": 2017,
      "abstract": "A variety of artificial spinning methods have been applied to produce regenerated silk fibers; however, how to spin regenerated silk fibers that retain the advantages of natural silks in terms of structural hierarchy and mechanical properties remains challenging. Here, we show a bioinspired approach to spin regenerated silk fibers. First, we develop a nematic silk microfibril solution, highly viscous and stable, by partially dissolving silk fibers into microfibrils. This solution maintains the hierarchical structures in natural silks and serves as spinning dope. It is then spun into regenerated silk fibers by direct extrusion in the air, offering a useful route to generate polymorphic and hierarchical regenerated silk fibers with physical properties beyond natural fiber construction. The materials maintain the structural hierarchy and mechanical properties of natural silks, including a modulus of 11 ± 4 GPa, even higher than natural …",
      "venue": "Nature communications",
      "citations": 276,
      "authors": [
        "Shengjie Ling",
        "Zhao Qin",
        "Chunmei Li",
        "Wenwen Huang",
        "David L Kaplan",
        "Markus J Buehler"
      ],
      "url": ""
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "Fatigue-resistant adhesion of hydrogels",
      "year": 2020,
      "abstract": "The adhesion of soft connective tissues (tendons, ligaments, and cartilages) on bones in many animals can maintain high toughness (∽800 J m−2) over millions of cycles of mechanical loads. Such fatigue-resistant adhesion has not been achieved between synthetic hydrogels and engineering materials, but is highly desirable for diverse applications such as artificial cartilages and tendons, robust antifouling coatings, and hydrogel robots. Inspired by the nanostructured interfaces between tendons/ligaments/cartilages and bones, we report that bonding ordered nanocrystalline domains of synthetic hydrogels on engineering materials can give a fatigue-resistant adhesion with an interfacial fatigue threshold of 800 J m−2, because the fatigue-crack propagation at the interface requires a higher energy to fracture the ordered nanostructures than amorphous polymer chains. Our method enables fatigue-resistant …",
      "venue": "Nature communications",
      "citations": 307,
      "authors": [
        "Ji Liu",
        "Shaoting Lin",
        "Xinyue Liu",
        "Zhao Qin",
        "Yueying Yang",
        "Jianfeng Zang",
        "Xuanhe Zhao"
      ],
      "url": ""
    },
    {
      "title": "Molecular level detection and localization of mechanical damage in collagen enabled by collagen hybridizing peptides",
      "year": 2017,
      "abstract": "Mechanical injury to connective tissue causes changes in collagen structure and material behaviour, but the role and mechanisms of molecular damage have not been established. In the case of mechanical subfailure damage, no apparent macroscale damage can be detected, yet this damage initiates and potentiates in pathological processes. Here, we utilize collagen hybridizing peptide (CHP), which binds unfolded collagen by triple helix formation, to detect molecular level subfailure damage to collagen in mechanically stretched rat tail tendon fascicle. Our results directly reveal that collagen triple helix unfolding occurs during tensile loading of collagenous tissues and thus is an important damage mechanism. Steered molecular dynamics simulations suggest that a likely mechanism for triple helix unfolding is intermolecular shearing of collagen α-chains. Our results elucidate a probable molecular failure …",
      "venue": "Nature communications",
      "citations": 250,
      "authors": [
        "Jared L Zitnay",
        "Yang Li",
        "Zhao Qin",
        "Boi Hoa San",
        "Baptiste Depalle",
        "Shawn P Reese",
        "Markus J Buehler",
        "S Michael Yu",
        "Jeffrey A Weiss"
      ],
      "url": ""
    },
    {
      "title": "Mechanical exfoliation of two-dimensional materials",
      "year": 2018,
      "abstract": "Two-dimensional materials such as graphene and transition metal dichalcogenides have been identified and drawn much attention over the last few years for their unique structural and electronic properties. However, their rise begins only after these materials are successfully isolated from their layered assemblies or adhesive substrates into individual monolayers. Mechanical exfoliation and transfer are the most successful techniques to obtain high-quality single- or few-layer nanocrystals from their native multi-layer structures or their substrate for growth, which involves interfacial peeling and intralayer tearing processes that are controlled by material properties, geometry and the kinetics of exfoliation. This procedure is rationalized in this work through theoretical analysis and atomistic simulations. We propose a criterion to assess the feasibility for the exfoliation of two-dimensional sheets from an adhesive substrate …",
      "venue": "Journal of the Mechanics and Physics of Solids",
      "citations": 246,
      "authors": [
        "Enlai Gao",
        "Shao-Zhen Lin",
        "Zhao Qin",
        "Markus J Buehler",
        "Xi-Qiao Feng",
        "Zhiping Xu"
      ],
      "url": ""
    }
  ],
  "source": "scholar"
}