{
  "name": "Zhenyu Gan",
  "affiliation": "Aerospace and Mechanical Engineering Department, Syracuse University",
  "interests": [
    "gait analysis",
    "trajectory optimization",
    "legged locomotion",
    "multibody dynamics",
    "robotics"
  ],
  "citedby": 373,
  "h_index": 11,
  "i10_index": 11,
  "top_primary_author_publications": [
    {
      "title": "All common bipedal gaits emerge from a single passive model",
      "year": 2018,
      "abstract": "In this paper, we systematically investigate passive gaits that emerge from the natural mechanical dynamics of a bipedal system. We use an energetically conservative model of a simple spring-leg biped that exhibits well-defined swing leg dynamics. Through a targeted continuation of periodic motions of this model, we systematically identify different gaits that emerge from simple bouncing in place. We show that these gaits arise along one-dimensional manifolds that bifurcate into different branches with distinctly different motions. The branching is associated with repeated breaks in symmetry of the motion. Among others, the resulting passive dynamic gaits include walking, running, hopping, skipping and galloping. Our work establishes that the most common bipedal gaits can be obtained as different oscillatory motions (or nonlinear modes) of a single mechanical system with a single set of parameter values. For …",
      "venue": "Journal of The Royal Society Interface",
      "citations": 65,
      "authors": [
        "Zhenyu Gan",
        "Yevgeniy Yesilevskiy",
        "Petr Zaytsev",
        "C David Remy"
      ],
      "url": ""
    },
    {
      "title": "Passive dynamics explain quadrupedal walking, trotting, and tölting",
      "year": 2016,
      "abstract": "This paper presents a simplistic passive dynamic model that is able to create realistic quadrupedal walking, tölting, and trotting motions. The model is inspired by the bipedal spring loaded inverted pendulum (SLIP) model and consists of a distributed mass on four massless legs. Each of the legs is either in ground contact, retracted for swing, or is ready for touch down with a predefined angle of attack. Different gaits, that is, periodic motions differing in interlimb coordination patterns, are generated by choosing different initial model states. Contact patterns and ground reaction forces (GRFs) evolve solely from these initial conditions. By identifying appropriate system parameters in an optimization framework, the model is able to closely match experimentally recorded vertical GRFs of walking and trotting of Warmblood horses, and of tölting of Icelandic horses. In a detailed study, we investigated the sensitivity of the …",
      "venue": "Journal of computational and nonlinear dynamics",
      "citations": 57,
      "authors": [
        "Zhenyu Gan",
        "Thomas Wiestner",
        "Michael A Weishaupt",
        "Nina M Waldern",
        "C David Remy"
      ],
      "url": ""
    },
    {
      "title": "Energy-optimal hopping in parallel and series elastic one-dimensional monopeds",
      "year": 2018,
      "abstract": "In this paper, we examine the question of whether parallel elastic actuation or series elastic actuation is better suited for hopping robots. To this end, we compare and contrast the two actuation concepts in energy optimal hopping motions. To enable a fair comparison, we employ optimal control to identify motion trajectories, actuator inputs, and system parameters that are optimally suited for each actuator concept. In other words, we compare the best possible hopper with parallel elastic actuation to the best possible hopper with series elastic actuation. The optimizations are conducted for three different cost functions: positive mechanical motor work, thermal electrical losses, and positive electrical work. Furthermore, we look at three representative cases for converting rotary motor motion to linear leg motion in a legged robot. Our model featured an electric DC-motor model, a gearbox with friction, damping in the leg …",
      "venue": "Journal of Mechanisms and Robotics",
      "citations": 34,
      "authors": [
        "Yevgeniy Yesilevskiy",
        "Zhenyu Gan",
        "C David Remy"
      ],
      "url": ""
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "Leveraging the template and anchor framework for safe, online robotic gait design",
      "year": 2020,
      "abstract": "Online control design using a high-fidelity, full-order model for a bipedal robot can be challenging due to the size of the state space of the model. A commonly adopted solution to overcome this challenge is to approximate the fullorder model (anchor) with a simplified, reduced-order model (template), while performing control synthesis. Unfortunately it is challenging to make formal guarantees about the safety of an anchor model using a controller designed in an online fashion using a template model. To address this problem, this paper proposes a method to generate safety-preserving controllers for anchor models by performing reachability analysis on template models by relying on functions that bound the difference between the two models. This paper describes how this reachable set can be incorporated into a Model Predictive Control framework to select controllers that result in safe walking on the anchor model …",
      "venue": "2020 IEEE International Conference on Robotics and Automation (ICRA)",
      "citations": 15,
      "authors": [
        "Jinsun Liu",
        "Pengcheng Zhao",
        "Zhenyu Gan",
        "Matthew Johnson-Roberson",
        "Ram Vasudevan"
      ],
      "url": ""
    },
    {
      "title": "Practice Makes Perfect: an iterative approach to achieve precise tracking for legged robots",
      "year": 2023,
      "abstract": "Precise trajectory tracking for legged robots can be challenging due to their high degrees of freedom, unmodeled nonlinear dynamics, or random disturbances from the environment. A commonly adopted solution to overcome these challenges is to use optimization-based algorithms and approximate the system with a simplified, reduced-order model. Additionally, deep neural networks are becoming a more promising option for achieving agile and robust legged locomotion. These approaches, however, either require large amounts of onboard calculations or the collection of millions of data points from a single robot. To address these problems and improve tracking performance, this paper proposes a method based on iterative learning control. This method lets a robot learn from its own mistakes by exploiting the repetitive nature of legged locomotion within only a few trials. Then, a torque library is created as a …",
      "venue": "2023 American Control Conference (ACC)",
      "citations": 6,
      "authors": [
        "Jing Cheng",
        "Yasser G Alqaham",
        "Amit K Sanyal",
        "Zhenyu Gan"
      ],
      "url": ""
    },
    {
      "title": "A template model explains jerboa gait transitions across a broad range of speeds",
      "year": 2022,
      "abstract": "For cursorial animals that maintain high speeds for extended durations of locomotion, transitions between footfall patterns (gaits) predictably occur at distinct speed ranges. How do transitions among gaits occur for non-cursorial animals? Jerboas (Jaculus) are bipedal hopping rodents that frequently transition between gaits throughout their entire speed range. It has been hypothesized that these non-cursorial bipedal gait transitions are likely to enhance their maneuverability and predator evasion ability. However, it is difficult to use the underlying dynamics of these locomotion patterns to predict gait transitions due to the large number of degrees of freedom expressed by the animals. To this end, we used empirical jerboa kinematics and dynamics to develop a unified spring Loaded Inverted Pendulum model with defined passive swing leg motions. To find periodic solutions of this model, we formulated the gait search as a boundary value problem and described an asymmetrical running gait exhibited by the jerboas that emerged from the numerical search. To understand how jerboas change from one gait to another, we employed an optimization approach and used the proposed model to reproduce observed patterns of jerboa gait transitions. We then ran a detailed numerical study of the structure of gait patterns using a continuation approach in which transitions are represented by bifurcations. We found two primary mechanisms to increase the range of speeds at which gait transitions can occur. Coupled changes in the neutral leg swing angle alter leg dynamics. This mechanism generates changes in gait features (e.g., touchdown leg angle and …",
      "venue": "Frontiers in Bioengineering and Biotechnology",
      "citations": 5,
      "authors": [
        "Jiayu Ding",
        "Talia Y Moore",
        "Zhenyu Gan"
      ],
      "url": ""
    }
  ],
  "source": "scholar"
}