{
  "name": "Zhen Ma",
  "affiliation": "Syracuse University",
  "interests": [
    "Tissue Engineering",
    "Organoids",
    "Mechanobiology",
    "induced pluripotent stem cells"
  ],
  "citedby": 2583,
  "h_index": 26,
  "i10_index": 36,
  "top_primary_author_publications": [
    {
      "title": "Self-organizing human cardiac microchambers mediated by geometric confinement",
      "year": 2015,
      "abstract": "Tissue morphogenesis and organ formation are the consequences of biochemical and biophysical cues that lead to cellular spatial patterning in development. To model such events in vitro, we use PEG-patterned substrates to geometrically confine human pluripotent stem cell colonies and spatially present mechanical stress. Modulation of the WNT/β-catenin pathway promotes spatial patterning via geometric confinement of the cell condensation process during epithelial–mesenchymal transition, forcing cells at the perimeter to express an OCT4+ annulus, which is coincident with a region of higher cell density and E-cadherin expression. The biochemical and biophysical cues synergistically induce self-organizing lineage specification and creation of a beating human cardiac microchamber confined by the pattern geometry. These highly defined human cardiac microchambers can be used to study aspects of …",
      "venue": "Nature communications",
      "citations": 237,
      "authors": [
        "Zhen Ma",
        "Jason Wang",
        "Peter Loskill",
        "Nathaniel Huebsch",
        "Sangmo Koo",
        "Felicia L Svedlund",
        "Natalie C Marks",
        "Ethan W Hua",
        "Costas P Grigoropoulos",
        "Bruce R Conklin",
        "Kevin E Healy"
      ],
      "url": ""
    },
    {
      "title": "In vitro cardiac tissue models: current status and future prospects",
      "year": 2016,
      "abstract": "Cardiovascular disease is the leading cause of death worldwide. Achieving the next phase of potential treatment strategies and better prognostic tools will require a concerted effort from interdisciplinary fields. Biomaterials-based cardiac tissue models are revolutionizing the area of preclinical research and translational applications. The goal of in vitro cardiac tissue modeling is to create physiological functional models of the human myocardium, which is a difficult task due to the complex structure and function of the human heart. This review describes the advances made in area of in vitro cardiac models using biomaterials and bioinspired platforms. The field has progressed extensively in the past decade, and we envision its applications in the areas of drug screening, disease modeling, and precision medicine.",
      "venue": "",
      "citations": 195,
      "authors": [
        "Anurag Mathur",
        "Zhen Ma",
        "Peter Loskill",
        "Shaheen Jeeawoody",
        "Kevin E Healy"
      ],
      "url": ""
    },
    {
      "title": "Three-dimensional filamentous human diseased cardiac tissue model",
      "year": 2014,
      "abstract": "A human in vitro cardiac tissue model would be a significant advancement for understanding, studying, and developing new strategies for treating cardiac arrhythmias and related cardiovascular diseases. We developed an in vitro model of three-dimensional (3D) human cardiac tissue by populating synthetic filamentous matrices with cardiomyocytes derived from healthy wild-type volunteer (WT) and patient-specific long QT syndrome type 3 (LQT3) induced pluripotent stem cells (iPS-CMs) to mimic the condensed and aligned human ventricular myocardium. Using such a highly controllable cardiac model, we studied the contractility malfunctions associated with the electrophysiological consequences of LQT3 and their response to a panel of drugs. By varying the stiffness of filamentous matrices, LQT3 iPS-CMs exhibited different level of contractility abnormality and susceptibility to drug-induced cardiotoxicity.",
      "venue": "Biomaterials",
      "citations": 137,
      "authors": [
        "Zhen Ma",
        "Sangmo Koo",
        "Micaela A Finnegan",
        "Peter Loskill",
        "Nathaniel Huebsch",
        "Natalie C Marks",
        "Bruce R Conklin",
        "Costas P Grigoropoulos",
        "Kevin E Healy"
      ],
      "url": ""
    }
  ],
  "top_secondary_author_publications": [
    {
      "title": "Automated video-based analysis of contractility and calcium flux in human-induced pluripotent stem cell-derived cardiomyocytes cultured over different spatial scales",
      "year": 2015,
      "abstract": "Contractile motion is the simplest metric of cardiomyocyte health in vitro, but unbiased quantification is challenging. We describe a rapid automated method, requiring only standard video microscopy, to analyze the contractility of human-induced pluripotent stem cell-derived cardiomyocytes (iPS-CM). New algorithms for generating and filtering motion vectors combined with a newly developed isogenic iPSC line harboring genetically encoded calcium indicator, GCaMP6f, allow simultaneous user-independent measurement and analysis of the coupling between calcium flux and contractility. The relative performance of these algorithms, in terms of improving signal to noise, was tested. Applying these algorithms allowed analysis of contractility in iPS-CM cultured over multiple spatial scales from single cells to three-dimensional constructs. This open source software was validated with analysis of isoproterenol …",
      "venue": "Tissue Engineering Part C: Methods",
      "citations": 324,
      "authors": [
        "Nathaniel Huebsch",
        "Peter Loskill",
        "Mohammad A Mandegar",
        "Natalie C Marks",
        "Alice S Sheehan",
        "Zhen Ma",
        "Anurag Mathur",
        "Trieu N Nguyen",
        "Jennie C Yoo",
        "Luke M Judge",
        "C Ian Spencer",
        "Anand C Chukka",
        "Caitlin R Russell",
        "Po-Lin So",
        "Bruce R Conklin",
        "Kevin E Healy"
      ],
      "url": ""
    },
    {
      "title": "Miniaturized iPS-cell-derived cardiac muscles for physiologically relevant drug response analyses",
      "year": 2016,
      "abstract": "Tissue engineering approaches have the potential to increase the physiologic relevance of human iPS-derived cells, such as cardiomyocytes (iPS-CM). However, forming Engineered Heart Muscle (EHM) typically requires >1 million cells per tissue. Existing miniaturization strategies involve complex approaches not amenable to mass production, limiting the ability to use EHM for iPS-based disease modeling and drug screening. Micro-scale cardiospheres are easily produced, but do not facilitate assembly of elongated muscle or direct force measurements. Here we describe an approach that combines features of EHM and cardiospheres: Micro-Heart Muscle (μHM) arrays, in which elongated muscle fibers are formed in an easily fabricated template, with as few as 2,000 iPS-CM per individual tissue. Within μHM, iPS-CM exhibit uniaxial contractility and alignment, robust sarcomere assembly and reduced variability …",
      "venue": "Scientific reports",
      "citations": 255,
      "authors": [
        "Nathaniel Huebsch",
        "Peter Loskill",
        "Nikhil Deveshwar",
        "C Ian Spencer",
        "Luke M Judge",
        "Mohammad A Mandegar",
        "Cade B. Fox",
        "Tamer MA Mohamed",
        "Zhen Ma",
        "Anurag Mathur",
        "Alice M Sheehan",
        "Annie Truong",
        "Mike Saxton",
        "Jennie Yoo",
        "Deepak Srivastava",
        "Tejal A Desai",
        "Po-Lin So",
        "Kevin E Healy",
        "Bruce R Conklin"
      ],
      "url": ""
    },
    {
      "title": "Generation of spatial-patterned early-developing cardiac organoids using human pluripotent stem cells",
      "year": 2018,
      "abstract": "The creation of human induced pluripotent stem cells (hiPSCs) has provided an unprecedented opportunity to study tissue morphogenesis and organ development through 'organogenesis-in-a-dish'. Current approaches to cardiac organoid engineering rely on either direct cardiac differentiation from embryoid bodies (EBs) or generation of aligned cardiac tissues from predifferentiated cardiomyocytes from monolayer hiPSCs. To experimentally model early cardiac organogenesis in vitro, our protocol combines biomaterials-based cell patterning with stem cell organoid engineering. 3D cardiac microchambers are created from 2D hiPSC colonies; these microchambers approximate an early-development heart with distinct spatial organization and self-assembly. With proper training in photolithography microfabrication, maintenance of human pluripotent stem cells, and cardiac differentiation, a graduate student with …",
      "venue": "Nature protocols",
      "citations": 162,
      "authors": [
        "Plansky Hoang",
        "Jason Wang",
        "Bruce R Conklin",
        "Kevin E Healy",
        "Zhen Ma"
      ],
      "url": ""
    }
  ],
  "source": "scholar"
}